{"organizations": [], "uuid": "934fc3f21c03ed91aba8115b1efc74b0986d0cb6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14589369.ece/ALTERNATES/s1200/0_JS150180934.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15539620", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Sainsbury's and Asda to challenge competition watchdog over mega-merger", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-12T10:35:00.000+02:00", "replies_count": 0, "uuid": "934fc3f21c03ed91aba8115b1efc74b0986d0cb6"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15539620", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Sainsbury's and Asda to challenge competition watchdog over mega-merger", "locations": [], "entities": {"persons": [{"name": "superdry", "sentiment": "none"}], "locations": [], "organizations": [{"name": "asda", "sentiment": "negative"}, {"name": "sainsbury", "sentiment": "negative"}, {"name": "company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Superdry reveals impact of warm weather on profits\nSuperdry has revealed its profits have been impacted by unseasonably warm weather, leading to warning its annual performance will be weaker than previously expected.\nFirst-half underlying profits dropped 49% to £12.9m and the company now expects underlying profit before tax in the current financial year to be somewhere between £55m and £70m, whereas analysts had predicted around £84m.\nThe firm said the unseasonably warm weather has continued through November and into December, Superdry’s two biggest trading months in the year, across all of its key markets.\nIt said: “Given Superdry’s reliance on cold weather related product continues and a lack of innovation in some of its core categories, sales have remained under pressure despite a strong performance in the Black Friday week. This has resulted in an adverse profit impact of around £11m in November and the Company expects a potentially similar profit impact in December if trading conditions do not improve.”\nSuperdry said there is still considerable uncertainty in terms of the weather outlook, the changing shape of consumer behaviour in the peak trading period and the impact of wider economic and political uncertainty.\nEuan Sutherland, Superdry CEO, said:\nSuperdry had a difficult first half, impacted by unseasonably warm weather across our major markets, a consumer economy that is increasingly discount driven and the issues we are addressing in product mix and range.\nIn the spring of this year we started an 18-month product innovation and diversification programme. This will increase choice for consumers around the world and address the current over-reliance on jackets and sweats. We are accelerating into new categories and are particularly excited by the upcoming launch of Superdry Kids. At the same time we are evolving the brand through targeted investment. In everything we do we will build on Superdry’s heritage of offering exceptional quality and design detail at outstanding value.\nSuperdry is a strong brand and has strong operational capabilities. We are focused on an intensified transformation programme to reset the business and address the legacy issues we face, particularly in product mix and range.\nSuperdry is responding to its internal challenges as well as a changing world and changing consumers. Our comprehensive transformation will ensure Superdry is well positioned as we optimise our routes to market and make our business more efficient. We are confident that our transformation programme combined with the underlying operational strengths of the business will deliver a return to higher levels of growth and profitability while realising geographic expansion opportunities and leveraging our multi-channel operating model to serve customers in whichever way suits them best. A Superdry store (Image: Manchester Evening News) 8.59 Sanderson Young owed nearly £1m when it entered administration\nNewcastle estate agent Sanderson Young owed creditors nearly £1m when it entered administration in September.\nA total of £970,238.01 was owed to 32 of the business’s creditors, with the largest amount owed being a tax bill of more than £573,000, according to the administrators’ report.\nThe report by accountants RSM, which has been published on Companies House, also found that Sanderson Young owed Barclays Bank £141,500, CBRE £29,116, James Hay Pension Trustees £38,700, while company co-founder Ian Watson was owed £50,000.\nNewcastle City Council and Northumberland County Council were also owed £15,552 and £2,578, respectively.\nAlso appearing on the company’s list of assets is an “overdrawn directors loan” relating to Mr Young. The outstanding balance of the account was £235,671 and the administrators have said it is “uncertain” how much of the loan will be paid back. Duncan Young of Sanderson Young (Image: NJL) 8.50 Coreena Ford Dixons Carphone to slash costs by £200m amid half-year losses\nRetailer Dixons Carphone has revealed plans to slash costs by £200after tumbling to a half-year loss following a near-£500m hit on its mobile business and store estate.\nThe group’s shares dropped 14% after it swung to a £440m pre-tax loss for the half-year to October 27 against profits of £54m a year earlier after charges of £490m , largely due to a writedown on the value of its Carphone Warehouse arm.\nIt also said it was set to see full-year costs surge to £190m - including a £17m hit from the cyber attack revealed in June that saw 5.9 million bank card details and 10 million personal data records hacked last year.\nBut the group offered a dose of cheer to staff with plans for a share incentive award scheme that will see more than 30,000 employees given at least £1,000 in shares each over the next three years.\nGroup chief executive Alex Baldock also said Dixons Carphone remains committed to its store estate and has no current plans to shut more than the 102 shop closures already announced this financial year.\nThe firm said job losses are not expected as a result of the £200m cost-cutting, with the savings due to come from efforts to merge IT systems and reduce supplier costs.\nIt comes as part of a new strategy overhaul that includes a plan to turn around the fortunes of its loss-making Carphone Warehouse mobile phone chain. Dixons Carphone said it expects a full-year loss from its struggling Carphone business, but confirmed it remains on track for underlying profit guidance of £300m in 2018-19.\nMr Baldock said: “There are headwinds and uncertainty facing any business serving the UK consumer, we’ve had our own challenges, and our plan will take time.\n“But with this plan, we can now see the way to unleashing the true potential of this business. “We believe in our plan, are under way making early progress and determined to make it a lasting success.”\nDixons Carphone said on an underlying basis, interim pre-tax profits dropped to £50m from £73m a year earlier. A branch of Currys PC World, with a Carphone Warehouse inside (Image: PA) 8.46 KEY EVENT Theresa May to face vote of confidence today after Brexit deal chaos\nIt has been confirmed that a vote of confidence in Theresa May will take place tonight .\nThe threshold of 15% of the parliamentary party seeking a vote of confidence in the leader of the Conservative Party has been exceeded.\nIt was announced on Wednesday morning by chairman of the backbench 1922 Committee Sir Graham Brady.\nThe vote will take place tonight between 6-8pm, with the result expected to be announced shortly after.\nSir Graham Brady has received at least 48 letters from Conservative MPs calling for a vote of no confidence in May. Prime Minister Theresa May (Image: PA) 8.42 FTSE 100 and pound update\nThe FTSE-100 index at 8:15am was up 29.21 at 6836.15.\nThe pound at 8am was 1.2505 dollars compared to 1.2523 dollars at the previous close. The euro at 8am was 0.9063 pounds compared to 0.9035 pounds at the previous close. London Stock Exchange (Image: PA) 8.35 Coreena Ford Rolls-Royce starts stockpiling ahead of Brexit\nEngine maker Rolls-Royce said full-year profits are expected to be in the “upper half” of its guidance.\nThe group added it has begun stockpiling as it puts Brexit contingency plans in place, while it was also transferring design approval for large aero engines to Germany amid uncertainty over the withdrawal deal. But it said this was a “precautionary and reversible technical action” and was not set to lead to UK jobs being impacted.\nRolls said: “Rolls-Royce notes the decision by the UK Government to delay the vote on the proposed Withdrawal Agreement and political declaration. “We will continue to implement our contingency plans until we are certain that a deal and transition period has been agreed.” Shares in the firm rose 3% after its improved profit outlook. The Rolls-Royce logo displayed at one of its plants 8.30 KEY EVENT Sainsbury's and Asda to challenge competition watchdog over mega-merger\nSainsbury’s and Asda are challenging the competition watchdog in court for more time to be given to the probe into their £12bn mega-merger on the grounds of its “unprecedented scale and complexity”.\nThe two supermarkets are to apply for a judicial review of the Competition and Markets Authority (CMA) investigation into their proposed tie-up, as they request more time to consider the evidence.\nBut the watchdog has said it will defend its position in court, and is “not willing to compromise on the thoroughness or objectivity” of the investigation.\nThe application, lodged today with the Competition Appeal Tribunal, will request a review of the CMA’s timetable and process.\nSainsbury’s and Asda said they have asked the CMA for an additional 11 working days over the Christmas period to respond to a large amount of material which has recently been provided to them.\nBoth retailers argue the current timetable does not give them or the CMA “sufficient time to provide and consider all the evidence, given the unprecedented scale and complexity of the case”.\nIn a joint statement, Sainsbury’s and Asda said:\nThis is a case of unprecedented size and complexity and we have a responsibility to our customers and colleagues to ensure that we and the CMA have enough time to make and consider all the facts and evidence.\nThis is not a decision we have taken lightly. It is about ensuring a thorough process and reasonable timetable. We remain confident in the case for merging the businesses and the significant customer benefits.\nHowever the CMA said the timeline is typical for an investigation.\nA spokesman said: “As you would expect, investigating any merger of this size requires assessing a large volume of material in a short time-frame, and it is not unusual for the companies involved to do this in the timelines we have been working to with Sainsbury’s and Asda.\n“We have done everything we can to aid their consideration of this work, whilst still ensuring we are able to meet our legally-binding deadline. This includes extending certain administration timelines where appropriate.\n“If we gave the companies the extra time they are now asking for, it would put our ability to complete the investigation by the required deadline at very serious risk. “We are not willing to compromise on the thoroughness or objectivity of our investigation and will robustly defend this case in court.” Asda and Sainsbury's merger: not in the bag just yet (Image: PA) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15539620;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-12-12T10:35:00.000+02:00", "crawled": "2018-12-12T12:25:01.001+02:00", "highlightTitle": ""}