{"organizations": [], "uuid": "18d6819b1054636b602c783b2d8793c4e20b5587", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13563798.ece/ALTERNATES/s1200/corbynmay.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-accused-mouthing-stupid-15572576", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn accused of mouthing 'stupid woman' at Theresa May during PMQs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-19T15:32:00.000+02:00", "replies_count": 0, "uuid": "18d6819b1054636b602c783b2d8793c4e20b5587"}, "author": "Kathryn Riddell", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-accused-mouthing-stupid-15572576", "ord_in_thread": 0, "title": "Jeremy Corbyn accused of mouthing 'stupid woman' at Theresa May during PMQs", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "matt hancock", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}], "locations": [], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "house of commons share click", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Jeremy Corbyn accused of mouthing 'stupid woman' at Theresa May during PMQs The Labour leader was called out on social media after allegedly mouthing the insult in the House of Commons Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nJeremy Corbyn has denied calling Theresa May a \"stupid woman\" during a fiery Prime Minister's Questions.\nA video of the session on Wednesday showed the Labour leader saying something under his breath after the Prime Minister likened Labour 's attempt to table a no confidence motion against her to a pantomime.\nHealth Secretary Matt Hancock wrote on Twitter : \"The mask slips. Jeremy Corbyn's abuse of the Prime Minister shows what a reactionary misogynist he is\".\nHe added: \"Unreal how Corbyn supporters are actually *defending* him calling the PM a \"stupid woman\". Sickening. This misogyny now runs deep in Corbyn's Labour - and runs right to the top.\" Read More PMQs LIVE: Updates as Jeremy Corbyn is accused of calling Theresa May a 'stupid woman'\nConservative Party chairman Brandon Lewis said on Twitter: \"Will @jeremycorbyn apologise or clarify exactly what he was saying? Looks shocking on the film, unacceptable in any environment.\"\nBut a spokesman for Mr Corbyn said: \"He did not call her a stupid woman. He was saying 'stupid people'.\"\nMr Corbyn had demanded to know when Mrs May will actually meet EU leaders to get their approval for changes to her Brexit plan.\nDuring PMQs, he asked: \"She's now claiming she's still seeking further assurances while all the time running down the clock on the alternatives. So can she explain to us when the European Council will meet to approve the changes they have already ruled out?\" Prime Minister Theresa May speaks during Prime Minister's Questions in the House of Commons (Image: PA)\nMrs May dodged the question, instead attacking Mr Corbyn for his lack of an alternative to her Brexit deal.\nShe said: \"Week after week he has stood here on this issue and talked about what he is against. He never says what he is for.\n\"He can talk all he likes about a meaningful vote - after he gives us a meaningful position.\"\nIt came after a fraught exchange, in which Mr Corbyn reminded Mrs May the next meeting of the European Council was not until March.\nMrs May said her \"achievements\" with EU negotiators would be set out in the new year and again insisted Mr Corbyn had no alternative Brexit deal. Read More\nShe said: \"I know it's Christmas and he has looked in his stocking, down the chimney, under the Christmas tree, but he still has not found a Brexit plan.\n\"He has to accept his responsibility for delivering on Brexit.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-19T15:32:00.000+02:00", "crawled": "2018-12-19T19:29:39.012+02:00", "highlightTitle": ""}