{"organizations": [], "uuid": "ed9a981cf8d6e2a9a21d3ed6696fa8efb1e876fc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15531286.ece/ALTERNATES/s1200/0_BRITAIN_May_123295.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/uk-news/brexit-vote-live-theresa-may-15530567", "country": "GB", "domain_rank": 21960, "title": "Theresa May Brexit statement LIVE: Vote could be cancelled as Prime Minister addresses House of Commons", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-10T14:05:00.000+02:00", "replies_count": 0, "uuid": "ed9a981cf8d6e2a9a21d3ed6696fa8efb1e876fc"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/uk-news/brexit-vote-live-theresa-may-15530567", "ord_in_thread": 0, "title": "Theresa May Brexit statement LIVE: Vote could be cancelled as Prime Minister addresses House of Commons", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "theresa may brexit", "sentiment": "negative"}, {"name": "andrea leadsom", "sentiment": "none"}, {"name": "kathryn riddell", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mr justice ouseley", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "pa", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "eu challenge", "sentiment": "none"}, {"name": "royal courts of justice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Kathryn Riddell MPs will still have final say\nJohn Bercow confirmed that if the Government loses the vote when it finally brings back the deal to Parliament then MPs will still have the final say on what happens next.\nIt came after a number of members questioned whether the amendment laid down by former attorney general Dominic Grieve, which passed last week, would remain in force if there are alterations made to the Withdrawal Agreement or Political Declaration when Mrs May goes to renegotiate with Brussels. 19:28 Kathryn Riddell 'We will not renegotiate the deal'\nPresident of the European Council Donald Tusk has said: “We will not renegotiate the deal, including the backstop, but we are ready to discuss how to facilitate UK ratification. European Council President Donald Tusk (Image: Getty Images Europe)\n“As time is running out, we will also discuss our preparedness for a no-deal scenario.” 19:18 Kathryn Riddell Government accused of 'hiding in the toilets'\nThe Government has been accused of “hiding in the toilets” by one of its own MPs for pulling the vote on the Brexit deal.\nMark Francois, to cheers from the Labour benches, said: “What the Government have done today is shameful.”\nHe accused them of a “complete abuse of this House”, adding: “Having been found in contempt recently for the first time in living memory, they have now gone for a ‘buy one get one free’.\n“The whole House wanted to debate this, we wanted to vote on it, the people expected us to vote on it. And the Government have gone away and hidden in the toilets.”\nThe Conservative backbencher added: “People watching this on television will be confused and bemused and very, very angry at the way their own Parliament has let them down, the Government should literally be ashamed of themselves.”\nTo chants of “resign” Mrs Leadsom responded, saying: “I simply do not agree with his assessment.” 18:58 Kathryn Riddell Leader of the House taking questions\nMPs are now putting questions to the Leader of the House Andrea Leadsom on the future of the Brexit vote. 18:40 Kathryn Riddell Letter sent to Corbyn by MPs\nIn his speech in the House of Commons on Monday, Mr Corbyn made no mention of a no confidence vote.\nA number of Labour backbenchers have written to him saying it’s now time to take action.\nThey said in a letter: “Now that we know HM Government can’t get its Brexit ‘deal’ through Parliament, we write to you today to ask that the Labour Party uses this opportunity to to make the case and campaign for a public vote with the option to Remain.”\nIt later says: “The time is now to trigger the stage of the conference motion calling for a public vote.” 18:27 Kathryn Riddell People's Vote pressure on Jeremy Corbyn\nSome Labour MPs are putting pressure on Jeremy Corbyn to start campaigning for a second referendum - to ask voters whether they want to cancel Brexit.\nThey said: “Time is running out.” (Image: Getty Images Europe)\nThe MPs, including Newcastle North MP Catherine McKinnell, aren’t happy with the way Labour leader Jeremy Corbyn has responded to Theresa May’s decision to delay a vote on her proposed Brexit withdrawal agreement.\nMr Corbyn, and other senior Labour colleagues, have said repeatedly that they want a general election.\nAnd Labour’s policy is that if it cannot get a general election then it could support a “People’s Vote”, or second referendum on Brexit. 18:18 Kathryn Riddell Speaker hits out at Theresa May's deferred vote\nMinisters will seek to defer the vote on Theresa May’s Brexit deal without seeking approval of MPs, despite a warning from the Speaker that this would be “deeply discourteous”.\nAfter Theresa May announced she was delaying the meaningful vote, John Bercow hit out at the late stage of abandonment, with 164 having already taken part in three days of debate. Commons Speaker John Bercow (Image: PA)\nUnder Parliamentary rules Theresa May can postpone putting her Withdrawal Agreement before MPs without their approval but he urged her to “give the House the opportunity to express its opinion in a vote whether or not it wishes the debate to be brought to a premature and inconclusive end”.\nHe added: “The other option is for the Government to unilaterally to decline to move today’s business, which means that the House is not only deprived of its opportunity to vote on the substance of the debate tomorrow, but also that it is given no chance to express its view today on whether the debate should or should not be allowed to continue.\n“I politely suggest that in any courteous, respectful and mature environment, allowing the House to have its say on this matter would be the right, and dare I say it obvious course to take.” 18:08 Jonathan Walker Labour confirms it won't try for a general election yet\nA Labour spokesman said: “We will put down a motion of no confidence when we judge it most likely to be successful.\n“It is clear to us that Theresa May will not renegotiate the deal when she goes to Brussels, and will only be asking for reassurances from EU leaders.\n“When she brings the same deal back to the House of Commons without significant changes, others across the House will be faced with that reality.\n“At that point, she will have decisively and unquestionably lost the confidence of Parliament on the most important issue facing the country, and Parliament will be more likely to bring about the general election our country needs to end this damaging deadlock.” 17:57 Kathryn Riddell Lib Dem leader calls for no confidence vote\nLiberal Democrat leader Sir Vince Cable said: “With the fiasco today, the Government has really lost all authority.\n“Let me just say that I and my colleagues will fully support the Leader of the Opposition (Mr Corbyn) if he now proceeds to a no confidence vote, as duty surely calls.” 17:49 Jeremy Corbyn: 'Government is in complete disarray'\nLabour leader Jeremy Corbyn said: “We are in an extremely serious and unprecedented situation.\n“The Government has lost control of events and is in complete disarray.” Jeremy Corbyn (Image: PA)\nBut it seemed clear Labour has no plans at the moment to call a motion of no confidence in the Government, which could lead to a general election.\nInstead, Mr Corbyn challenged Mrs May to achieve a better deal with the EU.\nHe said: “Bringing back the same botched deal either next week or in January - and can she be clear on the timing - will not change its fundamental flaws and deeply held objections right across this House, which go far wider than the backstop alone.\n“This is a bad deal for Britain, a bad deal for our economy and a bad deal for our democracy. Our country deserves better than this.” 17:39 Jonathan Walker Labour MPs put pressure on Jeremy Corbyn to call now for a second referendum\nSome Labour MPs aren’t happy with the way Labour leader Jeremy Corbyn has responded to Theresa May’s decision to delay the Brexit vote.\nMr Corbyn, and other senior Labour colleagues, have said repeatedly that they want a general election.\nAnd Labour’s policy is that if it cannot get a general election then it could support a “People’s Vote” or second referendum on Brexit.\nThe way to get a general election would be to table a motion of no confidence in the Government. If it passed, then there would be 14 days for someone else to try to form a government - and if nobody succeeded then there would be a general election.\nIf it failed then Labour could start campaigning for a People’s Vote.\nBut Mr Corbyn does not appear to be planning to try for an election at the moment (possibly because he thinks Theresa May would win a motion of no confidence).\nA number of Labour backbenchers have written to him saying it’s now time to take action.\nThey said in a letter: “Now that we know HM Government can’t get its Brexit ‘deal’ through Parliament, we write to you today to ask that the Labour Party uses this opportunity to to make the case and campaign for a public vote with the option to Remain.\n“Time is running out.”\nIt later says: “The time is now to trigger the stage of the conference motion calling for a public vote.”\nLabour MPs signing the letter include Newcastle North MP Catherine McKinell, Sunderland Central MP Julie Elliott and Redcar MP Anna Turley. 17:36 Kathryn Riddell Backstop is sticking point for MPs\nThe Northern Irish backstop is an agreement that the UK will stay in the EU’s customs union if no other way can be found to avoid a border between Ireland and Northern Ireland.\nMrs May says that the backstop is only included in her Withdrawal Agreement as a last resort, and if it ever was introduced then it would be temporary.\nBut some Conservative MPs say they fear it would become a permanent arrangement, and the UK would be forced to obey EU rules forever.\nSo the Prime Minister will now ask the EU to provide further reassurances about the backstop. 17:29 KEY EVENT Theresa May to go back to the EU and ask for another deal\nTheresa May will go back to the European Union and ask for a better Brexit deal, after calling off a crunch House of Commons vote in which she was expected to go down to a heavy defeat. Prime Minister Theresa May leaves Number 10 Downing Street\nIn a dramatic statement in the Commons , Mrs May admitted she’d cancelled the vote due for Tuesday because she knew she would lose.\nMrs May said: “If we went ahead and held the vote tomorrow the deal would be rejected by a significant margin.”\nShe said the problem was the planned “backstop”, which is designed to prevent a hard border between the UK and Ireland - and she would ask EU leaders to provide reassurances in order to win over sceptical MPs, she said.\nTalks will begin before EU leaders meet for a summit on Thursday and Friday. 17:20 Kathryn Riddell When would a vote be held?\nA new date for a Brexit vote has not been set but Conservative MP Justine Greening has told the House “the latest we could have the meaningful vote would be 28 March”.\nMrs May declines to say when the vote will come before MPs. 17:12 Jeremy Corbyn urges the Government to \"make way\" for Labour\nMore extracts from Labour leader Jeremy Corbyn’s statement:\nThe Government is in disarray. Uncertainty is building for businesses, people are in despair at the state of these failed negotiations and concerned about what it means about their jobs and their communities …\nAnd the fault for that lies solely at the door of this shambolic government.\nThis Prime Minister is trying to buy herself one last chance to save this deal.\nIf she doesn’t take on board the fundamental changes required then she must make way for those who can. 17:05 KEY EVENT How the North East voted in the EU Referendum\nThousands of voters went to the polls to have their say on the UK’s future in the European Union .\nOn the night of the historic referendum on June 23 2016, the North East’s local authorities held counts and results were then declared centrally in Sunderland. EU Referendum votes are counted (Image: Newcastle Chronicle)\nThe votes from the 382 council counts were then collated at 12 regional centres across the country.\nAnd, as we now know, the people made their voices heard as the UK voted to leave - then Brexit was born.\nHere is a look back at how the North East voted in full. 16:53 What is a People's Vote and how would it work?\nMany MPs say they support a People’s Vote.\nThis basically means holding a second Brexit referendum.\nHowever, supporters of a People’s Vote might object to us saying that. Anti-Brexit campaigners take part in the People's Vote March for the Future in London, a march and rally in support of a second EU referendum. (Image: PA)\nSome of them argue that they want a referendum on whether or not to support the Government’s Brexit deal.\nAnd they say that it would actually be the first referendum on the deal. 16:41 Jonathan Walker\nBirmingham Yardley Labour MP Jess Phillips asks Theresa May whether she thinks changing the details of the backstop will make any difference to Brexiteer Tories, who she says are “caring nothing about their own country but only about their own position”. 16:34", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15530567;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-12-10T14:05:00.000+02:00", "crawled": "2018-12-10T17:26:26.000+02:00", "highlightTitle": ""}