{"organizations": [], "uuid": "cfd3ebbb8ca29b8c2711314f329b9ab729f83c14", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12073268.ece/ALTERNATES/s1200/0_JS61762182.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15534217", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Carpetright reveals £11.7m loss after closing 65 stores", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-11T10:00:00.000+02:00", "replies_count": 0, "uuid": "cfd3ebbb8ca29b8c2711314f329b9ab729f83c14"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15534217", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Carpetright reveals £11.7m loss after closing 65 stores", "locations": [], "entities": {"persons": [{"name": "byron", "sentiment": "none"}, {"name": "rooney anand", "sentiment": "none"}, {"name": "prezzo", "sentiment": "none"}, {"name": "richards", "sentiment": "none"}, {"name": "anand", "sentiment": "none"}, {"name": "rooney", "sentiment": "none"}, {"name": "carluccio", "sentiment": "none"}], "locations": [{"name": "la tasca", "sentiment": "none"}], "organizations": [{"name": "carpetright", "sentiment": "negative"}, {"name": "cafe rouge", "sentiment": "negative"}, {"name": "jonathon manning outgoing greene king", "sentiment": "negative"}, {"name": "greene king", "sentiment": "none"}, {"name": "las iguanas", "sentiment": "none"}, {"name": "cdg", "sentiment": "none"}, {"name": "restaurants cafe rouge", "sentiment": "none"}, {"name": "bella italia.casual dining group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Outgoing Greene King boss appointed chairman of Cafe Rouge owner\nThe outgoing boss of pub company Greene King has been tapped to chair the group behind restaurants Cafe Rouge and Bella Italia.Casual Dining Group (CDG) - which also operates Las Iguanas and La Tasca - has appointed Rooney Anand as chairman, starting this month.It comes after Mr Anand, who has been chief executive of Greene King for 14 years, announced he was stepping down from the group in November.He is to leave the pub company at the end of April 2019, though a successor has not yet been confirmed.Steve Richards, chief executive of CDG, said:\nWe are delighted to welcome Rooney to CDG as our new chairman.\nRooney brings with him exceptional sector experience and everyone at CDG is looking forward to working with him.\nThe appointment comes at a tough time for the casual dining market, which has seen costs and competition soar in the last few years.Chains including Prezzo, Byron, Carluccio’s and Gaucho have all closed sites this year as the challenges of the sector bite.Mr Anand said:\nI’m very much looking forward to supporting Steve and the management team, helping them to build on the solid foundations they’ve established at CDG as they continue to grow and develop the business in the fast moving and competitive casual dining market. Greene King Jonathon Manning Kromek wins $1.99m deal to develop kit to detect biological weapons\nRadiation detection pioneer Kromek is developing a piece of tech to protect the public against biological attacks as part of a new US contract.\nThe Sedgefield firm is already working with the Defense Advanced Research Projects Agency (Darpa), which is part of the US Department of Defense, to supply handheld ‘dirty bomb’ detectors.\nBut this deal – worth $1.99m (£1.57m) – is the first first biological threat-detection contract it has secured with the department.\nThe deal will see Kromek develop a proof-of-concept for a vehicle-mounted piece of kit that can identify the pathogen used in attacks and protect the public from terrorist threats.\nDeveloping the equipment will allow defence agencies to respond more quickly to potential attacks, by reducing the time it takes to identify the weapons.\nKromek’s 12-month contract is part of Darpa’s wider Sigma+ initiative, which has been launched to improve the agency’s existing network for detecting illicit radioactive and nuclear materials. The system will be used to alert authorities to chemical, biological, and explosives threats.\nDr Arnab Basu, chief executive officer of Kromek, said:\nAs the Sigma programme has begun transitioning to the US Department of Homeland Security, Darpa is turning its focus to add the next generation of biological-threat detection systems.\nWe are delighted to be awarded this additional contract from Darpa, as it expands our relationship with them and broadens our expertise into biological threat detection, adding to our radiological and nuclear threat detection capabilities. An officer wears a Kromek DS3 radiation detector in Brussels (Image: Kromek) 9:00 KEY EVENT WPP reveals cost-cutting plans under strategy revamp\nAdvertising giant WPP has revealed plans to slash annual costs by £275m under a three-year overhaul as it looks to turn around is fortunes.The group, which has been rocked by the sudden departure in April of founder and chief executive Sir Martin Sorrell, also plans to shed under-performing parts of the business and make itself leaner.WPP said it aims to reinvest around half of its cost savings into the business over the next two years as it looks to reposition itself as a “creative transformation company” with a greater emphasis on technology.But the restructure is set to cost the group £300m by the end of 2021.And while the group said the actions will “return the company to long-term sustainable growth”, it warned that previously-announced account losses would drag on its performance in the first half of next year.It added that, for the current 2018 results, full-year underlying like-for-like revenues are now expected to fall by close to 0.5%.WPP’s new chief executive, Mark Read, said he was taking a “radical evolution” approach.He said:\nWe are fundamentally repositioning WPP as a creative transformation company with a simpler offer that allows us to meet the present and future needs of clients.\nThe restructuring of our business will enable increased investment in creativity, technology and talent, enhancing our capabilities in the categories with the greatest potential for future growth.\nAs well as improving our offer and creating opportunities for clients, this investment will drive sustainable, profitable growth for our shareholders. Sir Martin Sorrell Jonathon Manning CBI hits out at Prime Minister's decision to delay Brexit vote\nThe CBI has criticised the Government’s decision to delay yesterday’s Brexit vote, claiming further delays could create a “national crisis”.\nThe business group has said that companies are crying out for clarity, and without the Brexit vote they have been left with more uncertainty.\nCarolyn Fairbairn, CBI Director-General, said:\nThis is yet another blow for companies desperate for clarity. Investment plans have been paused for two and a half years. Unless a deal is agreed quickly, the country risks sliding towards a national crisis.\nPoliticians on both sides of the Channel need show leadership, by building consensus to protect both the UK and EU’s prosperity. No one can afford to head into Christmas with the threat of no-deal costing jobs and hitting living standards. CBI Director-General Carolyn Fairbairn (Image: PA) 8:43 Jonathon Manning The Naked Deli opens fifth outlet in Newcastle city centre following investment\nGrowing healthy eating chain The Naked Deli has opened its fifth outlet in the heart of Newcastle city centre as part of ambitious growth plans.\nThe health food specialist first launched its range of juices, superfood salads and sandwiches and raw vegan cakes four years ago from a cafe in Heaton’s Chillingham Road.\nSince then, demand from customers has seen the brand expand with openings in the former Post Office in Gosforth Shopping Centre, in Fenwick food hall and Newcastle Airport.\nIts popularity attracted investment of £2.5m from London’s Foresight Group last June, which the firm is using for further expansion.\nForesight provided growth capital to bolster systems and infrastructure as well as aid the continued rollout of additional sites around the UK, also introducing former Leon MD John Upton, who has been appointed chairman.\nThose growth plans have taken a leap forward with the opening of a fifth venue at 97-99 Grey Street, a new outlet that breathes life into two shops which have lain empty for some time.\nPlans to convert the two units were submitted by Richard Ruddick Architecture, based in Hoults Yard, Newcastle, and swiftly approved last month, paving the way for this week’s opening.\nChris Jones, chief executive officer at The Naked Deli, said:\nWe’re delighted to be opening our fifth store at Grey Street.\nBeing able to cater for those in the centre of town is an important step for us in our mission to bring a balanced and nutritious diet for people in the North East and further afield. “Following on from our successful venture at Newcastle International Airport, this is an important step as we expand into the wider UK market. How a Naked Deli restaurant could look in Newcastle's Central Arcade (Image: Newcastle planning portal - Richard Ruddick Architecture) 8:37 Jonathon Manning Bank customers can now blog spending from specific types of shops\nBarclays has introduced a new service which allows mobile banking customers the ability to blog spending with certain types of retailer - in a move that could help people struggling with addictions.\nThe new feature could be used with those battling gambling addiction, allowing them to cut off their spending in betting shops and on gambling websites.\nPeople can also block their own spending in pubs and bars. Barclays said it has developed the tool to turn off certain types of spending with vulnerable customers in mind.\nA button within the Barclays mobile banking app enables customers to choose which types of retailers they are able to spend with. Attempted payments that fall within the “turned off” category will be automatically declined.\nThe new feature is now available to all Barclays debit card customers, and will be rolled out to credit card holders in the near future. Barclays Bank (Image: PA) KEY EVENT Zytronic's profits hit by drop in ATM screen sales\nTouch screen manufacturer Zytronic has suffered a hit to its revenue and profits after sales to the financial markets came in lower than previous years.\nTurnover for the year ending September 30 2018 came in at £22.3m, around £600,000 lower than in 2017.\nMeanwhile the firm’s operating profit dropped from £5.4m to £4.1m.\nThe company said the decrease in group revenue had been caused by “under performance of touch and non-touch” equipment in the financial market.\nSpeaking in the financial accounts, CEO Mark Cambridge said:\nThe second half trading revenues of £11.7m showed a 10% improvement on the £10.6m reported for the first half. However, as detailed at the interims, first half revenues were affected by the performance of the Financial market (comprising ATM touch and non-touch products), which at £2.8m was £1.1m lower than the prior year (H1 2017: £3.9m).\nThe second half performance was also impacted by the Financial market, but to a lesser degree, as the improvement in the level of sales did not materialise as quickly as hoped.\nAs a result, the total impact was £1.3m of reduced Financial sales for the full year, composed of £0.9m of touch and £0.4m of non-touch. Although growth was seen in other areas such as Gaming, it was the reduced Financial market revenues that significantly contributed to the reported 3% full-year reduction in trading revenues to £22.3m. Zytronic CEO Mark Cambridge (Image: Chris White) 8:25 Jonathon Manning Supply Chain North East launches to help firms diversify and find new clients\nA new multi-million pound programme aimed at businesses wishing to diversify and grow their customer base has been set in motion in the North East.\nSupply Chain North East plans to work with more than 800 businesses over the next three years to help them find new opportunities in new and existing markets.\nThe scheme will play an integral part of the North East Growth Hub and will be led by four companies: RTC North; Generator; the North East Automotive Alliance and the North East Process Industry Cluster.\nColin Bell, business growth director at the North East LEP, is leading the North East Growth Hub.\nHe said:\nSupply Chain North East has been created to enable more collaboration across multiple sectors. For example, often we see smaller businesses wanting to work within manufacturing or automotive but don’t know how to penetrate the market.\nThrough this programme and the partners’ vast networks, we can give valuable advice delivered both at events and via one to one support to help them on that journey.\nA key benefit that businesses will gain is that they will build more diverse revenue streams, reducing reliance on a few customers and markets, which is particularly important with Brexit on the horizon.\nWith new supply chain prospects in the North East, such as the £500m Nexus Fleet Replacement Programme and opportunities further afield, this initiative has been designed to ensure our region’s businesses are well placed to grow their customer base, strengthen supply chain management and diversify their products and services.\nSupply Chain North East also focuses on helping businesses make the most of new technology to drive higher profits, productivity and innovation in new products and services. Colin Bell, business growth director at the North East LEP (Image: (C)The Bigger Picture Agency Ltd) 8:17", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15534217;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-12-11T10:00:00.000+02:00", "crawled": "2018-12-11T11:29:23.008+02:00", "highlightTitle": ""}