{"organizations": [], "uuid": "8102101859538d776a3d4a23ab44e31fa3fe4764", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15235401.ece/ALTERNATES/s1200/3_Ryanair-To-Strike-In-Europe-Ryanair-Cut-Profit-Forecast-After-Post-Brexit-Pound-Plunge.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15507347", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Ryanair faces court action over refusal to pay compensation", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-05T10:30:00.000+02:00", "replies_count": 0, "uuid": "8102101859538d776a3d4a23ab44e31fa3fe4764"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15507347", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Ryanair faces court action over refusal to pay compensation", "locations": [], "entities": {"persons": [{"name": "rachel reeves", "sentiment": "none"}], "locations": [], "organizations": [{"name": "ryanair", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Action needed to stop big companies paying suppliers late,says MPs\nThe Government is being urged to introduce a tougher regime to tackle larger firms which treat small businesses “disgracefully” by paying suppliers late.\nA committee of MPs said it was crucial that small and medium sized enterprises (SMEs) were paid fairly and on time.\nBad payment practices have led to the failure of many smaller companies and prevented others from growing, said the Business Select Committee.\nThere should be a statutory requirement for companies to pay within 30 days, the MPs recommended.\nSeveral companies looked at by the committee took on average more than 60 days to pay an invoice.\nRachel Reeves, who chairs the committee, said: “Small and medium sized businesses are vital to the health of our economy, providing jobs and prosperity to communities up and down the country.\n“But many SMEs are placed in a stranglehold by larger companies deliberately paying late and ruthlessly taking advantage of their suppliers, causing these firms financial instability.\n“Unless the Government levels the playing field and acts to bring in a tougher regime for poor payment practices then we choke off the opportunity for SMEs to invest and grow in the future.”\nShe added that more SMEs should be awarded government contracts, which are paid fairly and on time. Money (Image: Chris Radburn/PA Wire) 9.00 Coreena Ford Borg Warner starts work on £2m R&D facility set to safeguard 200 jobs\nElectric vehicle innovator BorgWarner’s ambitious growth plans have taken a step forward as work starts on a new £2m state-of-the-art research and development lab in Gateshead.\nThe fast-growing firm creates parts for low-carbon vehicles and is benefiting from a global move to increase the use of electric cars.\nUS giant BorgWarner, which bought out Gateshead company Sevcon last year, moved into 55,000 sq ft of premises at the rear of Gateshead College’s Skills Academy for Construction in March 2017. Two existing properties are being remodelled to facilitate the company’s expansion.\nBorgWarner has appointed Knight Frank Newcastle to develop the facility on Team Valley which will safeguard 200 jobs.\nThe laboratory, which will be used by engineers to develop clean technology prototypes for testing, is the second phase of the development. Left to right: David Sidlow, Ian Tew and Martin Westgate at Borg Warner's new R&D facility (Image: Borg Warner) 8.55 Coreena Ford Plans for hotel, shopping and leisure scheme in Blyth take major leap forward\nPlans to transform Blyth seafront with a hotel, shopping and leisure development have taken a major leap forward after they were officially submitted for approval.\nBlagdon Estate is spearheading plans to develop a three-and-a-half acre site around Link House at Blyth’s South Beach, creating a two-phase scheme on the split site which would create 150 jobs.\nNow the developer has submitted plans for the ambitious £6m scheme.\nA planning application has been submitted to Northumberland County Council for the two-phase development, which sits directly to the west of the current Coastline fish and chip restaurant and Ciccarelli’s Ice Cream parlour.\nHundreds of Blyth residents and interested parties attended a public consultation event in Blyth hosted by Blagdon Estate, where the developers gathered feedback ahead of filing the application. A CGI of how the project in Blyth spearheaded by Blagdon Estate could look (Image: Blagdon Estate) 8.50 Drugs firm Takeda secures shareholder backing for £46bn Shire takeover\nJapanese drugs firm Takeda has won shareholder approval for its £46bn takeover of Shire.\nThe company said the proposal had won support from at least 88% of its shareholders at an extraordinary general meeting in Osaka today.\nIt hopes to complete the takeover on January 8, subject to approval from Shire shareholders who are due to meet later today.\nTakeda reached a deal in May to buy Irish rival Shire for £49.01 a share to create a global pharmaceutical giant.\nChristophe Weber, Takeda’s president and chief executive, said: “With shareholder approval secured, we are looking forward to closing the acquisition in the coming weeks to create a more competitive, agile, highly profitable, and therefore more resilient company, poised to deliver highly innovative medicines and transformative care to patients around the world.”\nThe vote comes following concerns the company is taking on too much debt to finance the deal. 8.45 Coreena Ford Patisserie Valerie appoints new finance chief\nPatisserie Valerie has appointed a new interim finance chief as the cake chain attempts to bounce back from a tumultuous few months.\nThe company said Nick Perrin, formerly finance head at veterinary firm CVS, will take up the role while the board searches for a permanent replacement for predecessor Chris Marsh.\nMr Marsh was arrested on suspicion of fraud following the discovery of a black hole in Patisserie Valerie’s accounts in October, but was later released.\nHe has since left the group but is under investigation by the Financial Reporting Council (FRC), which is also probing Grant Thornton’s audit of Patisserie Valerie.\nBoss Steve Francis said: “I am pleased to welcome Nick to Patisserie Holdings. He brings with him the necessary experience to help strengthen the team as the company works tirelessly to put the events of the past months behind it and look forward to the future.”\nThe firm came close to collapse in October after finding the black hole and it was forced to raise emergency funds from chairman Luke Johnson to stay afloat.\nThe future of the company was thrown into doubt after it uncovered fraudulent activity around its financial accounts and was served a wind-up order by the taxman over £1.14m owed to HM Revenue and Customs.\nPaul May, the former boss of the beleaguered cake chain, was also forced to step down as a result of the scandal. A Patisserie Valerie sign (Image: PA) 8.40 Coreena Ford Stagecoach mulls selling its US arm\nTransport giant Stagecoach said it is in talks to sell its US arm as it revealed a £85.4m writedown in the division sent the group tumbling into the red with interim pre-tax losses of £22.6m.\nThe losses for the six months to October 27 compare with pre-tax profits of £96.7m a year earlier.\nStagecoach said the writedown for the US division, where it runs the megabus.com business, was made to reflect “revised view on long-term profitability”. Martin Griffiths, chief executive of Stagecoach, said:\nWhile we recognise the competitive challenges in some of our markets in the UK and North America, we are confident that public transport will be central to delivering government priorities to grow the economy, connect people and communities, reduce road congestion and improve air quality.\nWe are reviewing strategic options for the North America Division and that includes ongoing discussions regarding a possible sale of all or part of the business. Stagecoach, which operates buses in Newcastle, is mulling selling its US arm. (Image: Stagecoach) 8.35 Coreena Ford Retailer Joules planning for hard Brexit\nRetailer Joules is setting up an EU distribution hub and ordering products early as part of contingency plans for a potential hard Brexit.\nThe group also said that it is bracing for expected increased administrative activities and is ramping up its currency hedging activities in anticipation of volatility in the pound as Brexit day approaches.\nBusinesses across the country are preparing for a worst case hard Brexit scenario, which would see imports and exports delayed, ports and roads gridlocked and the pound come under extreme pressure.\nJoules said in a trading update:\nContingency plans have been put in place to mitigate the expected disruption that could arise in the event of a ‘hard Brexit’.\nThese plans include establishing an EU-based third party distribution facility; scheduling earlier inbound product deliveries for our Spring/Summer 2019 ranges; preparation for expected increased administrative activities; and hedging US Dollar requirements more than 12 months forward.\nJoules made the announcement alongside stellar figures released for the first half, which saw revenue for the period increased by 17.6% to £113.1m. Retail sales grew 21.2% to £79.9m, defying the wider gloom on the UK high street. A selection of Joules' wellies. 8.30 KEY EVENT Ryanair faces 'enforcement action' over refusal to pay compensation\nRyanair is facing enforcement action by the airline regulator over its refusal to compensate passengers for flight disruption caused by staff taking strike action.\nThe Civil Aviation Authority (CAA) said the low-cost airline has rejected compensation claims and has now ended its agreement with AviationADR - a CAA-approved body for alternative dispute resolution of passenger complaints.\nThe CAA said it does not believe the strikes are “extraordinary circumstances”, as Ryanair has claimed, and are therefore not exempt, meaning its customers should be compensated.\nRyanair’s flights were hit by widespread strikes over the summer by the carrier’s pilot and cabin crews, while it also suffered amid the industry-wide air traffic control industrial action that saw thousands of flights cancelled across Europe.\nThe CAA said passengers with an existing claim will now have to wait until the outcome of its enforcement action against the airline. The watchdog has made repeated calls for Ryanair to compensate passengers affected by staff strikes.\nWhile airlines can refuse to pay out for “extraordinary circumstances”, such as bad weather or air traffic controller strikes, they must pay compensation for disruption caused by strikes held by its own employees.\nRyanair warned over profits in October after it was stung by strike action, combined with higher oil prices.\nRyanair has seen the strike action knock passenger confidence in the company, revealing in October that passengers made fewer forward bookings into the third quarter, including for the October school half-term and Christmas.\nSince the summer of severe disruption, Ryanair has been securing a series of agreements with unions across Europe over wages and benefits. The latest was announced on Tuesday, with German pilots’ union VC. A Ryanair plane (Image: PA) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15507347;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-12-05T10:30:00.000+02:00", "crawled": "2018-12-08T09:05:57.002+02:00", "highlightTitle": ""}