{"organizations": [], "uuid": "5541ba45d15225b164c5d0ed88889b34b432ea0b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15158366.ece/ALTERNATES/s1200/1_Anti-semitism-in-Labour.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-mps-put-pressure-jeremy-15533316", "country": "GB", "domain_rank": 21960, "title": "Labour MPs put pressure on Jeremy Corbyn to back second referendum that could cancel Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-10T20:04:00.000+02:00", "replies_count": 0, "uuid": "5541ba45d15225b164c5d0ed88889b34b432ea0b"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-mps-put-pressure-jeremy-15533316", "ord_in_thread": 0, "title": "Labour MPs put pressure on Jeremy Corbyn to back second referendum that could cancel Brexit", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [], "organizations": [{"name": "brexit labour", "sentiment": "negative"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "time", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Labour MPs put pressure on Jeremy Corbyn to back second referendum that could cancel Brexit The time has come for Labour to support a 'People's Vote', according to some Labour MPs Share Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nSome Labour MPs are putting pressure on Jeremy Corbyn to start campaigning for a second referendum - to ask voters whether they want to cancel Brexit.\nThey said: \"Time is running out.\"\nThe MPs, including Newcastle North MP Catherine McKinnell, aren’t happy with the way Labour leader Jeremy Corbyn has responded to Theresa May’s decision to delay a vote on her proposed Brexit withdrawal agreement.\nMr Corbyn, and other senior Labour colleagues, have said repeatedly that they want a general election.\nAnd Labour’s policy is that if it cannot get a general election then it could support a “People’s Vote”, or second referendum on Brexit. Read More\nThe way to get a general election would be to table a motion of no confidence in the Government.\nIf it passed, then there would be 14 days for someone else to try to form a Government - and if nobody succeeded then there would be a general election.\nIf it failed then Labour could start campaigning for a People’s Vote.\nBut Mr Corbyn does not appear to be planning to try for an election at the moment.\nIn his speech in the House of Commons on Monday, he made no mention of a no confidence vote. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nA number of Labour backbenchers have written to him saying it’s now time to take action.\nThey said in a letter: “Now that we know HM Government can’t get its Brexit ‘deal’ through Parliament, we write to you today to ask that the Labour Party uses this opportunity to to make the case and campaign for a public vote with the option to Remain.\"\nIt later says: “The time is now to trigger the stage of the conference motion calling for a public vote.”\nLabour MPs signing the letter include Mrs McKinell, Sunderland Central MP Julie Elliott and Redcar MP Anna Turley.\nA Labour spokesman said: \"We will put down a motion of no confidence when we judge it most likely to be successful. Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-10T20:04:00.000+02:00", "crawled": "2018-12-10T22:13:08.012+02:00", "highlightTitle": ""}