{"organizations": [], "uuid": "27308d2d04c24dea05ea1634b56f8003b7a967fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15539696.ece/ALTERNATES/s1200/1_Untitled-design-2.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/showbiz-news/ant-mcpartlin-meghan-markle-carrilion-15539624", "country": "GB", "domain_rank": 21960, "title": "Ant McPartlin, Meghan Markle and Carrilion in top 2018 Google searches - but Brexit is not", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-12T10:33:00.000+02:00", "replies_count": 0, "uuid": "27308d2d04c24dea05ea1634b56f8003b7a967fe"}, "author": "Simon Meechan", "url": "https://www.chroniclelive.co.uk/news/showbiz-news/ant-mcpartlin-meghan-markle-carrilion-15539624", "ord_in_thread": 0, "title": "Ant McPartlin, Meghan Markle and Carrilion in top 2018 Google searches - but Brexit is not", "locations": [], "entities": {"persons": [{"name": "ant mcpartlin", "sentiment": "negative"}, {"name": "carrilion", "sentiment": "negative"}, {"name": "meghan markle", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "invalid email ant mcpartlin", "sentiment": "none"}, {"name": "lisa armstrong", "sentiment": "none"}, {"name": "ant", "sentiment": "none"}, {"name": "declan donnelly", "sentiment": "none"}, {"name": "geordie", "sentiment": "none"}, {"name": "holly willoughby", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "west london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nAnt McPartlin is one of the UK's most Googled people in 2018, while Brexit has not even ranked in the top 10 frequently searched-for news events.\nPresenter Ant took a break from the cameras this year, to get treatment for addiction problems, after he was convicted of drink-driving following a car crash in West London.\nThe Geordie, 43, also announced his split from ex-wife Lisa Armstrong in January. The divorce was formalised in October.\nAnt was the eighth most searched topic on Google, and the fourth most searched for person, in a year where we've had two Royal Weddings, a World Cup and freak weather.\nAnt's friend and long term screen buddy, Declan Donnelly, presented I'm a Celebrity...Get Me Out Of Here with Holly Willoughby - instead of Ant -this year. But Ant is set to return to ITV next year for Britain's Got Talent .\nBrexit makes no appearance in Google's top 10 trending news events, while no major British political figure ranks in the most searched-for people.\nDoomed construction giant Carillion was the sixth-most searched-for topic. Carillion was a partner with Sunderland City Council in Siglion, the firm tasked with redeveloping the former Vaux Brewery and had offices in Gosforth. It announced its liquidation in January. The Vaux project has been taken over by another firm.\nMeghan Markle was the most Googled person in the UK. The actress married Prince Harry in May and is now pregnant.\nThe Spice Girls also made an appearance in 2018's trends. The pop group are reuniting, and will play at Sunderland's Stadium of Light next year.\nGoogle's Year in Search Top 10s UK top trending Google queries Fans at Times Square, Newcastle for the World Cup semi-final (Image: newcastle chronicle)\n1. World Cup (held this summer, won by France)\n2. Meghan Markle (actress married Prince Harry to become Duchess of Sussex)\n3. Royal wedding (star-studded ceremony held in Windsor)\n4. Black Panther (record-breaking action film released)\n5. Roxanne Pallett (embroiled in Celebrity Big Brother 'punch' row)\n6. Fortnite (video game which became hugely popular in 2018)\n7. Demi Lovato (entered rehab after she reportedly suffered overdose)\n8. Ant McPartlin (took break from presenting after drug problems)\n9. A Star Is Born (Lady Gaga and Bradley Cooper film)\n10. Khloe Kardashian (reality star gave birth to her first child) UK top trending people Meghan Markle cradles her baby bump in a blue gown during a royal visit to Fiji\n1. Meghan Markle (actress married Prince Harry to become Duchess of Sussex)\n2. Roxanne Pallett (embroiled in Celebrity Big Brother 'punch' row)\n3. Demi Lovato (entered rehab after she reportedly suffered overdose)\n4. Ant McPartlin (took break from presenting after drug problems)\n5. Khloe Kardashian (reality star gave birth to her first child)\n6. Alexis Sanchez (footballer signed for Manchester United from Arsenal in January)\n7. Sir Alex Ferguson (underwent emergency brain operation in May)\n8. Logan Paul (YouTube star criticised over video featuring dead body)\n9. Sylvester Stallone (announced he was quitting the role of Rocky Balboa)\n10. Pierre-Emerick Aubameyang (footballer signed for Arsenal from Borussia Dortmund) UK top trending news events Prince Harry and Meghan Markle have a second kiss as they ride in an Ascot Landau (Image: PA)\n1. Royal wedding (star-studded ceremony held in Windsor)\n2. Royal baby (Prince Louis was born in April and the Duke and Duchess of Sussex announced in October they would be having a baby)\n3. GDPR (new European laws on data security introduced in May)\n4. Jeremy Thorpe (police revisited 1970s scandal, shortly after BBC series aired)\n5. Spice Girls (reunited for stadium tour without Victoria Beckham)\n6. Carillion (Construction firm went in to liquidation in January)\n7. Australian flu (Brits concerned over strain of illness that spread in January)\n8. Hurricane Florence (US storm caused devastation and death in August and September)\n9. Stormy Daniels (former porn actress who claimed affair with Donald Trump pulled out late on from Celebrity Big Brother appearance)\n10. iPhone XR (new Apple product announced in September) UK top trending sporting events Professional boxer Deontay Wilder (L) listens to Tyson Fury (Image: Getty Images)\n1. The World Cup\n2. Deontay Wilder vs Tyson Fury\n3. Grand National", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-12T10:33:00.000+02:00", "crawled": "2018-12-12T12:25:01.026+02:00", "highlightTitle": ""}