{"organizations": [], "uuid": "c09fc8aa7e8d46c9bbbbcbd5363669e766f043a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/news/north-east-news/article15422597.ece/ALTERNATES/s1200/0_may-presser.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-vote-delayed-breaking-news-15530781", "country": "GB", "domain_rank": 21960, "title": "Is Theresa May delaying Brexit? Prime Minister appears to have pulled vote to avoid defeat", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-10T15:54:00.000+02:00", "replies_count": 0, "uuid": "c09fc8aa7e8d46c9bbbbcbd5363669e766f043a0"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-vote-delayed-breaking-news-15530781", "ord_in_thread": 0, "title": "Is Theresa May delaying Brexit? Prime Minister appears to have pulled vote to avoid defeat", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "brexit", "sentiment": "neutral"}, {"name": "laura kuenssberg", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "bloomberg", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Is Theresa May delaying Brexit? Prime Minister appears to have pulled vote to avoid defeat According to reports by Bloomberg and Laura Kuenssberg, the Prime Minister has delayed a planned vote on her EU withdrawal agreement Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nTheresa May appears to have delayed the vote on her Brexit deal planned for Tuesday.\nIt means she may avoid - or at least delay - a devastating defeat, which might have forced her to resign as Prime Minister.\nUnconfirmed reports have suggested that Mrs May has decided to call off the \"meaningful vote\" on her Brexit deal scheduled for Tuesday.\nA Downing Street spokeswomen told journalists on Monday morning that the vote would go ahead.\nBut just minutes later, the Bloomberg news agency reported that \"a person familiar with the matter\" had revealed it was off.\nThe BBC reported that two Cabinet sources had confirmed it has been pulled.\nA senior Downing Street source poured cold water on the reports, telling the Press Association: \"I would ignore that. They've no business reporting that.\" Read More\nMrs May is to give an oral statement to the House of Commons on the European Union at 3.30pm today, the Speaker's office has confirmed - follow live updates here.\nThe developments occurred as Mrs May took part in a conference call with her Cabinet ministers. Read More\nIn the wake of reports that the Brexit vote had been called off, sterling fell 0.4% against the US dollar to 1.26. Against the euro, the pound was down 0.6% at 1.10.\nLabour chair Ian Lavery said the chaos showed why there needed to be a general election. Ian Lavery (Image: Getty Images Europe)\nHe said: \"This is the most chaotic, farcical time in Parliamentary history.\n\"We have got a Government in office but now in power.\n\"We have a Prime Minister who listens to nobody. She ignores the advice from her own party and her own Cabinet. Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-10T15:54:00.000+02:00", "crawled": "2018-12-10T17:24:30.000+02:00", "highlightTitle": ""}