{"organizations": [], "uuid": "e699edbd4faab3ae2308c63a0a2604b725508eab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15533118.ece/ALTERNATES/s1200/0_Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-brexit-deal-vote-15537528", "country": "GB", "domain_rank": 21960, "title": "Theresa May's Brexit deal vote: When will the vote on Prime Minister's Brexit deal take place?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-11T17:57:00.000+02:00", "replies_count": 0, "uuid": "e699edbd4faab3ae2308c63a0a2604b725508eab"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-brexit-deal-vote-15537528", "ord_in_thread": 0, "title": "Theresa May's Brexit deal vote: When will the vote on Prime Minister's Brexit deal take place?", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "But something significant could happen before January 21.\nFor one thing, Downing Street’s statement doesn’t rule out holding a vote sooner.\nSecondly, what nobody can be sure of at this stage is whether the EU will agree to make any concessions at all.\nIf it turns out the EU is unwilling or unable to compromise, we may find out pretty quickly. Read More Brexiteer MP sets out how Theresa May CAN win support for a Brexit deal\nMany Conservative MPs who oppose Mrs May’s withdrawal agreement say they do so because of the “backstop”.\nThis is an agreement that the UK will stay in the EU’s customs union if no other way can be found to avoid a border between Ireland and Northern Ireland.\nMrs May says that the backstop is only included in her Withdrawal Agreement as a last resort, and if it ever was introduced then it would be temporary. Read More\nBut some Conservative MPs say they fear it would become a permanent arrangement, and the UK would be forced to obey EU rules forever.\nSo the Prime Minister will now ask the EU to provide further reassurances about the backstop.\nIf the EU is unwilling to budge, that will probably become clear sooner rather than later.\nIn that situation, what does Mrs May do? One option would be to try to press ahead with a no-deal Brexit, but nobody really knows what she has in mind. Read More Brexiteer MP sets out how Theresa May CAN win support for a Brexit deal\nIt’s also possible that the Prime Minister could be forced out of office before January 21.\nTory MPs who support a hard Brexit think they are getting closer to the 48 letters they need to hold a no-confidence vote in the Prime Minister.\nIf enough letters are submitted to Sir Graham Brady, chair of the 1922 Committee of backbench Conservative MPs, then Conservative MPs will have a ballot on deposing her.\nIt’s also possible for Labour to call for a motion of no confidence in the Government. This is an entirely separate procedure, and if Labour fails to win a confidence vote then there’s nothing to stop it calling another one later. Read More What is the Brexit backstop? Everything you need to know about the Irish border issue\nLabour is currently reluctant to call for such a vote, saying: “We will put down a motion of no confidence when we judge it most likely to be successful”.\nAt the moment, Labour seems to think this will be when the Prime Minister comes back to the House of Commons with a new deal (or possibly the same deal, if she can’t get any concessions out of the EU). Read More Labour MPs put pressure on Jeremy Corbyn to back second referendum that could cancel Brexit\nLabour leader Jeremy Corbyn told MPs Mrs May was making an “abject mess” of the Brexit negotiations, and said his party would do the “appropriate thing at the appropriate time” when asked whether he would table a motion of no confidence in the Government.\n“We have no confidence in this Government. We need to do the appropriate thing at the appropriate time to have a motion of no confidence in order to get rid of this Government,” he said.\nFor the time being, however, Mrs May has embarked on a whirlwind tour of European capitals to ask EU leaders for help.\nShe’s met Mark Rutte, Prime Minister of the Netherlands, and German Chancellor Angela Merkel.\nMrs May told the Dutch PM that “additional assurances” would be needed on the backstop arrangement to keep the Irish border open after Brexit if the deal was to get through Parliament.\n“The leaders agreed that the backstop was only ever intended to be temporary, the Prime Minister set out the concerns held by many about it in the UK,” said her spokesman. Read More Brexit: Theresa May admits she had to cancel her vote because she would lose\n“She discussed the need for additional assurances on this point in order for the deal with the EU to pass the House of Commons. The Prime Minister and Prime Minister Rutte agreed to work together to find a way through.\nMrs May then flew on to Berlin for a meeting with German Chancellor Angela Merkel and was travelling to Brussels for talks with European Commission president Jean-Claude Juncker and European Council president Donald Tusk.\nDowning Street declined to be drawn on the specific form of reassurance being sought by the PM, saying only that she needed to be sure that it was something which would satisfy MPs.\nAs anger at Westminster continued to fester over the PM’s move to cancel the Brexit vote, MPs were poised for an emergency debate on the situation called by Labour leader Jeremy Corbyn on the day the “meaningful vote” was initially scheduled to take place. Like us on Facebook", "external_links": [], "published": "2018-12-11T17:57:00.000+02:00", "crawled": "2018-12-11T20:35:43.002+02:00", "highlightTitle": ""}