{"organizations": [], "uuid": "1bad219a9caa7e1623e1374f501f5ab3b8e2c8b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2325759.ece/ALTERNATES/s1200/0_LC_DCM_131218remainers_02JPG.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/local-news/campaigners-head-tiverton-calling-peoples-2325688", "country": "GB", "title": "Campaigners head to Tiverton calling for a People's Vote on Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-13T18:50:00.000+02:00", "replies_count": 0, "uuid": "1bad219a9caa7e1623e1374f501f5ab3b8e2c8b9"}, "author": "Lewis Clarke", "url": "https://www.devonlive.com/news/local-news/campaigners-head-tiverton-calling-peoples-2325688", "ord_in_thread": 0, "title": "Campaigners head to Tiverton calling for a People's Vote on Brexit", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "alex pilkington", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "tiverton", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "tiverton hospital", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "brexit news campaigners", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Campaigners head to Tiverton calling for a People's Vote on Brexit Around 25 enthusiastic Devon for Europe supporters from the east of the county led by chairman Alex Pilkington gathered in Tiverton for the People’s Vote Day of Action Share Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nWet and windy weather didn’t stop campaigners calling for a People’s Vote on Brexit.\nAround 25 enthusiastic Devon for Europe supporters from the east of the county led by chairman Alex Pilkington gathered in Tiverton for the People’s Vote Day of Action.\nHe said: “Sadly, the wet and windy weather precluded the planned street stall at the clock tower; however, that didn’t deter the team from making their voices heard in calling for a referendum on the Prime Minister’s so-called Brexit “deal” and in expressing their desire for Britain to maintain full membership of the EU. New banners stating that Brexit will be detrimental to farming, food production and to our much valued health-care services were on clear display for all to see.”\nIn the afternoon, a group of Devon for Europe members assembled at the entrance to Tiverton Hospital, where a roadside flag-wave and “People’s Vote” demonstration took place, along with the display of the new banners. Campaigners for a People's Vote in Tiverton (Image: Devon for Europe)\nPlacards held aloft inviting passing motorists and bus drivers to sound the horn to show their support for our “Stop Brexit” message.\nMr Pikington added: “The positive responses far outnumbering the negative ones - and by a very large margin indeed.\n“So, despite the worst the weather could do at times, Devon for Europe fielded a strong team in Tiverton with a clear purpose: to show support for the People’s Vote campaign.”\nJulian Andrews, Tiverton and Honiton co-ordinator added: “Two and a half years on from the first referendum, people in Tiverton and throughout the UK must be given the chance now to make an informed decision on this issue; a decision which may directly affect their lives, and those of their children and grandchildren for decades to come.” Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-13T18:50:00.000+02:00", "crawled": "2018-12-13T19:21:35.046+02:00", "highlightTitle": ""}