{"organizations": [], "uuid": "83c650e6410818e7b2c382f9c588303d2b6441d5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13563798.ece/ALTERNATES/s1200/corbynmay.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-tables-motion-no-15565106", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn tables motion of no confidence in Theresa May", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-17T22:12:00.000+02:00", "replies_count": 0, "uuid": "83c650e6410818e7b2c382f9c588303d2b6441d5"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-tables-motion-no-15565106", "ord_in_thread": 0, "title": "Jeremy Corbyn tables motion of no confidence in Theresa May", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "theresa may corbyn", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "corbyn", "sentiment": "none"}], "locations": [], "organizations": [{"name": "cancel play now labour", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Jeremy Corbyn tables motion of no confidence in Theresa May Corbyn wants vote on Theresa May's leadership, but chooses not to trigger formal process for trying to get a general election Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nLabour leader Jeremy Corbyn has asked for a no confidence vote in Theresa May as Prime Minister.\nBut he did not appear to be calling for a formal no confidence vote in the Government.\nHe said he was taking action because the Prime Minister had announced that a vote on her Brexit deal will not take place until January.\nMr Corbyn said: \"It's very clear that it's bad, unacceptable, that we should be waiting almost a month before we have a meaningful vote on the crucial issue facing the future of this country.\"\nBy law, the Opposition is entitled to table a motion stating it has no confidence in the Government. This must be debated by the House of Commons and could lead to a general election.\nHowever, Mr Corbyn has chosen not to do this, and instead said he would table a motion of no confidence in the Prime Minister personally. It is unclear whether this would have any legal force if it is approved. Prime Minister speaking in Downing Street after winning a vote of no confidence (Image: PA)\nThe BBC last night reported that Labour Chief Whip Nick Brown, MP for Newcastle East, had told Labour MPs that the party would go ahead and table an official no confidence motion later.\nMr Corbyn announced his plans after the Prime Minister said that the meaningful vote on her proposed Brexit withdrawal agreement would take place in the week commencing January 14. Read More Bad behaviour in the classroom 'grinds teachers down'\nDowning Street had previously said it would happen before January 21.\nLabour initially responded by issuing a statement claiming: \"Theresa May has been forced to bring her botched deal back to Parliament thanks to Labour pressure.\"\nBut Mr Corbyn later told the House of Commons: \"The Prime Minister has obdurately refused to ensure a vote took place on the date she agreed, she refuses to allow a vote to take place this week and is now, I assume, thinking the vote will be on January 14 - almost a month away.\n\"This is unacceptable in any way whatsoever. (Image: BBC)\n\"So, as the only way I can think of ensuring a vote takes place this week, I'm about to table a motion which says the following: 'That this House has no confidence in the Prime Minister due to her failure to allow the House of Commons to have a meaningful vote straight away on the Withdrawal Agreement and framework for future relationships between the UK and European Union.'\n\"That will be tabled immediately, Mr Speaker.\"\nThe Fixed Term Parliaments Act states that a formal motion of no confidence contains the words: “That this House has no confidence in Her Majesty’s Government\".\nHowever, Mr Corbyn has chosen not to table such a motion.\nInstead, he said he would table a motion stating \"that this House has no confidence in the Prime Minister\" - not the Government.\nIt appears that Labour hopes this might win support from Tory MPs who are critical of Theresa May, and from MPs in the DUP, the Northern Ireland party which has supported the Government. Read More Owners of new-build homes face annual fees and strict rules on what they can do to their house\nHowever, the European Research Group, which includes pro-Brexit Tory MPs who have been calling for a new Tory leader, confirmed last night they would vote against Mr Corbyn's motion.\nThe wording of the motion, targeted at Mrs May rather than the Government as a whole, would not trigger the process set out under the Fixed-term Parliaments Act which could eventually lead to a general election.\nBut Labour said it was clearly a confidence motion and should be allocated time for debate by the Government. What is a no confidence motion?\nBy law, the Opposition is entitled to table a motion stating it has no confidence in the Government.\nThe motion must state: \"That this House has no confidence in Her Majesty’s Government.\"\nThe House of Commons must be granted time to hold a debate and a vote on the motion.\nIf MPs voted for it then there would be a 14-day period giving someone else a chance to form a government that does have the confidence of MPs.\nIf no new government had been formed by then, there would be a general election.\nThe procedure is set out in law in the Fixed Term Parliaments Act 2011. Read More Theresa May confirms delayed vote on her Brexit deal will take place in January\nLabour has chosen not to submit a motion that triggers this process.\nAnd it's unclear whether the Government is under any obligation to grant time for Mr Corbyn's motion to be debated.\nThe BBC last night reported that Labour Chief Whip Nick Brown, MP for Newcastle East, had told Labour MPs that the party would go ahead and table an official no confidence motion - with the power to bring down the Government - if the Government refuses to grant time for Mr Corbyn's motion. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-17T22:12:00.000+02:00", "crawled": "2018-12-18T01:45:10.000+02:00", "highlightTitle": ""}