{"organizations": [], "uuid": "b1f44a80d1e74a19a5b75ac03e1ccb2de8025a2e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2074633.ece/ALTERNATES/s1200/0_35914358.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/local-news/what-opposition-leaders-think-leicestershire-2325396", "country": "GB", "domain_rank": 48128, "title": "What opposition leaders think of Leicestershire council tax rise - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.003, "site_type": "news", "published": "2018-12-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "b1f44a80d1e74a19a5b75ac03e1ccb2de8025a2e"}, "author": "Amy Orton", "url": "https://www.leicestermercury.co.uk/news/local-news/what-opposition-leaders-think-leicestershire-2325396", "ord_in_thread": 0, "title": "What opposition leaders think of Leicestershire council tax rise - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "amy orton", "sentiment": "none"}, {"name": "terri eynon", "sentiment": "none"}, {"name": "coun galton", "sentiment": "none"}, {"name": "simon galton", "sentiment": "none"}], "locations": [{"name": "leicestershire", "sentiment": "none"}, {"name": "county hall", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "lib dem and labour", "sentiment": "negative"}, {"name": "leicestershire council", "sentiment": "negative"}, {"name": "leicestershire live", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What opposition leaders think of Leicestershire council tax rise We asked the Lib Dem and Labour leader if they would do things differently Share Amy Orton Local Democracy Reporter 08:52, 14 DEC 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nWe learned yesterday that Leicestershire residents face a nearly four per cent rise in council tax when the budget is set next year.\nThe increase - which will equate to roughly £1 a week for the average county household - will help the authority collect £12 million a year at a time when government grants and other revenue streams are running dry.\nLeicestershire Live asked the opposition, Councillor Simon Galton, leader of the Liberal Democrats and Councillor Terri Eynon, leader of the Labour group at County Hall , what they think... Read More Council tax in Leicestershire is going up: Here's why What are your overall thoughts?\nCoun Galton: “The end of austerity is supposedly here but that’s certainly not the case in Leicestershire.\n“One of the things I’ve highlighted again and again over recent years is the Revenue Support Grant, the reduction in that has been a real driver of the cuts.\n“We’re expecting that to be cut down to nothing, which means the burden of financing services is passed from the government on to the council and therefore the tax payer.\n“The fact that tax payers are now facing a four per cent increase in council tax just goes to show the severity of what’s happening. The bill\n“As I understand it Police and Crime Commissioners are going to be given permission to add £24 on to the bill of the average household as well, another example of tax payers picking up the cost of services the government should be paying for.”\nCouncillor Eynon said: “There’s nothing terribly new in there.\n“The concerning thing for me is how much further can we cut? You can only go so far and then eventually you get to bone. Read More\n“We are now pretty close to the bone.\n“All credit to the staff that this institution is still standing. What would you do?\nCoun Galton: “There are things we would have done differently, there always will be.\n“Things like buying a shopping centre in Tamworth or investing in office space out of the county is something they are very proud of.\n“They say it generates income and it does but the capital investment means that there is less money for capital projects. Read More Local government shake-up plans branded 'financially reckless'\n“We’d have tried hard to protect more of the frontline services and fight the cuts but we understand the position the leading group are in.”\nCoun Eynon said: “We as the Labour group have been talking about a lot of these problems for a long time now.\n“Our MPs need to fight our corner and address the issue of fair funding.” What’s the solution?\nCoun Galton said: “Something needs to change or this council will find itself in a position where it can only provide statutory services.\n“Unless the long term funding situation improves it’s looking bleak.”\nCouncil Eynon said: “The government need to stop faffing around with no confidence votes and Brexit and get back to focussing on the country.\n“It’s time they addressed fair funding and stopped delaying the green paper on adult social care.\n“Locally I respect the Conservative group’s honesty but without government support there are no solutions to many of our problems.” Any positives?\nCoun Galton said: “The local government funding statement has said that Leicestershire will be allowed to retain 75 per cent of business rates when new businesses start up or grow.\n“It is estimated that this will bring in an additional £13 million. This money would otherwise go into the national pool. Read More", "external_links": [], "published": "2018-12-14T02:00:00.000+02:00", "crawled": "2018-12-14T12:10:17.015+02:00", "highlightTitle": ""}