{"organizations": [], "uuid": "c01441f05fd17302625a034e23886bcb0f4b66dc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10728562.ece/ALTERNATES/s1200/JS80266915.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/zytronic-suffers-turnover-blow-sales-15535920", "country": "GB", "domain_rank": 21960, "title": "Zytronic suffers turnover blow as sales of touch ATM screens falls", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-11T14:30:00.000+02:00", "replies_count": 0, "uuid": "c01441f05fd17302625a034e23886bcb0f4b66dc"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/zytronic-suffers-turnover-blow-sales-15535920", "ord_in_thread": 0, "title": "Zytronic suffers turnover blow as sales of touch ATM screens falls", "locations": [], "entities": {"persons": [{"name": "zytronic", "sentiment": "negative"}, {"name": "mark cambridge", "sentiment": "none"}, {"name": "chris white", "sentiment": "none"}, {"name": "share zytronic", "sentiment": "none"}, {"name": "mark cam", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "european union", "sentiment": "none"}, {"name": "invalid email touch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Zytronic suffers turnover blow as sales of touch ATM screens falls Upright casino cabinets continued to be the company's biggest seller Share Zytronic's profits have suffered as a result of the European Union vote Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nTouch screen manufacture Zytronic has seen its turnover dip by £600,000 after lower orders for ATM screens hit sales.\nThe Gateshead firm - which manufactures screens for the gaming, finance and vending machine sectors - saw its group revenue drop from £22.9m to £22.3m for the year ending September 30. Group trading profit fell from £5.4m to £4.1m.\nRevenue was dented by a slump in orders for both touch and non-touch ATM screens. Total sales for these screens came in at £2.8m for the year, £1.3m lower than in 2017.\nWhile Zytronic managed to boost sales in other areas, such as its gaming division, it failed to make up for the shortfall. Zytronic CEO Mark Cambridge (Image: Chris White)\nMark Cambridge, Zytronic’s CEO, said: “Unfortunately we didn’t see the second half showing an improvement for the financial services sector, in fact it was slightly worse.”\nMr Cambridge added that he believed the dip in ATM screen orders had occurred due to challenges in the banking markets. He said the rise of mobile banking was leading to fewer ATMs being used, and that financial services firms were also focusing their efforts on an industry-wide requirement to upgrade their computer software. Read More Supply Chain North East launches to help firms diversify and find new clients\nGaming, which is Zytronic’s biggest market, continued to grow and was dominated by sales of its casino cabinets. The division increased production by 3,000 units and increased its revenue by £500,000 to £8.2m.\nZytronic has continued to develop its presence overseas and has decided to shift its PR focus from China to Japan in the Asian market. The company has brought in a Japan-based search optimisation specialist to manage its microsite as well as a local PR agency.\nDuring the year the firm also started a pay-per-click advertising campaign in Japan across “appropriate social media platforms”.\nCommenting why the company shifted its promotional focus from China to Japan, Mr Cambridge said: “We have evaluated and looked at how we get the benefit of various PR activities and what we get in general returns from those territories. We are active in PR in China but what we have seen is a potential higher growth in Japan so we have flipped that. Read More North East Fund boss assures firms investments are safe despite Brexit\n“The Chinese market is particularly difficult for Western businesses. We always rest on the quality of the product and we do do sales in China.\n“If you look at Taiwan, Korea, and Japan they are more open and more technically advanced so the opportunities we see coming out of those areas are greater than what we see in China. Focusing on them is probably better than trying to bash our heads trying to grow in China.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-11T14:30:00.000+02:00", "crawled": "2018-12-11T17:02:53.008+02:00", "highlightTitle": ""}