{"organizations": [], "uuid": "5fa0ec6dc2030e7f9e3ee62092478fc4111d7ac5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15569579.ece/ALTERNATES/s1200/1_CFR_NJL_141217tristan_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/ignite-boss-criticises-newcastle-city-15569355", "country": "GB", "domain_rank": 21960, "title": "Ignite boss criticises Newcastle City Council for lack of focus on tech sector", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-18T19:43:00.000+02:00", "replies_count": 0, "uuid": "5fa0ec6dc2030e7f9e3ee62092478fc4111d7ac5"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/ignite-boss-criticises-newcastle-city-15569355", "ord_in_thread": 0, "title": "Ignite boss criticises Newcastle City Council for lack of focus on tech sector", "locations": [], "entities": {"persons": [{"name": "watson", "sentiment": "negative"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle city council", "sentiment": "negative"}, {"name": "invalid email newcastle", "sentiment": "none"}, {"name": "jeremie", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ignite boss criticises Newcastle City Council for lack of focus on tech sector Tristan Watson gave the city's leadership and policy a D ranking in a tech 'report card' Share Tristan Watson, CEO of Ignite (Image: -Newcastle Journal) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nNewcastle is “operating so far behind where a city of our potential should be”, according to a leading figure in the North East’s tech scene.\nTristan Watson, CEO of the Ignite accelerator, hit the headlines a year ago when he wrote a blog entitled “ Newcastle is failing tech entrepreneurs” and called for more support to be given to innovative businesses.\nA year on, he has re-visited his original message with a “2018 report card” which outlines how the city’s tech scene has changed over the year.\nIn the article, Mr Watson claims that although the city has benefited from the arrival of the Jeremie 2 funds and additional co-working space, Newcastle is still suffering from a lack of leadership.\nSpeaking to The Journal, Mr Watson said: “It is great we have the Jeremie 2 funds online, It is really essential for the city but that is only one piece of the puzzle. The challenge is having enough high quality companies to invest in over the next five years. We have a challenge to grow and scale those companies.\n“At the moment there is no alignment between public sector, private sector and higher education, and all that needs to come from an overarching strategy we can get behind. It means when people start to go off course someone can grab them and pull them back in the right direction. Read More See first pictures of 2,000-job business park at Newcastle Airport\n“While I have a lot of support for the council, what we don’t have is clear leadership in this sector. They have put out a number of strategies over the years with great aims but with no tangible action.”\nHe added: “To be absolutely clear, I think we need to be thinking about this as a 20-year plan for the city, but crucially what do we do in year one, two, and three to make that happen?”\nMr Watson said there had been good news for the city’s tech scene with investment in a number of companies and the opening of a number of co-working spaces.\nBut he added: “We are still operating so far behind where a city of our potential should be, and there’s a long way to go before we’ve caught up with our peers.\n“Manchester has just announced the development of their fifth WeWork co-working space and Amazon has announced it’s opening a 600 person office in the city (along with a 250 person office in Edinburgh). Read More Dozens of North East businesses call for People's Vote on Brexit\n“Even taking into account the size difference between Manchester and Newcastle, it’s hard to argue that we’re even close in terms of ambition or what we’ve achieved in the last five years.”\nHe called for more leadership from the council and a drive to increase the number of new “high potential” companies in the city, as well as better collaboration between the public, private and education sectors. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-18T19:43:00.000+02:00", "crawled": "2018-12-18T20:47:13.019+02:00", "highlightTitle": ""}