{"organizations": [], "uuid": "b5b7d519712c2f7c08f6bb2bad77667f86d21928", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2102319.ece/ALTERNATES/s1200/0_Princesshay-Exeter-Matt-Austin-51.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/business/exeter-named-among-uks-fastest-2314784", "country": "GB", "title": "Exeter named among UK's fastest growing cities - and this is why", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-12T08:00:00.000+02:00", "replies_count": 0, "uuid": "b5b7d519712c2f7c08f6bb2bad77667f86d21928"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/exeter-named-among-uks-fastest-2314784", "ord_in_thread": 0, "title": "Exeter named among UK's fastest growing cities - and this is why", "locations": [], "entities": {"persons": [{"name": "mark gregory", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "ey", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "ey’s regional economic forecast", "sentiment": "none"}, {"name": "met office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nExeter is set to be one of the UK’s fastest growing cities over the next three years.\nExeter's growth forecast is at 1.8%, according to EY’s Regional Economic Forecast. That's a fraction above the UK average of 1.7%. Exeter comes in at number eight on the list, behind fellow South West city, Bristol (2.0%) at four. Three other cities outside of London top the chart for GVA growth: Reading (2.3%), Manchester (2.2%) and Birmingham (2.0%).\nMark Gregory, EY chief economist said that the main drivers for the expected growth for Exeter is down to the strength of its IT, professional services and energy, particularly renewables.\nBut it's not good news everywhere. The report states that a slowdown in the retail sector, especially on the high street, will pose significant challenges for smaller towns and communities as retail tends to be a major employer in these locations. Britain's biggest supercomputer was installed at the Met Office in 2009, It has been a catalyst for growth in Exeter's tech and science sectors (Image: SOUTH WEST NEWS SERVICE)\nThe South West saw a significant slowdown in its economic growth activity in 2018, with 0.8% Gross Value Added (GVA) growth compared with 1.7% in 2017. Read More New £300million Exeter bus station plans revealed - including ten storey luxury hotel and more restaurants\nHowever, the South West is expected to recapture some ground with its growth rate improving to 1.5% until 2021, although this is still lower than the UK average of 1.7%.\nEmployment growth in the South West, at 0.4% per year over the period to 2021, will also lag behind the UK rate of 0.5% and Bristol’s 0.9%.\nJob creation in business services is expected to be partially offset by falling employment in the manufacturing, public administration and defence sectors. Read More Why Exeter's forgotten Fore Street has just become the place to be\nAndrew Perkins, Managing Partner at EY in the South West, said: \"In the case of the South West, the region’s weaker GVA performance just strengthens the case for driving deeper geographic rebalancing to maximise the potential of all the UK’s regions. Brexit makes this policy even more important, both to maximise growth but also to support the UK’s transformation to be in a position to prosper after Brexit.”\nThe UK economy is growing slower than its historic trend – with annual growth of 1.7% a year to 2021, more than half a point lower than trend. London will continue to outperform all other UK regions through to 2021. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.plymouthherald.co.uk/news/business/2018-tech-list-30-amazing-2177624"], "published": "2018-12-12T08:00:00.000+02:00", "crawled": "2018-12-12T08:38:54.028+02:00", "highlightTitle": ""}