{"organizations": [], "uuid": "84e8399fae92068dac10781480586b155ff77321", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article6350686.ece/ALTERNATES/s1200/3_For-many-of-the-students-this-was-the-first-time-theyve-been-to-London-or-had-access-to-such-large-scale-influential.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15565466", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Big Four accountants face shake-up to halt market dominance", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-18T10:05:00.000+02:00", "replies_count": 0, "uuid": "84e8399fae92068dac10781480586b155ff77321"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15565466", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Big Four accountants face shake-up to halt market dominance", "locations": [], "entities": {"persons": [{"name": "bellwa", "sentiment": "negative"}, {"name": "jason honeyman", "sentiment": "none"}], "locations": [{"name": "newcastle international", "sentiment": "none"}, {"name": "seaton burn house", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "callerton parkway metro station", "sentiment": "none"}, {"name": "newcastle airport business park", "sentiment": "none"}], "organizations": [{"name": "newcastle airport housing", "sentiment": "negative"}, {"name": "coreena ford", "sentiment": "negative"}, {"name": "newcastle airport", "sentiment": "none"}, {"name": "bellway", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford See first pictures of 2,000-job business park at Newcastle Airport\nHousing giant Bellway is to build its new headquarters at a new business park being developed at Newcastle Airport, committing its future to the North East.\nThe FTSE 250 firm will design and build the office which will be located at the south side of Newcastle International airport, close to the Callerton Parkway Metro Station.\nMoving from its current offices at Seaton Burn House, where it has been based for 25 years, will allow Bellway to bring all of its back office functions together under one roof.\nThe development will be the anchor tenant at the Newcastle Airport Business Park, which aims to create around 2,000 jobs.\nJason Honeyman, Bellway chief executive, said: “This move demonstrates Bellway’s firm commitment to the North East as we continue to implement our growth strategy.\n“We recently announced plans for further investment in growth, with the creation of three new regional divisions in response to the continued demand for new homes. To achieve this, it is essential that our central functions have the capacity to expand further. Our new head office will facilitate this.\n“The Airport Business Park is the ideal location for Bellway’s UK head office. Its proximity to the airport, A1 and Central Station will enable us to stay connected with Bellway’s 22 divisions across England, Scotland and Wales.” An aerial view of Bellway's new headquarters (Image: Unknown) 8.49 Coreena Ford Job creation continues but 'Brexit drag' hitting larger firms, report claims\nAlmost half of businesses expect to increase staffing levels in the next year, although concerns remain about a shortage of skilled workers, a new study suggests.\nResearch by the CBI and recruiters Pertemps indicated that confidence was highest among smaller firms, while a “Brexit drag” was affecting larger companies.\nA survey of 350 businesses found that four out of five were worried about access to suitably skilled staff.\nMatthew Fell, the CBI’s chief UK policy director, said:\nBritain’s job market is in good health, but this survey also shows a worrying trend that there aren’t enough sufficiently skilled people to fill the number of job vacancies.\nIt’s encouraging to see firms across the country investing in training their staff and helping them develop new skills, but this investment alone is not the silver bullet that will meet all our needs.\nBusiness and the Government need to plug the skills gap and champion the flexible labour market on which our economic strength relies, to ensure investment continues to flow in.\nTo ensure the UK remains an attractive place for firms to invest and create jobs, it’s also critical a Brexit deal is secured quickly, otherwise the country risks sliding towards a national crisis. Politicians move on from the endless infighting of the past 30 months and come together to secure a workable Brexit deal. European Union and Union flags outside the Houses of Parliament in Westminster (Image: PA) 8.43 KEY EVENT Grainger seals £77m deal for Birmingham 'build to rent' scheme\nNewcastle’s Grainger plc the UK’s largest listed residential landlord - has announced it has agreed to forward fund and acquire a 373-home PRS development at Exchange Square in Birmingham for around £77m.\nThe transaction is subject to a number of conditions that the developer, Nikal Ltd, must meet, including securing planning consent.\nOnce these conditions are satisfied, the transaction will become unconditional, anticipated in mid 2019, after which the scheme will be fully secured, and construction will get under way.\nThe scheme will form part of a new urban village at Exchange Square.\nGrainger expects the investment to generate a gross yield in excess of 6.5% once stabilised, with completion anticipated in 2022.\nHelen Gordon, chief executive of Grainger, said:\nWe are delighted to announce today’s acquisition at Exchange Square in Birmingham for c.£77m, which will deliver 373 homes for rent in a great central location in one of our top target cities.\nBirmingham has exciting growth plans and we are pleased to be part of it. Once Exchange Square is complete, Grainger will have 529 purpose-built PRS homes in Birmingham worth c.£105m, including our other PRS development scheme, Gilders Yard in the Jewellery Quarter. Helen Gordon, CEO of Grainger Plc (Image: Newcastle Journal) 8.39 FTSE 100 and pound update\nThe FTSE-100 index at 8:15am was down 47.98 at 6725.26.\nThe pound at 8am was 1.2641 dollars compared to 1.2605 dollars at the previous close. The euro at 8am was 0.8981 pounds compared to 0.9001 pounds at the previous close. London Stock Exchange (Image: PA) 8.35 KEY EVENT Dozens of North East businesses call for People's Vote on Brexit\nMore than 40 business leaders from across the North East have signed a public letter calling for a second Brexit referendum .\nThe letter has been signed by a host of local businesses who are calling for an end of the uncertainty they face with the Brexit deadline fast approaching and a deal with Brussels yet to be struck.\nAmong those who have signed their name in support of a second referendum are Lakes Distillery CEO Nigel Mills, Matt Boyle from Collingwood Solutions, Graeme Parkins, managing director of Dyer Engineering, as well as former North East LEP board member Gill Southern from Wessington Cryogenics, and Hugh Morgan-Williams from Future Vision.\nMr Mills said:\n“The Prime Minister now has a deal and Parliament at this point in time can’t agree on this deal. We have reached an impasse where no decisions are being made, and if there is one it will be to reject the deal.\n“There is a frustration about a lack of progress. My view is when we did have a vote in 2016, the facts and the consequences of leaving Europe were not represented and the people at that point in time didn’t understand the consequences of leaving or remaining. We are at a point now where people can make an informed decision.” Nigel Mills, Chairman of The lakes Distillery (Image: Newcastle Journal) 8.25 Coreena Ford Wellcome Trust shrugs off 'choppier markets' to boost fund to £26bn\nThe Wellcome Trust has boosted the value of its fund to almost £25.9bn despite “choppier markets” and pledged around £900m a year in charitable spending until at least 2022.\nBritain’s biggest charity and medical research institute said it notched up a total return of 13.4% for the year to September 30, or 10.7% after inflation. It made pre-tax net income of £2.2 billion, flat on the previous year.\nThe group - the main source of non-Governmental biomedical research in the UK - said it has now returned 11.7% on average on its investments in the 10 years since the financial crisis.\nIt said its performance means it can vow to spend around £900m a year on average until 2022 from its primary fund, which covers most of its charitable activities. Another £200m will also be made available for priority areas and other large-scale, high-impact activities such as drug resistant infections and mental health, it added.\nBut the trust cautioned investment returns recorded since the 2008 financial crisis will not continue. 8.20 Coreena Ford Head of Steam owner sees its profits fall as firm invests in new beers and pubs\nThe owner of then Head of Steam pubs has taken a hit to its profits after investing heavily during the last 12 months.\nCamerons Brewery saw its operating profit fall from £3.4m to £2.1m for the year ending April 29 after the company took steps to increase its portfolio of pubs and bars.\nThe Hartlepool-headquartered firm acquired five leasehold outlets for its Head of Steam chain and invested further in its portfolio by refurbishing four of its properties.\nWhile the Camerons’ profits where impacted by the investment, the firm’s turnover increased from £69.9m to £74m during the period.\nFinancial director John Foot said:\nWe are continuing to develop our Head of Steam brand and we are clear to add to our Leeds brewery portfolio, so for us it has been a strong year.\nProfits are slightly down, mainly because we brewed a little bit less and invested heavily in our people as we look to grow our own pubs and brands.\nCamerons operates five different divisions: contract brewing, contract bottling, branded drinks, managed pubs, and its tenanted properties. The Head of Steam pub in Newcastle (Image: Newcastle Chronicle) 8.15 Coreena Ford Angling Direct books rising sales\nAngling Direct reeled in rising sales in the last quarter as it profited from record Black Friday sales.\nThe fishing retailer posted a 31.5% rise in sales to £14.6 million in the four months to November 30, while in-store like-for-like turnover increased by 7.2% to £4.96m.\nOnline revenue rose 24.3% to £6.7m, with sales in Black Friday week rocketing 55.8% to £1.3m.\nAngling Direct chief executive Darren Bailey said: “The company has taken great encouragement from the recent performance against the backdrop of a difficult retail trading environment.\n“As the business launches its new international websites and continues to invest in its stores and overall customer experience, we believe that Angling Direct remains well placed to build on its market leading position.”\nInternational sales were up 96.1% during the period, driven by Angling Direct’s new German language website.\nThe stellar trading update comes after the firm said it is to raise £20m to bankroll a store expansion programme and develop its online offering.\nThe company wants to open around 20 new stores in the UK in 2019 and 2020 as well as “significantly” increase online sales. Its performance comes in stark contrast to rival Fishing Republic, which has announced its intention to appoint administrators. A salmon angler. Angling Direct has reeled in rising sales. 8.10 Coreena Ford Ofgem proposes reforms to energy system\nEnergy regulator Ofgem has tabled proposals to “re-wire” Britain’s energy system in a move it says could save consumers £45 per year.\nOfgem said that limits will be placed on how much energy network firms can pay to their shareholders.\nThe regulator also proposed to keep adjusting the cost companies face to borrow so that “consumers continue to benefit from the fall in interest rates since the financial crisis”.\nThe lower overall cost of capital is expected to save consumers £6.5bn in the next price controls from 2021 onwards, Ofgem said. Ofgem has proposed baseline cost of equity returns at 4%, down 50% from previous price controls.\nAlongside the network price controls, Ofgem will also press ahead with further network charging reforms to “squeeze more capacity out of the electricity grids” to cut the cost to consumers of moving to a smarter energy system.\nThis includes incentives for drivers to charge electric vehicles outside peak times, to allow more electric vehicles to be charged from the existing grid Jonathan Brearley, executive director for systems and networks, said:\nOur proposals for the new network price controls and charging reforms will help build a lower-cost, fairer energy system which is fit for this smarter, cleaner future.\nWe want to cut the cost to consumers for accommodating electric vehicles, renewables and electricity storage, and make sure that all consumers benefit from these technologies.\nBut National Grid said Ofgem’s cost of equity range does not reflect the risk borne by the operations of transmission networks, adding that the new framework needs to ensure fair returns to shareholders as well as consumers. Ofgem has tabled proposals to “re-wire” Britain’s energy system (Image: Andrew Milligan/PA Wire) 8.00 KEY EVENT Market dominance of Big Four accountants to be challenged\nBritain’s big four accountancy firms will have their stranglehold on the audit market challenged as part of a radical shake-up of the scandal-hit industry.\nA probe into the sector carried out by the Competition and Markets Authority proposes that audits of the UK’s biggest companies, listed on the FTSE 350, should be carried out by at least two firms, one of which should be from outside the big four of KPMG, Deloitte, PwC and EY.\nThis, the CMA argues, will give smaller firms access to the largest clients, allowing them to develop their experience and credibility, while also ensuring a “cross-check on quality”.\nIn addition, the CMA is considering a possible market share cap to ensure that some major audit contracts are only available to non-Big Four firms.\nThe role of the dominant big four accountancy giants has come under intense scrutiny recently and the CMA’s investigation was sparked by the failures of Carillion and BHS, and the ensuing criticism of the accountants charged with auditing their books.\nHowever, the watchdog stopped short of recommending they be broken up.\nThe competition watchdog’s other proposals include a split between audit and advisory businesses within big four firms, requiring separate management, accounts and remuneration.\nIt also wants closer regulatory scrutiny of auditor appointments and management from within firms.\nCMA chairman and former Tory MP Andrew Tyrie said: “Addressing the deep-seated problems in the audit market is now long overdue. Most people will never read an auditor’s opinion on a company’s accounts. But tens of millions of people depend on robust and high-quality audits. If a company’s books aren’t properly examined, people’s jobs, pensions or savings can be at risk.”\nA separate hard-hitting review has said that the accountancy watchdog is not fit for purpose and should be swept aside and replaced with an independent statutory regulator. A probe into the sector has been carried out by the Competition and Markets Authority More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15565466;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-12-18T10:05:00.000+02:00", "crawled": "2018-12-18T12:07:20.009+02:00", "highlightTitle": ""}