{"organizations": [], "uuid": "ae35718cbfdd5d74771b1ff0f1532a702f01cae4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2318039.ece/ALTERNATES/s1200/0_shutterstock_10293832.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/stag-partys-freaky-devon-themed-2318033", "country": "US", "title": "Stag party's freaky Devon-themed stripper request revealed", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-11T22:01:00.000+02:00", "replies_count": 0, "uuid": "ae35718cbfdd5d74771b1ff0f1532a702f01cae4"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/stag-partys-freaky-devon-themed-2318033", "ord_in_thread": 0, "title": "Stag party's freaky Devon-themed stripper request revealed", "locations": [], "entities": {"persons": [{"name": "steve roddy", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "bristol", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThe UK's leading stag party organiser has revealed what lads really got up to in 2018 - including one very freaky Devon-themed stripper request.\nStagWeb has trawled the records to reveal where stag parties went, what they did and what they got up to.\nThe company's records revealed some interesting facts about stag parties, including that Bristol is the most popular UK destination, most stag parties are held in June and the average spend on activities, entertainment, food and drink is £4,270.\nStagWeb's Director of Operations Steve Roddy said, \"Just like wedding budgets, stags are spending more and travelling further for their stag weekends. Bristol is the most popular stag weekend destination and the average stag expenditure has risen. Despite worries elsewhere over Brexit, more stags than ever opted to head to Europe and early indications for 2019 show it's set to be yet another record breaking year.\" Read More Devon's best Airbnbs for large groups of family or friends \"Our study also bursts some stag myths, only 10% of groups went on an organised drinking activity and just 1 in 10 involved strippers or nudity (which is less than hen weekends). Yet a huge 91% of stags booked an activity that involved sport or adventure. So what happens on tour can quite happily be posted on Facebook.”\nStagWeb has revealed its weirdest stag requests and stories of the year.\nOn one occasion when the stags hired a stripper it turned out she was the groom's ex-wife. Despite the initial surprise/confusion she did perform her routine.\nAnd another story has a weird Devon twist. A request for a limousine with a stripper in a Torquay United football kit has been listed among StagWeb's three weirdest requests of the year.\nWhat the fascination with The Gulls is hasn't been revealed, although they famously get scored on more than a stripper at a stag do. Torquay United players watch on during the shootout against Basingstoke Town (Image: Tom Sandberg/PPAUK)\nThe other two were a ladyboy stripper (because the groom had history) and a photo of Bill and Ted to be left in the groom's bedroom.\nStagWeb's stats show 3,226,392 people attended stag do's last year in an average party size of 13 people. Top 5 Most Popular UK Stag Party Destinations Top 5 Most Popular International Stag Party Destinations Berlin", "external_links": ["https://www.stagweb.co.uk/", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-11T22:01:00.000+02:00", "crawled": "2018-12-11T22:55:40.033+02:00", "highlightTitle": ""}