{"organizations": [], "uuid": "82e64421eef180e884161282cac8e47c869237ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15544330.ece/ALTERNATES/s1200/0_Theresa-May-Faces-A-Confidence-Vote-In-Her-Leadership-Over-Brexit.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-confirms-delayed-vote-brexit-15564537", "country": "GB", "domain_rank": 21960, "title": "Theresa May confirms delayed vote on her Brexit deal will take place in January", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-17T19:14:00.000+02:00", "replies_count": 0, "uuid": "82e64421eef180e884161282cac8e47c869237ec"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-confirms-delayed-vote-brexit-15564537", "ord_in_thread": 0, "title": "Theresa May confirms delayed vote on her Brexit deal will take place in January", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May confirms delayed vote on her Brexit deal will take place in January The vote on Theresa May's proposed Brexit withdrawal agreement will be held in the week commencing January 14 Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nPrime Minister Theresa May has vowed to let Parliament make a decision about her Brexit deal in the week beginning January 14.\nAnd she ruled out holding a People’s Vote or second referendum on Brexit, despite reports that some of her own Cabinet Ministers have been discussing the idea.\nIt means the “meaningful vote” on her Brexit deal will take place on Monday January 14 or the days immediately following.\nThe Prime Minister told MPs: “It is now only just over 14 weeks until the UK leaves the EU. And I know many Members of this House are concerned that we need to take a decision soon.”\nMrs May has been negotiating with EU leaders in an attempt to win changes that might convince MPs to support the deal. However, there has been no sign that the European Union is willing to make any concessions.\nThere is particular opposition to the proposed “backstop”, which is designed to prevent a hard border between Ireland and Northern Ireland. Many MPs fear this could lead to the UK being forced into a permanent customs union with the EU, which would mean it is forced to obey rules it has no control over. Read More Government accused of trying to 'fool' residents over £1.3bn funding promise\nMrs May insisted she had made progress in her negotiations, but admitted there was more to do. British Prime Minister Theresa May returns to Downing Street after the Confidence Vote in her leadership on December 12, 2018 i (Image: Getty Images)\nShe said: “I understand that. And I want us to go further still in the reassurances we secure.”\nAnd she ruled out the idea of holding second Brexit referendum, saying: “Another vote which would do irreparable damage to the integrity of our politics, because it would say to millions who trusted in democracy, that our democracy does not deliver.” Read More Funding increase for North East police - but crime commissioner says its not enough\nLabour had told the media that party leader Jeremy Corbyn would announce plans to table a vote of no confidence in Theresa May. However, following her statement, Labour changed its plans and no vote was tabled.\nMr Corbyn told the House of Commons: “The deal is unchanged and not going to change. This House must get on with the vote and move on to consider the realistic alternatives.”\nDowning Street had previously said that the vote would be held by January 21, which is in line with Mrs May's promise to hold it in the week commencing January 14. However, Mr Corbyn's supporters said he had succeeded in forcing her to name a date in the the House of Commons.\nCalls for a second Brexit referendum have been backed by 42 small and medium-sized business leaders across the North East. Read More Here are the huge problems being ignored as the nation focuses on Brexit\nThey issued a statement warning: “Most businesses wish to stay in the single market and customs union - so-called frictionless trade - and we note that all government impact assessments confirm that we will be worse off with any option other than the status quo, particularly in the North East.”\nThey said now seemed unlikely that Prime Minister Theresa May would be able to persuade the House of Commons to approve her proposed Brexit withdrawal agreement adding: “In the circumstances outlined above, we the undersigned therefore support calling a second referendum.” Read More Theresa May stays as Prime Minister after winning vote of no confidence - but she'll quit before 2022\nAnd a number of North East MPs have joined a cross-party campaign urging Theresa May to rule out a no-deal Brexit, in order to save manufacturing jobs.\nA total of 62 MPs signed a letter warning: “Manufacturing plants employ thousands of our constituents and their jobs will be put at immediate risk if the United Kingdom leaves the European Union with no deal.”\nReferring to the day the UK is set to leave the EU, they said: “We are acutely aware that 29th March is fast approaching.”\nThe letter states: “The renaissance of manufacturing and its supply chains in this country, bolstered by demand for exports, has markedly improved the lives of our constituents.\n“The principal market for these exports has been the European Union.”\nMPs who have signed the letter include Roberta Blackman-Woods, MP for City of Durham; Julie Elliott, MP for Sunderland Central; Kevan Jones, MP for North Durham; Anna Turley, MP for Redcar; Sharon Hodgson, MP for Washington and Sunderland West; Helen Goodman, MP for Bishop Auckland, and Bridget Phillipson, MP for Houghton and Sunderland South. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-17T19:14:00.000+02:00", "crawled": "2018-12-17T20:13:17.008+02:00", "highlightTitle": ""}