{"organizations": [], "uuid": "b0eaa894f549da7a665e8f5e894eda36dcdf564d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2314870.ece/ALTERNATES/s1200/2_JamesJPG.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/mum-gave-cpr-save-son-2314883", "country": "US", "title": "Mum gave CPR to save son knocked from horse by hit and run driver", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-11T13:54:00.000+02:00", "replies_count": 0, "uuid": "b0eaa894f549da7a665e8f5e894eda36dcdf564d"}, "author": "Colleen Smith", "url": "https://www.devonlive.com/news/devon-news/mum-gave-cpr-save-son-2314883", "ord_in_thread": 0, "title": "Mum gave CPR to save son knocked from horse by hit and run driver", "locations": [], "entities": {"persons": [{"name": "news mum", "sentiment": "none"}, {"name": "james skull", "sentiment": "none"}, {"name": "james", "sentiment": "none"}, {"name": "colleen smith", "sentiment": "none"}], "locations": [{"name": "beaford", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "invalid email", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Mum gave CPR to save son knocked from horse by hit and run driver The teenager was left unconscious in the road at Beaford and police are trying to trace the driver of the black car Share Colleen Smith Regional Head of Content 11:54, 11 DEC 2018 James Skull and his horse Fuego (Image: Val Skull) Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nA mother has told how she had to give lifesaving CPR to her teenage son after he was knocked from his horse in a country lane by a hit and run driver.\nJames Skull, 17, a trainee riding instructor, was heading out for a ride at 3.30pm near his family's Aller Stud farm in Beaford when the crash happened on Mill Road at just before 4pm on Tuesday December 4 .\nAs he rode his horse Fuego down the narrow Devon lane a car drove around a blind bend at speed.\nFuego reared up, came down on the bonnet of the black car and then reared a second time, falling backwards on top of James.\nJames was left unconscious for an unknown length of time. When he work up the black car had driven off. Luckily James was wearing a fully fitted riding helmet but suffered a broken wrist and sprained ankle. Read More Carpetright blames Brexit as it shuts stores and sees profits tank\nMum Val Skull said: \"When James woke up he phoned his dad. A neighbour stayed with James while Tony brought the horse back.\n\"We took James to hospital and he was treated for his broken wrist and sprained - but he didn't have a skull X-ray at that point. James Skull and his horse Fuego (Image: Val Skull)\n\"Then when he woke up the next morning he started throwing up and I realised something wasn't right and decided to take him into hospital.\n\"I called out to see if he was ready to go and there was silence.\n\"I went into his room and found him unconscious. I rang 999 for an ambulance and while I was waiting I was on the phone to the call handler and his breathing was getting so light and slow that the operator told me to start chest compressions.\n\"I am a riding instructor and so I have my first aid certificates and knew what to do. But doing it on your own son was terrifying.\n\"Then after 20 to 30 compressions he suddenly started breathing and regained consciousness - he was in such a state and didn't know where he was. James Skull and his horse Fuego (Image: Val Skull)\n\"The Devon Air Ambulance arrived but they couldn't fly him to Derriford because of the low cloud weather conditions and he was taken to Exeter by land ambulance and he was given a brain scan. For a few hours he was pretty bad and they said he had a severe concussion. He is slowly getting back to himself.\" Read More Town left 'dangerously exposed' to drug problem by lack of police\nInvestigating officer constable Adam Williams said: “It’s believed that the vehicle involved was a small black car, believed to be a 08 plate, possibly a Vauxhall Corsa.\n“The vehicle is likely to have damage to its bonnet and front end so I would appeal to any local garages or body repair shops that have repaired a vehicle of this description since the incident, to contact police”.\nPolice would like to speak to anyone who witnessed the incident, and from anyone who may have information that could assist with enquiries. Please contact 101@dc.police.uk quoting log number 650 of 4 December.\nVal thanked people locally who had been helping in the search and said the car possibly could have been a Mitsubishi. Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-11T13:54:00.000+02:00", "crawled": "2018-12-11T13:58:21.000+02:00", "highlightTitle": ""}