{"organizations": [], "uuid": "bf89dcee52864f115d3b1e32ae2a054fae05b842", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/incoming/article2321705.ece/ALTERNATES/s1200/0_Our-Future-Our-Choice-NI-protest-at-Stormont.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/uk-world-news/top-trending-questions-google-2018-2321526", "country": "US", "title": "Top 10 trending 'what is...?' questions on Google in 2018 - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "bf89dcee52864f115d3b1e32ae2a054fae05b842"}, "author": "Paul Atkins", "url": "https://www.devonlive.com/news/uk-world-news/top-trending-questions-google-2018-2321526", "ord_in_thread": 0, "title": "Top 10 trending 'what is...?' questions on Google in 2018 - Devon Live", "locations": [], "entities": {"persons": [{"name": "paul atkins", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "vero", "sentiment": "none"}], "organizations": [{"name": "google", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Top 10 trending 'what is...?' questions on Google in 2018 From bitcoin to Brexit, these are Google's top trending questions of the year Share Paul Atkins SEO Content Editor 09:16, 13 DEC 2018 Brexit has rarely been out of the news in 2018 (Image: Brian Lawless/PA Wire) Get\nWith the world more confusing than ever in 2018, Google users were bombarding the search engine with loads of \"what is...?\" questions.\nHere are the 10 which, according to Google, were the top trending questions of the year.\nNote, these were not the most searched questions, but the ones that had significant spikes in traffic at times in the year compared to 2017. Read More Horoscopes 2019: What has the year got in store for you? 10. What is Vero?\nVero is a social media app . It sprung to prominence early in 2018 when it said it was offering a limited number of customers its service free for life. It was seen as an ad-free alternative to Instagram at a time when the Facebook-owned app was increasing ads and altering its algorithms to change what users saw in their feeds. Brexit dominated much of the news in 2018 (Image: Joe Giddens/PA Wire) 9. What is the Brexit deal?\nA topic that dominated much of the news in 2018 , Theresa May finally announced a deal had been agreed for the UK's withdrawal from the European Union in November. But the PM recently shelved a planned vote by MPs on the proposal, leaving the deal in doubt again. Read More How average speed cameras work - and how to avoid a fine 8. What is Uefa Nations League?\nUefa's Nations League tournament, played for the first time in 2018-19, may have baffled people initially with its complex structure, but it soon won a place in the hearts of football fans. The four-tiered group system meant games remained competitive, there were fewer tedious friendlies to watch and crucially - in England, at least - the Three Lions made it to next June's final four. Read More Are you risking £5k fine by splashing pedestrians with your car? 7. What is upskirting?\nUpskirting - the practice of taking pictures up skirts without the wearer's knowledge or consent - is to become a specific criminal offence under legislation to be introduced by the Government. Kilt wearers will also be protected. The annual Diwali Festival of Light (Image: Surrey Advertiser) 6. What is Diwali?\nDiwali is the Hindu festival of lights . It's celebrated each year in the autumn in the northern hemisphere, and in the spring in the southern hemisphere. It celebrates the victory of light over darkness, with extensive festivities that vary between regions. Read More What is the Squatty Potty and are you 'pooping all wrong'? 5. What is the Commonwealth?\nThe British Empire is a collection of 53 states, most of which are former territories of the British Empire. As countries gained independence from the UK, many joined the Commonwealth, which states that all members are \"free and equal\". The organisation is now more about trade and shared values, and is celebrated every four years during the Commonwealth Games - as happened in April in Australia. Read More Are you breaking the law when you defrost your car? 4. What is a nerve agent?\nSergei and Yulia Skripal were poisoned by a nerve agent, Novichok, in Salisbury in March, with two more people, Charlie Rowley and Dawn Sturgess , affected three months later. The Skirpals and Mr Rowley survivied, but Ms Sturgess died from her exposure. The toxic substance disrupts signals in the nerves, causing the body to become overstimulated. Read More 8 plastic surgery procedures trending now: Bizarre or not? 3. What is an ibex?\nAn ibex is a species of goat , and most definitely not a deer. Searches trended back in May thanks to the rebooted quiz show Who Wants To Be A Millionaire , when new host Jeremy Clarkson wrongly told a contestant he got the £16,000 question, \"What type of animal is an ibex?\" right. Clarkson was as shocked as anyone when Alan Horsburgh lost £15,000 for saying deer. \"I've seen ibex boinging along and they looked like deer to me,\" Clarkson said. Read More When is National Baby Making Day and why is it the best day to conceive? 2. What is GDPR?\nThe EU's General Data Protection Regulation came into force this May, giving individuals more control over what companies are able to do with their personal data. It also created an unstoppable wave of emails from brands telling customers that their privacy policies had changed. Bitcoin was seldom out of the news at the end of 2017 and the start of 2018 (Image: Dominic Lipinski/PA Wire) 1. What is Bitcoin?\nBitcoin is a cryptocurrency, a sort of secure digital money. It was seldom out of the news at the end of 2017 and the start of 2018 as its value soared and then fell again. The steep rise in value sent many scrabbling to find passwords for their long-forgotten Bitcoin wallets. Like us on Facebook", "external_links": [], "published": "2018-12-13T02:00:00.000+02:00", "crawled": "2018-12-13T11:35:23.012+02:00", "highlightTitle": ""}