{"organizations": [], "uuid": "530c0c8534bf645634346e2e5d6d3e3448e71230", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15500078.ece/ALTERNATES/s1200/0_Cabinet-Ministers-Meet-As-Brexit-Turmoil-Continues.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-tech-sector-slams-government-15499576", "country": "GB", "domain_rank": 21960, "title": "Newcastle tech sector slams Government for pro-Brexit Tweet", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-03T18:15:00.000+02:00", "replies_count": 0, "uuid": "530c0c8534bf645634346e2e5d6d3e3448e71230"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-tech-sector-slams-government-15499576", "ord_in_thread": 0, "title": "Newcastle tech sector slams Government for pro-Brexit Tweet", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "newcastle tech trust", "sentiment": "none"}, {"name": "newcastle helix", "sentiment": "none"}, {"name": "tech nation", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe Government’s attempts to sell its Brexit deal lurched into farce after a tech group in Newcastle hastily distanced itself from attempts to associate it with “benefits” of the deal.\nNewcastle Tech Trust - which supports start-ups across the city - has criticised the Government for tagging it into a tweet calling on digital firms to back Prime Minister Theresa May’s Brexit agreement.\nThe tweet claimed that the deal will “enable us to build on the current success of the UK’s world leading digital and tech sector”, before going on to tag in Newcastle Tech Trust , Newcastle Helix, and Tech Nation.\nBut frustrated with being associated with the Government’s pro-Brexit message, the Tech Trust not only distanced itself from the campaign, but said the EU had done more for the region’s tech sector than the UK Government. Read More Young Newcastle businesswoman Lizzy Hodcroft 'dazzles' investors on Dragons' Den\nThe organisation replied: “We weren’t consulted before being associated with this message. We don’t support it.\n“EU membership has increased sector investment, enabled accelerator programmes, attracted European founders, and attracted talent. There is no evidence our community will benefit from this deal.”\nThe Government’s tweet was sent out as part of a campaign calling on Newcastle’s digital businesses to support Prime Minister Theresa May’s Brexit deal.\nIn the campaign, Digital and Culture Secretary Jeremy Wright said the Government had “secured the best deal possible to protect out businesses and make sure our personal data is processed safely and securely”. Culture Secretary Jeremy Wright (Image: Getty Images)\nBut despite Mr Wright’s assurances, Newcastle Tech Trusts claims the Brexit deal threatens the city’s tech industry, which is worth around £1.3bn.\nJonathan Grubin, CEO of Newcastle tech firm SoPost and one of the Trust’s board members, said: “We were not consulted at all on the message. Beyond the lack of consultation the deal has no support for it among the tech community in Newcastle.\n“A no deal would be awful but the deal that has been presented threatens the long term future of the tech sector in the North East. Freedom of movement is very important and a lot of rules and regulations around technology and trade are all threatened by the deal.\n“Beyond whether this is good or bad, no one has been asked what we want.”\nMr Grubin also raised concerns that the Government has done little to address the shortfall of tech investment that will occur when the UK leaves the EU. Jonathan Grubin, founder of SoPost (Image: Unknown)\n“I started SoPost back in 2012 and we only really exist because of high risk investment capital made available by the EU. That has helped dozens, if not hundreds, of businesses like us. Without that support it would be impossible for me to be here.\n“There has been no mention of what will replace the European Investment Bank funding. That has left us very worried about what the future looks like.\n“If you look at the Government’s track record, the EU has done more than the UK Government to help.”\nA spokesman for the Department of Digital, Culture, Media and Sport failed to provide an answer as to why the Tech Trust had been tagged in the tweet.\nHowever, the spokesman said: \"Our deal with the EU proposes new arrangements on digital and data while protecting the rights of EU citizens currently working in the UK. This gives certainty to the sector as we work to achieve our aim of making the UK the best place in the world to start and grow a digital business. \"The Chancellor announced at Budget that if no future relationship with the European Investment Bank is in place when the UK leaves the EU we will provide the British Business Bank with up to £200m additional investment in venture capital and growth finance in 2019/20.\n\"And at London Tech Week 2018 we announced a new £2.5 billion British Patient Capital programme, which is expected to attract a further £5bn in private investment, to support UK companies with high-growth potential to access the long-term investment they need to grow and go global.\"\nLocal MPs have also criticised the Government’s message to Newcastle’s tech community. Read More Winners of North East Businesswomen of the Year Awards are unveiled\nLabour’s Catherine McKinnell, MP for Newcastle North, took to Twitter to say: “The Govt is peddling misleading information to get its botched blindfold #Brexit deal through Parliament.\n“Have we learned nothing from the Brexit referendum campaign? It’s time to level with the British public & let them - presented with the facts - decide.”\nAnd Chi Onwurah, MP for Newcastle Central and Shadow Minister for Industrial Strategy, Science and Innovation, also took aim at the Government, adding that none of her constituents had lobbied her to vote for the deal.\nShe said the Government tweet had been sent out in desperation over its “blindfold Brexit deal”.\nThe Journal has contacted the Department of Digital, Culture, Media and Sport for comment. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-03T18:15:00.000+02:00", "crawled": "2018-12-04T02:25:47.024+02:00", "highlightTitle": ""}