{"organizations": [], "uuid": "00ddec7ff4c522df5daf91eb28433fbaaaffb0fe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15540127.ece/ALTERNATES/s1200/0_RLP_MDG_14069JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/piers-morgan-caught-tweeting-pamela-15540174", "country": "GB", "domain_rank": 21960, "title": "Piers Morgan caught tweeting Pamela Anderson on air during breaking Theresa May news", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-12T13:03:00.000+02:00", "replies_count": 0, "uuid": "00ddec7ff4c522df5daf91eb28433fbaaaffb0fe"}, "author": "Sonia Sharma", "url": "https://www.chroniclelive.co.uk/news/north-east-news/piers-morgan-caught-tweeting-pamela-15540174", "ord_in_thread": 0, "title": "Piers Morgan caught tweeting Pamela Anderson on air during breaking Theresa May news", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "pamela anderson", "sentiment": "negative"}, {"name": "robert peston", "sentiment": "none"}, {"name": "piers", "sentiment": "none"}, {"name": "graham brady", "sentiment": "none"}, {"name": "piers morgan", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}], "organizations": [{"name": "news piers morgan", "sentiment": "negative"}, {"name": "piers morgan", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Piers Morgan caught tweeting Pamela Anderson on air during breaking Theresa May news The ITV presenter was spotted tapping away on his phone while political editor Robert Peston discussed the Tories holding a no confidence vote on Wednesday morning Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily\nGood Morning Britain host Piers Morgan was caught sending a tweet to Pamela Anderson live on air when news broke of Theresa May facing a vote of confidence.\nIt was confirmed on Wednesday morning that Sir Graham Brady, chairman of the backbench 1922 Committee, had received at least 48 letters from Conservative MPs calling for a vote of no confidence in the Prime Minister .\nAnd it was announced the vote would take place on Wednesday night between 6pm and 8pm.\nWhile ITV political editor Robert Peston was discussing the shock news on the programme, Piers was spotted tapping away on his mobile phone. Prime Minister Theresa May makes a statement in Downing Street after it was announced that she will face a vote of no confidence, to take place tonight (Image: Getty Images)\nIt was then revealed he had been sending a tweet to Pamela Anderson.\nThe actress had first tweeted: \"I understand it’s not easy to accept me as I am. I stir pots unconventionally and will continue to do so. I’m fulfilling my purpose.\n\"My grandfather and father -the romantiques, poets ... We need more of these - they were both intellectuals - both elusive, reclusive and quiet.\"\nMorgan then retweeted the message and wrote: \"I love you just the way you are Pamela - keep stirring those pots.\"\nGood Morning Britain viewers took to Twitter and hit out at Piers for using his mobile. Read More\nOne said: \"Love the way you have time to play with your phone whilst supposed to be working.\"\nAnother wrote: \"Concentrate on Robert Peston Piers!\"\nOne tweet read: \"Robert Peston talks about Brexit whilst Piers texts Pammy lol\"\nOne viewer said it was rude of Piers to be using his phone at that time. Piers Morgan on Good Morning Britain (Image: ITV)\n\"So rude, tweeting Pamela whilst Robert Peston speaking on GMB,\" he said.\nAnd one woman questioned: \"Can't Pamela Anderson wait?\"\nWhile another added: \"Get off your phone and listen to the answers being given to your questions!! How rude!!\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-12T13:03:00.000+02:00", "crawled": "2018-12-12T13:39:41.000+02:00", "highlightTitle": ""}