{"organizations": [], "uuid": "94640df8c29996599b5c51ce2da831c30bbee8bd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2246692.ece/ALTERNATES/s1200/1_GettyImages-1069559860.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/government-release-brexit-deal-legal-2292111", "country": "US", "title": "Government to release Brexit deal legal advice after being found to be in contempt of Parliament - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-04T02:00:00.000+02:00", "replies_count": 0, "uuid": "94640df8c29996599b5c51ce2da831c30bbee8bd"}, "author": "Andrew Woodcock", "url": "https://www.devonlive.com/news/devon-news/government-release-brexit-deal-legal-2292111", "ord_in_thread": 0, "title": "Government to release Brexit deal legal advice after being found to be in contempt of Parliament - Devon Live", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "keir starmer", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "parliamen", "sentiment": "none"}, {"name": "westminster", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "parliament", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "democratic unionist party", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Government to release Brexit deal legal advice after being found to be in contempt of Parliament It is the first time in modern history that a Government has been found in contempt of Parliament. Share Prime Minister Theresa May makes a statement on the draft Brexit withdrawal agreement in the House of Commons, London\nTheresa May's Government is to release its legal advice on the Brexit deal on Wednesday, after being found in contempt of Parliament over its refusal to publish it in full.\nIn dramatic scenes at Westminster, the Prime Minister's Democratic Unionist Party allies joined Labour and other opposition parties to inflict defeat on the Government by 311 votes to 293.\nThe humiliating division came shortly before Prime Minister Theresa May was due to open a five-day debate on her deal, amid widespread expectations that her proposals are set for rejection by MPs.\nLabour's shadow Brexit secretary Sir Keir Starmer said that the finding of contempt was \"a badge of shame\" for the Government, with \"huge constitutional and political significance\".\nIt is the first time in modern history that a Government has been found in contempt of Parliament.\n\"It is highly regrettable that the Government has let it come to this, but ministers left the opposition with no option but to bring forward these proceedings,\" said Sir Keir. Read More\n\"By treating Parliament with contempt, the Government has proved it has lost its majority and the respect of the House.\n\"The Prime Minister can't keep pushing Parliament away or avoiding responsible scrutiny.\"\nOnly hours before the vote, Mrs May had told Cabinet that \"candid\" legal advice given to ministers must remain confidential, despite a motion passed by the Commons last month demanding the release of the \"final and full\" papers.\nAttorney General Geoffrey Cox insisted the Government has \"gone out of its way\" to satisfy the terms of the humble address to the Queen passed by Parliament on November 13 which demanded the release of the legal advice in full.\nSpeaking in the Commons after the vote, Leader of the Commons Andrea Leadsom said: \"We've tested the opinion of the House twice on this very serious subject.\n\"We've listened carefully and in light of the expressed will of the House we will publish the final and full advice provided by the Attorney General to Cabinet.\" Read More School Nativity photography and filming laws for parents explained\nMrs Leadsom has written to the Committee of Privileges watchdog, calling for an inquiry into the use of the humble address procedure, which had fallen out of use since the 19th century but has been revived by Labour to inflict a number of binding defeats on the Government.\nThe constitutional row came as: Bank of England governor Mark Carney warned a no-deal Brexit could result in shopping bills soaring by 10%; The European Court of Justice's senior lawyer said that Article 50, which started the Brexit process, could be revoked unilaterally by the UK; A senior Toyota executive warned a no-deal Brexit could result in \"stop-start production\" for weeks or months at the car giant's UK plant; The BBC dropped proposals for a TV debate featuring Mrs May, Labour leader Jeremy Corbyn followed by a discussion between eight panellists including politicians from different sides of the Brexit argument. Want more news?\nTo keep up to date with Plymouth Live's latest news, follow us on Facebook here and Twitter here , or visit our homepage at www.plymouthlive.com\nFor Devon news, find Devon Live's Facebook page here , or our Twitter page here , or visit our homepage at www.devonlive.com\nFor Cornwall news, find Cornwall Live's Facebook page here , or our Twitter page here , or visit our homepage at www.cornwalllive.com Like us on Facebook", "external_links": [], "published": "2018-12-04T02:00:00.000+02:00", "crawled": "2018-12-04T20:20:38.028+02:00", "highlightTitle": ""}