{"organizations": [], "uuid": "d98ddce2dbff1d27b8bacbce38cc8a3fdd72d934", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2334977.ece/ALTERNATES/s1200/1_CaptureJPG.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/pick-up-business-monthly-magazine-2334960", "country": "GB", "domain_rank": 48128, "title": "Pick up a Business Monthly Magazine - free with the Leicester Mercury on Tuesday, December 18 - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.202, "site_type": "news", "published": "2018-12-17T02:00:00.000+02:00", "replies_count": 0, "uuid": "d98ddce2dbff1d27b8bacbce38cc8a3fdd72d934"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/pick-up-business-monthly-magazine-2334960", "ord_in_thread": 0, "title": "Pick up a Business Monthly Magazine - free with the Leicester Mercury on Tuesday, December 18 - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "tom pegden", "sentiment": "none"}, {"name": "nick davis", "sentiment": "none"}], "locations": [{"name": "leicester mercury", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "business monthly magazine", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The December 2018 Business Monthly Magazine Get Business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThere's lots to read about in the end-of-year edition of Business Monthly Magazine, which comes with the Leicester Mercury on Tuesday December 18, writes Business Editor Tom Pegden.\nWith the #Brexitshambles in full flow, anyone would think the world was coming to an end. (We might not be there yet, but there’s still plenty of time for that to happen next year.)\nHaving said that there are lots of businesses and business people out there with plenty to smile about.\nTake Shoe Zone’s chief executive Nick Davis, the subject of this month's Big Interview.\nHe oversees a retailer that has bucked many of the problems facing the high street thanks to keenly priced shoes sourced from trusted partners in China. Shoe Zone chief executive Nick Davis is this month's Big Interview\nThey aren’t restricted by the same fashion trends that have hit other chains while their online sales are growing strongly and making up a growing proportion of their bottom line.\nLikewise, investment in out-of-town big box stores is also paying off – all led from a big head office and warehouse a stone’s throw from Leicester’s inner ring road.\nThen there's the team at bespoke holiday company Magnetic North Travel, near Melton – the subject of our December Inside Story – are also smiling after picking up a Queen’s Award for Enterprise.\nFounder Laura Greenman has built a business model that clearly works well, with her holidays to Canada and Scandinavia outflanking online travel companies in the process. Laura Greenman, pictured with daughter Alice, runs Magnetic North Travel\nShe’s planning for Brexit like everyone, but hopes it’s not going to make too much of a dent in her finances.\nAlso looking forward are the management at Hinckley and Rugby Building Society and Leicester construction consultancy Pick Everard, who we also talk to this month.\nBoth are growing and winning new custom – the building society with a new chief executive Colin Fyfe, and the building consultancy with a long-standing boss, Duncan Green, in place.\nWe also catch up with a Leicester design agency that is working on big projects around the world, find out about the future of high speed internet in Leicestershire and take a trip to Sherwood Forest.\nAnd we find out who has won our 2018 Fantasy Shares Game. How exciting is that?\nI hope you are able to pick up a copy of the magazine. Like us on Facebook ", "external_links": [], "published": "2018-12-17T02:00:00.000+02:00", "crawled": "2018-12-17T13:05:44.026+02:00", "highlightTitle": ""}