{"organizations": [], "uuid": "642c7ec25f4d4c35204555df7d06be2657d2567b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12646277.ece/ALTERNATES/s1200/GWR_-NJL_230217cheese_01.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/durhams-prima-cheese-gears-up-15574117", "country": "GB", "domain_rank": 21960, "title": "Durham's Prima Cheese gears up for export growth after investment in new equipment", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-19T18:31:00.000+02:00", "replies_count": 0, "uuid": "642c7ec25f4d4c35204555df7d06be2657d2567b"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/durhams-prima-cheese-gears-up-15574117", "ord_in_thread": 0, "title": "Durham's Prima Cheese gears up for export growth after investment in new equipment", "locations": [], "entities": {"persons": [{"name": "behroz beni", "sentiment": "none"}], "locations": [{"name": "durham", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "prima cheese", "sentiment": "negative"}, {"name": "durham", "sentiment": "negative"}, {"name": "city press", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Durham's Prima Cheese gears up for export growth after investment in new equipment The company is planning to switch on a new state-of-the-art production line in early 2019 Share Prima Cheese in Durham has created new jobs following its expansion (Image: City Press) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nPrima Cheese is gearing up to grow its exporting division after a year of strong growth and investment.\nThe Seaham firm saw its turnover jump £6m to £65.5m for the year ending April 1, after demand for its products increased both in the UK and overseas.\nDespite this the company’s operating profit fell from £2.8m in 2017 to just £833,000. Profit after tax fell from £2.3m to £625,000.\nThe company said the profit dip was caused due to increased costs and price fluctuations.\nSpeaking in the company’s accounts, director Behroz Beni said: “Wholesale cheese prices fluctuated hugely throughout the period which, along with a significant swing in the customer sales mix, meant that the company had to absorb higher direct costs resulting in gross margins reducing from 11.7% to 8.1%. Despite this the company was able to increase volumes in its two major sales markets, UK wholesale and export wholesale, resulting in turnover for the period increasing by 10% to £65.5m. Read More Champagne bar pulls into Newcastle Central Station to serve bubbles and real ale\n“Export growth continues to be a key strategy for the business. The company has developed a strong non-EU customer base which should minimise the sales risk the Brexit may bring.”\nPrima Cheese specialises in selling cheese for use when making pizzas. Along with its main brand, Prima Cheese, the firm also sells its Elite Authentic, Soprano, Buttercup Cheddar, Simply Dice and Simply Melt Pizza Strings ranges.\nThe firm’s profits were also dented due to investment it carried out throughout the year. This included investing in new systems and a new production line that is due to be brought online in the coming months. Read More Five leading business groups issue strong warning over no-deal Brexit\nMr Beni said: “The period was one of development for the company as the directors continued to invest heavily in the premises, plant and people, required to ensure the company could achieve its mid to long term strategic goals. As a result of this investment the administrative expenses increased throughout the period, partly due to the average number of employees increasing by 13 across the year.\n“This increased cost allowed the company to train key staff and implement new systems ahead of the launch of a state-of-the-art production line in early 2019. The directors are confident this investment will make the company more efficient, versatile and offer a greater range of products to existing and new markets.” Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-19T18:31:00.000+02:00", "crawled": "2018-12-19T20:37:29.000+02:00", "highlightTitle": ""}