{"organizations": [], "uuid": "2481ff6cf1b3eeac71bb3dca0cb2ed7eb7236558", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1442594.ece/ALTERNATES/s1200/pavilionday.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/business/torquays-harbour-hotel-plan-ever-2293220", "country": "US", "title": "Will Torquay's harbour hotel plan ever actually happen? - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-08T02:00:00.000+02:00", "replies_count": 0, "uuid": "2481ff6cf1b3eeac71bb3dca0cb2ed7eb7236558"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/torquays-harbour-hotel-plan-ever-2293220", "ord_in_thread": 0, "title": "Will Torquay's harbour hotel plan ever actually happen? - Devon Live", "locations": [], "entities": {"persons": [{"name": "devon live will torquay", "sentiment": "none"}, {"name": "kate", "sentiment": "none"}, {"name": "cary green", "sentiment": "none"}, {"name": "gordon brown", "sentiment": "none"}], "locations": [], "organizations": [{"name": "torquay", "sentiment": "none"}, {"name": "nicholas james group", "sentiment": "none"}, {"name": "harbour hotels", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}, {"name": "kay elliott architects", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Will Torquay's harbour hotel plan ever actually happen? It's one of the biggest question marks hanging over the bay at the moment Share Torquay Pavilion proposals (Image: Kay Elliott Architects) Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nOne of the biggest question marks for Torquay has to be the future of Torquay's harbourside and crumbling Pavilion building.\nIt is almost nine years since the Nicholas James Group and its Harbour Hotels brand went public with its vision for the site that stretches from the marina car park, Cary Green and the Pavilion, which has been left a sorry version of its former self since traders moved out in 2012. Torquay Pavilion\nTo give an idea of how long ago it was when all this began, Gordon Brown was still Prime Minister. Wills and Kate were on the cusp of announcing their engagement and Instagram hadn't been invented yet.\nAnd through it all, the hotel group behind the plans to create a luxury hotel, apartments, restaurants, cafes and car parking have stuck with it, through twists, turns, and public opposition to finally secure planning permission in 2017.\nCampaigners against the development say that it will be a blot on the landscape and the historic Cary Green will be lost as part of the development.\nSupporters say that the scheme is part of vital economic regeneration for the town, bringing in more visitors and will save the Pavilion, which is more than 100-years old, which will be restored as part of the scheme.\nSusie Colley, chairman of Torquay Chamber of Commerce, said: \"I would really like that development to come to fruition. It would bring us up to all the other beautiful seaside towns.\n\"It will open up new interest from tourists coming into the Bay.\"\nNow, with one councillor calling for a deadline on the affair , DevonLive asks if it will ever happen at all? Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Has the moment passed for the Harbour Hotel scheme?\nBrexit\nThe world has changed a bit since Harbour Hotels first mooted its plans to create a flagship development in one of Torquay's prettiest spots.\nWhen he first unveiled his plans, Nicholas Roach, managing director of the Nicholas James Group said that Torquay has one of the finest seafronts in Southern England and is ripe for quality development.\nBut if there's been a spanner in the works for big investment, then it has come in the shape of Brexit.\nThe uncertainty of what the future may hold when we exit the EU, which could be by March next year, has seen a lot of businesses taking stock instead of striking out.\nTim Jones, chairman of the South West Business Council, said that continuing Brexit turmoil had 'further suppressed investment ambitions.'\nIt could be as little as three months until Brexit now and Torbay Council elections are due in May 2019 - will this stand in the way? Read More 'Gateway' hotel for Newton Abbot pla...\nIs there too much competition now?\nThe Nicholas James Group want to create a 60-bed, four-star hotel and an 11-storey block of 43 residential apartments with ground floor restaurants and shops .\nThis will be high end accommodation but will there be a market for it?\nSet to open in 2020 is a 130-bedroom Hilton Hotel at the centre of the redevelopment at Torwood Street. The go-ahead for the Torwood Street scheme was announced in July - and will include new offices and food and drink units.\nThe scheme between the Apple and Parrot pub and Roma hair salon is finally going ahead almost ten years after it was first proposed. Turf-cutting ceremony at the hotel and office development site in Torwood Street, Torquay (Image: Ed Oldfield)\nDevelopers the THAT group - led by Peter Tisdale and Ray Kelvin, boss of fashion giant Ted Baker - announced an agreement with bankers and Torbay Council in July.\nThe authority agreed a £9m commercial loan to the scheme through its Investment and Regeneration Fund which, along with bank finance and THAT Group’s funds, meant that the scheme was fully funded and could proceed.\nTorbay Council has said it is also about to agree terms with an operator for the hotel planned at Harbour View, formerly known as the Terrace Car Park .\nTorbay Council intends to borrow the cash as part of the £25million first phase of the Town Centre Regeneration Fund to build the 97-bed hotel. John Kinsey, retail and leisure expert at JLL in Exeter, pictured on a tour in Torquay with DevonLive Business\nWill it mean too many beds for Torquay? No, says John Kinsey, retail and leisure expert at JLL. He said that the £70million being invested in the three schemes will create 'a golden triangle' for attractive accomodation.\nHe said: \"There's nothing but good news for Torquay. The big game changer for Torquay is the hotel developments on the harbourside.\n“For the council to have made the development at Torwood Street possible is a really bold move and a great thing for Torquay because it is facilitating economic development.”\nWas the Judicial Review the final straw?\nThe hotel plans have been in the making for nine years, going through many revisions and changes before reaching the planning stage. Back in 2017, when the scheme finally secured consent, former mayor Nick Bye said that the company must have spent at least £1million just getting the project to planning stage.\nThen, it was dealt another blow a year later when campaigners successfully halted the plans because of a technical flaw in the planning process.\nTorbay Council has said that the planning application is still live and and waiting for the information to be submitted before it can come back to the development management committee for a new decision. Read More\nHowever, four months have now passed. A spokesman for the Harbour Hotels Group said 'it do not have any comment at present'.\nHarbour Hotels have invested money elsewhere in the mean time\nThe Nicholas James Group and Harbour Hotels have a track record of owning and operating prestigious establishments. and was named Hotel Group of the Year at the Hospitality Awards, 2018-19.\nThe group created a Radisson Edwardian hotel together with residential apartments from a council car park in Guildford, Surrey. It created Britain’s first carbon positive restaurant working with chef Gary Rhodes. Harbour Hotels also owns the Kings, Christchurch and Christchurch Harbour Hotel, Hampshire, the Sidmouth Harbour Hotel, Salcombe Harbour Hotel and Spa and Porthminster Harbour Hotel, St Ives, Cornwall.\nAnd its wrangle in Torquay has not stopped it getting on with multi-million investments elsewhere in the UK. Time Line What's happened with Torquay's harbour hotel? February 2010\nThe plans to create the first new hotel in Torquay for decades gets a public airing for the first time.\nIn an apt prediction of what was to come, group chairman Nicholas Roach told a public meeting attended by more than 200 people:\n“But whether you choose to work with us, or someone like ourselves, then the amount needed to resolve the problems are not insignificant.” October 2010\nNicholas James Group say they hope to submit a planning application before Christmas 2010. And if the scheme gets the go-ahead work could start in Autumn 2011.\nPlans at this stage include a quality hotel, boutique shops, branded restaurants, improvements to the Pavilion, and enlarged Princess Theatre, as well as a new underground car park and replacement prom and are a key part of Nick Bye's Mayoral Vision. Oct 2010\nObjectors against the multimillion-pound proposal criticised the council for focusing on the ‘grandiose plans’ instead of fixing minor problems within the town. January 2011\nGordon Oliver is elected the new Tory leader on Torbay Council and gives the plans a thumbs down, saying: “Personally I do not favour any development whatsoever.\" October 2011\nDevelopers come back with a complete project, which includes a 70 to 80-bedroom, four-star hotel and spa with luxury apartments, restaurants and shops.\nThe MDL car park would be replaced with a hidden turf-roofed car park for 300 cars. August 2012\nTraders in Torquay’s Pavilion shopping centre are told they must leave by the end of the year to make way for redevelopment.\nAgain, in an apt prediction, traders fear that the 100 year-old building will be mothballed and left derelict if the project stalls. April 2014\nNicholas Roach says the town is at a ‘crossroads’ and deserves quality investment as it submits its plans for the 60-bed hotel, 45 apartment development including the renovation of the Pavilion to Torbay Council's planning department. February 2017\nThe £32million scheme finally gets planning approval after seven years in the making and is granted more detailed permission in June 2018.\nCouncillors voted in favour of the ‘flagship’ plans and David Jobbins, from the Harbour Hotels group, said: “We are keen to get on with it, to progress it.”\nThe amended application includes a 60-bed, four-star hotel, a five-star and 11-storey block of 43 residential apartments, ground floor restaurants and shops. Campaigners say the tower block would be a ‘blemish’ on the town.\nIt is estimated that the Nicholas James Group, which owns Harbour Hotels has spent £1million in bringing the plans this far. July 2018\nThe Save Cary Green and Torquay Pavilion Campaign successfully halt the development after launching a legal challenge with a judicial review in the High Court to challenge the validity of the planning process.\nTorbay Council concedes that an environmental management plan on conserving marine wildlife should have been carried out before the decision was finalised.\nIn 2017, it opened the £25million luxury Southampton Harbour Hotel & Spa with a rooftop bar, a luxury spa and health club, private cinema, state-of-the-art meetings and events facilities and marina views , bought its first London hotel overlooking Richmond Park and opened its 42-bed Bristol Harbour Hotel.\nOpening in 2019 are two more hotels in Fowey and Padstow, two of Cornwall's most affluent seaside towns. Like us on Facebook", "external_links": [], "published": "2018-12-08T02:00:00.000+02:00", "crawled": "2018-12-08T08:42:23.013+02:00", "highlightTitle": ""}