{"organizations": [], "uuid": "2db86da852f7f963880f38d62aed23f8b6d6c450", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1534200.ece/ALTERNATES/s1200/Cox-2.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/contempt-parliament-vote-could-see-2288533", "country": "GB", "title": "Contempt of Parliament vote could see Devon MP Geoffrey Cox suspended", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-04T09:54:00.000+02:00", "replies_count": 0, "uuid": "2db86da852f7f963880f38d62aed23f8b6d6c450"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/contempt-parliament-vote-could-see-2288533", "ord_in_thread": 0, "title": "Contempt of Parliament vote could see Devon MP Geoffrey Cox suspended", "locations": [], "entities": {"persons": [{"name": "geoffrey cox", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "west devon geoffrey cox", "sentiment": "none"}, {"name": "cox", "sentiment": "none"}], "locations": [{"name": "torridge", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "news contempt of parliament", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "house of commons", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "share neil shaw head of digital", "sentiment": "none"}, {"name": "dec 2018 devon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Contempt of Parliament vote could see Devon MP Geoffrey Cox suspended The Government and its chief legal adviser face a vote of contempt over Brexit today and could see sanctions imposed Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 07:54, 4 DEC 2018\nDevon MP and Attorney General Geoffrey Cox will face a vote in the House of Commons today as MPs debate whether he is in contempt of Parliament for failing to disclose his full legal advice on Brexit to Parliament.\nMr Cox and the whole of Theresa May's Government will face a vote to decide whether they are in contempt of Parliament.\nSanctions for contempt include suspension, fines and possible imprisonment.\nMP for Torridge and West Devon Geoffrey Cox delivered moments of parliamentary theatre on Monday night as he appeared before MPs to outline the legal position on Theresa May 's Brexit deal, and continued to frustrate those wanting to see the full advice given to Cabinet.\nAttorney General Geoffrey Cox should be suspended from the Commons if he is found to have been in contempt of Parliament, Lib Dem Brexit spokesman Tom Brake has said.\nHe spoke ahead of a vote by MPs on a censure motion over the Government's refusal to publish the full legal guidance on the Brexit deal.\nMr Brake told BBC Radio 4's Today that the deal was \"the single biggest decision the country will have taken in 50 years\" and the Government's decision \"impedes the house in the performance of its function\".\nHe said: \"Clearly the Attorney General is the one who came to present the government's case for not releasing this and I suppose he is in line for being in contempt, and I think the house should consider suspending him for that action.\"\nAsked whether any suspension should be immediate, he added: \"I know the government would prefer to refer it to the privileges committee but I think that just kicks it into the long grass.\n\"We are going to have the debate to day and we are going to have to wait and see. But I think unless the Attorney General does a U-turn, I'm afraid that he is very much in the firing line.\"\nLabour said the Government was seeking to avoid the publication for \"fear of the political consequences\", while DUP Westminster leader Nigel Dodds denounced the Irish border backstop plan as \"deeply unattractive\", urged the Government to release the advice and told Mr Cox to recommend that the deal is rejected.\nA Labour motion which sought the full advice on the final Brexit deal was backed by the Commons last month, which has led ministers to be accused of contempt of Parliament.\nDevon's Geoffrey Cox MP tipped to be named Brexit secretary - Live updates and reaction\nAfter Labour's Harriet Harman raised concerns about the Government's approach, Mr Cox said he was \"caught in an acute clash of constitutional principle\" and explained a minister is obliged to consider the public and national interest.\nMr Cox asked MPs to suppose the advice included details on relationships with foreign states and arguments that might be deployed in the future, noting: \"Would it be right for the Attorney General, regardless of the harm to the public interest, to divulge his opinion.\n\"I say to (Ms Harman) it wouldn't.\"\nMr Cox said it would be difficult to ensure information would be redacted, adding: \"I cannot take a step that I firmly and truly believe would be contrary to the public interest\".\nHe went on: \"I ask the House to understand that it is only that consideration that is motivating me and this Government in declining at this stage to break the convention that applies to both sides of the House when they are in government.\n\"There is nothing to see here.\" Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nEarlier, shadow solicitor general Nick Thomas-Symonds said: \"For the sake of our economy, our jobs and our futures, all possible information should be made available to members of this House.\n\"The Government should do the right thing and make this full advice available, with so much at stake for all our constituents, with eight days to go before the vote on the deal, this House and this country deserves better from this Government.\"\nConservative former minister Ken Clarke thanked the Attorney General for addressing \"paranoia and conspiracy theories\" around the Northern Ireland Protocol and providing a \"perfectly sensible\" solution to the border problem.\nMr Cox responded: \"I make no bones about it - I would have preferred to have seen a unilateral right of termination in this backstop.\n\"I would have preferred to have seen a clause to exit if negotiations had irretrievably broken down.\n\"But I'm prepared to lend my support to this agreement because I do not believe that we're likely to be entrapped in it permanently.\"\nBut Mr Dodds, arguing for the full legal advice, said: \"The overall context of this is as he has said; a deeply unattractive, unsatisfactory presentation, and he needs to therefore, rather than recommend this agreement, needs to recommend that it be rejected.\"\nMr Cox, in response to a question from Tory former attorney general Dominic Grieve, later told MPs that even under the Northern Ireland backstop proposal \"checks might have to be carried out\" on a small number of products.\nHe said: \"There would be regulatory divergence as there are within sovereign states throughout the world between one part of the sovereign territory of the United Kingdom and another.\n\"Those divergences could be kept to a minimum and they involve on my investigation some 15 forms of product in respect of which checks might have to be carried out at the border.\n\"Those 15 forms of product are largely phytosanitary goods in respect of which in any event checks in many cases are already carried out at the ports of Northern Ireland.\"\nLabour MP Hilary Benn, who chairs the Commons Brexit Committee, in reference to Mr Cox's earlier comment said there \"is something to see here\".\nTory former Brexit secretary Dominic Raab warned that \"whilst the Article 50 basis for the backstop is meant to be temporary it might well take some 10 years to be struck down by the European court\".\nMr Cox said that estimate was \"far too long\" but added it was \"impossible to say\".\nCharles Geoffrey Cox QC MP is a British politician and barrister. He has been the Conservative Party Member of Parliament for the constituency of Torridge and West Devon since 2005.\nMr Cox also says he \"fully accepts\" MPs may impose a sanction against him or the Government for contempt of Parliament over Brexit legal advice.\nThe Attorney General was asked by Labour former minister Ian Lucas about why he was suggesting he could override a decision made by the House of Commons in not releasing the full advice on the final deal.\nMPs demanded it was disclosed last month.\nMr Cox replied: \"I'm not seeking to propose that I can override the decision of the House of Commons.\n\"The House has at its disposal the means by which to enforce its will.\n\"It can bring a motion of contempt and seek to have that motion passed and seek to impose through the committee, or whichever way it is appropriately done, to impose a sanction. I fully accept that.\n\"I don't set myself up contrary to the House, I simply say that I cannot compromise the public interest.\n\"Does he think I want to be in this position? Does he really think that if there weren't some fundamental bar of principle for me disclosing anything that I might have given the Government that I wouldn't immediately volunteer it to him and all of the honourable members opposite?\n\"I am only doing it to protect us.\"\nMr Cox, in response to Labour's Chris Williamson (Derby North), also earlier said: \"It is a deeply unsatisfactory position for any Attorney General or Government to be in and I am truly sorry that I am not in a position to disclose either the fact or the content of my advice.\"\nHe reiterated he had taken such action as he believed it was in the public interest.\nHis remarks came as senior MPs from six parties wrote to Commons Speaker John Bercow asking him to begin contempt proceedings against the Government.\nMr Bercow later told MPs he would consider the application.\nShadow solicitor-general Nick Thomas-Symonds said the Government had taken an \"unprecedented decision not to comply with the unanimous and binding decision of this House\".\nMr Bercow responded: \"I have only just seen the letter to which he refers, I shall give it immediate attention when I leave the chair and having sat through these exchanges I intend to come to a rapid decision which I will convey to the House before it rises tonight or if that proves impossible at the earliest opportunity tomorrow.\" Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-04T09:54:00.000+02:00", "crawled": "2018-12-04T10:11:40.021+02:00", "highlightTitle": ""}