{"organizations": [], "uuid": "8ca9935fd8c91879e3aa81f1d84fd8906ba71a79", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15540228.ece/ALTERNATES/s1200/0_JS170820324.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/uk-news/theresa-may-statement-announcement-speech-15540184", "country": "GB", "domain_rank": 21960, "title": "Theresa May statement IN FULL: Prime Minister vows to survive vote of no confidence in leadership", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-12T12:13:00.000+02:00", "replies_count": 0, "uuid": "8ca9935fd8c91879e3aa81f1d84fd8906ba71a79"}, "author": "nechronicle", "url": "https://www.chroniclelive.co.uk/news/uk-news/theresa-may-statement-announcement-speech-15540184", "ord_in_thread": 0, "title": "Theresa May statement IN FULL: Prime Minister vows to survive vote of no confidence in leadership", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "angela) merkel", "sentiment": "none"}, {"name": "jean-claude) juncker", "sentiment": "none"}, {"name": "mark) rutte", "sentiment": "none"}, {"name": "donald", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "dublin", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "european commission", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How the North East voted - in full\n\"And at this crucial moment in our history, that means securing a Brexit deal that delivers on the result of the EU referendum, taking back control of our borders, laws and money, but protecting jobs, our security and our precious union as we do so.\n\"Through good times and bad over the last two years, my passionate belief that such a deal is attainable, that a bright future lies ahead for our country, has not wavered and it is now within our grasp. Read More Brexiteer MP sets out how Theresa May CAN win support for a Brexit deal\n\"I spent yesterday meeting (German) Chancellor (Angela) Merkel, (Dutch) Prime Minister (Mark) Rutte, (European) President (Donald) Tusk and (European Commission) President (Jean-Claude) Juncker to address the concerns that MPs have with the backstop, and we are making progress.\n\"I was due to travel to Dublin this afternoon to continue that work, but will now remain here in London to make the case for my leadership with my parliamentary colleagues.\n\"A change of leadership in the Conservative Party now will put our country's future at risk and create uncertainty when we can least afford it. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\n\"A new leader wouldn't be in place by the 21st of January legal deadline, so a leadership election risks handing control of the Brexit negotiations to Opposition MPs in Parliament.\n\"The new leader wouldn't have time to renegotiate a Withdrawal Agreement and get the legislation through Parliament by the 29th of March, so one of their first acts would have to be extending or rescinding Article 50, delaying or even stopping Brexit, when people want us to get on with it.\n\"And a leadership election would not change the fundamentals of the negotiation or the parliamentary arithmetic.\n\"Weeks spent tearing ourselves apart will only create more division, just as we should be standing together to serve our country. None of that would be in the national interest. Read More Next Prime Minister odds: Who could replace Theresa May after Brexit chaos\n\"The only people whose interests would be served are Jeremy Corbyn and John McDonnell.\n\"The British people want us to get on with it and they want us to focus on the other vital issues that matter to them too - building a stronger economy, delivering first class public services and the homes that families need. These are the public's priorities, and they must be the Conservative Party's priorities too.\n\"We must and we shall deliver on the referendum vote and seize the opportunities that lie ahead, but the Conservatives must not be a single issue party. We are a party of the whole nation - moderate, pragmatic, mainstream; committed to reuniting our country and building a country that works for everyone; the agenda I set out in my first speech outside this front door; delivering the Brexit people voted for; building a country that works for everyone.\n\"I have devoted myself unsparingly to these tasks ever since I became Prime Minister and I stand ready to finish the job.\" Like us on Facebook", "external_links": [], "published": "2018-12-12T12:13:00.000+02:00", "crawled": "2018-12-12T13:39:42.042+02:00", "highlightTitle": ""}