{"organizations": [], "uuid": "153a7f9b6fd46f85924545e3269d0db64af3f7e6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15517789.ece/ALTERNATES/s1200/1_SGP_NEC_061218MILE05seqnJPG.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/im-fed-up-brexit-negativity-15517058", "country": "GB", "domain_rank": 21960, "title": "'I'm fed up with the Brexit negativity and the European religion!' Wetherspoons boss speaks in Newcastle pub", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-06T21:56:00.000+02:00", "replies_count": 0, "uuid": "153a7f9b6fd46f85924545e3269d0db64af3f7e6"}, "author": "Jack Elsom", "url": "https://www.chroniclelive.co.uk/news/north-east-news/im-fed-up-brexit-negativity-15517058", "ord_in_thread": 0, "title": "'I'm fed up with the Brexit negativity and the European religion!' Wetherspoons boss speaks in Newcastle pub", "locations": [], "entities": {"persons": [{"name": "tim martin", "sentiment": "none"}, {"name": "wetherspoons", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "tim", "sentiment": "none"}], "locations": [{"name": "newca", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "mile castle", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'I'm fed up with the Brexit negativity and the European religion!' Wetherspoons boss speaks in Newcastle pub He said that pub goers are often Brexiteers and dinner party goers are often pro remain. Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nThe boss of Wetherspoons has said that he is fed up with Brexit negativity being peddled by the 'Oxbridge-educated MPs' in a speech in Newcastle this afternoon.\nPub tycoon and prominent Eurosceptic Tim Martin told a group of punters at the Mile Castle branch in the city centre that Theresa May has \"had it\" and urged them not to be scared of a no-deal Brexit.\nThe visit is part of a nationwide tour of Wetherspoons to talk to customers about their political concerns and argue that leaving the EU is essential to restoring real democracy.\nSpeaking to ChronicleLive, Tim said: \"I'm saying to the customers that they shouldn't be frightened of no deal. (Image: Newcastle Chronicle)\n\"There's been a lot of smokescreen and camouflage which has given the impression from people who voted remain that we're going to encounter a cliff edge and Armageddon if we leave without a deal.\n\"That's not true. If we leave without a deal we save £39bn, we regain control of fishing and we eliminate tariffs on things like avocados, bananas and oranges that we don't grow in this country.\n\"And above all we can gain democracy which is good for the economy but it's good for the country generally, it's good for freedom.\"\nTim hit out at what he referred to in his speech as the \"metropolitan elite\" who dominate big business and politics.\nHe said: \"There's a sort of quasi-religious belief in Europeanism that extends from the FT, the CBI and Oxford and Cambridge universities that Europeanism is good and they believe in the transfer of power to people like themselves.\"\nHe also said that Channel 4 presenter Cathy Newman, who recently interviewed him, \"comes from the echo chamber of remain\".\nThe pub-chain chief also criticised Theresa May for trying to sell a \"lousy deal\" which nobody supports and claimed that she's \"had it\" as Prime Minister.\nDuring the address two members of the crowd got into a fiery debate with each other over immigration, a topic which Tim answered questions on. (Image: Newcastle Chronicle)\nHe said: \"A lot of remainers say that the decision to leave was based on a dislike of immigration and immigrants.\n\"I've not come across that at all. I think people realise that we need control over immigration and that's very much the message that I got here in Newcastle today.\"\nTim also said that leaving the EU would allow the UK to negotiate free trade arrangements with the wider world and import cheaper goods not subject to \"protectionist tariffs\" - promising that leaving would mean the price of Merlot will drop.\nHe said that he loves coming to speak to customers in his branches, saying \"by and large pub goers in the country are pro leave and dinner party goers are pro remain\". (Image: Newcastle Chronicle)\nPensioner Max Hill, who had travelled from Morpeth to attend the speech said that he was of the \"same views as Tim\".\nSpeaking to ChronicleLive after the event, he said: \"I certainly hope we don't have a second referendum.\n\"Lots of politicians call it a 'meaningful vote' but that's because the first one wasn't good enough for them.\"\nThe 63-year-old Wetherspoons chairman and owner founded the pub chain in 1979. It now boasts over 900 branches.\nIn Newcastle, he also addressed recent data from the Office for National Statistics showing that lots of North East family pubs are closing because of competition from big chain rivals.\nTim said: \"I've not quite interpreted things like that and it's true that a lot of smaller pubs have closed down but this tends to be in areas where there's not a Wetherspoons such as in small villages and country pubs.\n\"So I think that Wetherspoons provide something and we hope that we don't cause other pubs to close because we want the overall night time economy to boom.\"\n\"We do better when there are lots of restaurants and pubs nearby, as we do in the centre of Newcastle for example.\"\nEarlier in the day Tim had spoken to crowds in Middlesbrough and Sunderland. Read More", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-06T21:56:00.000+02:00", "crawled": "2018-12-07T00:07:22.007+02:00", "highlightTitle": ""}