{"organizations": [], "uuid": "e1bd211e52a98f53ac2881040e3df31a361a5470", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1464638.ece/ALTERNATES/s1200/18173740-1.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/theresa-face-leadership-challenge-vote-2318301", "country": "GB", "title": "Theresa May to face leadership challenge vote", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-12T09:55:00.000+02:00", "replies_count": 0, "uuid": "e1bd211e52a98f53ac2881040e3df31a361a5470"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/theresa-face-leadership-challenge-vote-2318301", "ord_in_thread": 0, "title": "Theresa May to face leadership challenge vote", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "neil shaw", "sentiment": "none"}, {"name": "john whittingdale", "sentiment": "none"}, {"name": "graham brady", "sentiment": "none"}], "locations": [], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "bbc radio", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May to face leadership challenge vote At least 48 MPs have called for the PM to face a leadership challenge Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 07:55, 12 DEC 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nEnough Tory MPs have requested a vote of confidence in Theresa May to trigger a contest, chairman of the backbench 1922 Committee Sir Graham Brady has announced.\nTheresa May will make a statement later this morning outside 10 Downing Street, a Number 10 source said.\nTory former Cabinet minister John Whittingdale has submitted a no confidence letter.\nHe said he hoped a vote of confidence would be arranged \"as quickly as possible\", adding that he believed there was a need for a \"fresh start in the Brexit negotiations and I think that can only be achieved under a new leader\". Read More What would a No-Deal Brexit mean for Devon?\nHe told BBC Radio 4's Today programme he had \"not found it at all easy\" writing his letter, but said: \"I just I'm afraid think she's no longer the right person to lead us through this difficult period.\" Press release issued by the 1922 Committee of a letter confirming that enough Conservative MPs have requested a vote of confidence in Theresa May to trigger a leadership contest.\nHe speculated there could be a new PM by mid-January, in the event of a leadership challenge.\nSir Graham said a ballot would be held between 6pm and 8pm on Wednesday in the Commons.\nHe added in a statement: \"The votes will be counted immediately afterwards and the result will be announced as soon as possible in the evening.\"\nMoments after news of the vote was announced, Foreign Secretary Jeremy Hunt tweeted: \"I am backing @theresa_may tonight. Being PM most difficult job imaginable right now and the last thing the country needs is a damaging and long leadership contest. Read More Baba Vanga's 2019 prophesies revealed\n\"Brexit was never going to be easy but she is the best person to make sure we actually leave the EU on March 29,\" he added.\nIn a joint statement the chairman of the European Research Group Jacob Rees-Mogg and his deputy Steve Baker said: \"Theresa May's plan would bring down the Government if carried forward. But our party will rightly not tolerate it.\n\"Conservatives must now answer whether they wish to draw ever closer to an election under Mrs May's leadership. In the national interest, she must go.\" Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nHome Secretary Sajid Javid said: \"The last thing our country needs right now is a Conservative Party leadership election. Will be seen as self-indulgent and wrong. PM has my full support and is best person to ensure we leave EU on 29 March.\"\nSir Graham Brady said: \"The threshold of 15% of the parliamentary party seeking a vote of confidence in the leader of the Conservative Party has been exceeded.\n\"In accordance with the rules, a ballot will be held between 1800 and 2000 on Wednesday 12th December in committee room 14 of the House of Commons. The votes will be counted immediately afterwards and an announcement will be made as soon as possible in the evening. Arrangements for the announcement will be released later today.\" Read More\nTory former minister Ed Vaizey said he would support the Prime Minister in the vote, but Sir Bernard Jenkin told Today he would vote for a change in leadership.\nSir Bernard said he had submitted a letter of no confidence earlier this week with \"great regret\". What is the 1922 Committee?\nAlso known as \"the '22'', the committee of all backbench Conservative MPs meets weekly when the House of Commons is sitting. When the party is in opposition, frontbenchers are allowed to attend, although the leader cannot.\nWhen the party is in government and the leader attends, members are said to bang their desks in approval when the chief arrives.\nWhere does the name come from?\nThe committee takes its name from a meeting of Conservative MPs on October 19 1922. The MPs successfully ended the party's coalition with the Liberals, bringing down the government of David Lloyd George. The resulting general election was won by the Tories.\nWho is in charge?\nThe '22 has an 18-member executive committee with a chairman, usually a senior MP, elected by committee members. The incumbent chairman is Sir Graham Brady, MP for Altrincham and Sale West, who was appointed in May 2010.\nWhat does it do?\nThe committee keeps the party informed of the backbenchers' mood and opinion on party business. The chairman has considerable influence within the Parliamentary Conservative Party and oversees the election of a new leader.\nA leader who loses the confidence of the '22 is likely to find themselves in a precarious position as Cabinet ministers take the committee's views seriously.\nWhat has it done?\nIn October 2003 Iain Duncan Smith was dumped as leader after he lost a confidence vote by 75 votes to 90.\nWhat is all the talk about 48 letters?\nOne way in which a group of rebels could mount a leadership challenge to Mrs May is by calling a vote of no confidence, which requires 15% of the parliamentary party to back the idea. This means 48 letters had to be sent to Sir Graham supporting the idea and then a simple majority (158) supporting the motion of no confidence. How a Conservative leadership contest could unfold\nA vote will be held among Tory MPs. Mrs May would need the support of more than 50% of the 315 Conservative MPs to stay in office. But even if she wins, if the margin of victory is small her authority may have been fatally wounded.\nWhat if she loses?\nIf the PM lost the vote, she would not be able to stand in the subsequent leadership contest arranged by Sir Graham.\nHow would that work?\nCandidates for the leadership must be nominated by two Conservative MPs. If only one candidate comes forward, he or she becomes leader.\nIf a number of would-be leaders are nominated, the list is whittled down to a shortlist of two in a series of votes by MPs.\nThe final pair then go to a postal ballot of all party members, with the\nposition of leader going to the victor.\nHow long would that take?\nSir Graham would be responsible for overseeing the contest and setting a timetable for the campaign, which would be expected to last around 12 weeks - although those calling for Mrs May to go believe it could be accomplished much quicker.\nMrs May could remain in the post during the campaign period. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-12T09:55:00.000+02:00", "crawled": "2018-12-12T10:14:21.010+02:00", "highlightTitle": ""}