{"organizations": [], "uuid": "082f36f1c9b7cf22a30f72c926afe6a8e53e4b9b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2290236.ece/ALTERNATES/s1200/0_Facebook-template-3-boxes.png", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/leicester-news/how-leicester-leicestershire-mps-intend-2289796", "country": "GB", "domain_rank": 48128, "title": "How Leicester and Leicestershire MPs intend to vote on Theresa May's Brexit deal - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "082f36f1c9b7cf22a30f72c926afe6a8e53e4b9b"}, "author": "Dan Martin", "url": "https://www.leicestermercury.co.uk/news/leicester-news/how-leicester-leicestershire-mps-intend-2289796", "ord_in_thread": 0, "title": "How Leicester and Leicestershire MPs intend to vote on Theresa May's Brexit deal - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "leicestershire live how leicester", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "How Leicester and Leicestershire MPs intend to vote on Theresa May's Brexit deal The crucial vote is less than a week away Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nNext week MPs will take part in possibly the most important parliamentary vote in a generation.\nThey will be asked to decide whether to back the deal Prime Minister Theresa May has negotiated for the UK to leave the European Union.\nThe government has embarked on a frenzied campaign to get political and public backing for Mrs May’s Withdrawal Agreement but it is by no means certain that enough MPs will back the plan to get it through.\nBoth Brexiteers and Remainers in the House of Commons have deep reservations about the PM’s agreement – which has already been backed by Brussels. Read More Your council tax could be going up if you live in these villages\nAhead of the December 11 vote, five days of Parliamentary debate will take place to look at key issues like the backstop - which could keep the UK tied to EU customs rules in the event no future trade deal can be agreed - and the £39 billion divorce bill as the Government seeks to bring sceptical MPs round. poll loading What do you think of May's Brexit deal? 0+ VOTES SO FAR It's the only sensible way to leave the EU #BRINO Put it to a People's Vote Let's just stay in the EU\nAmong our 10 MPs in Leicester and Leicestershire are a senior Foreign Office minister who backs Mrs May, and an arch-Brexiteer who has made no secret of his scorn for her deal.\nSome have already been writing to their constituents to set out where they stand.\nLeicestershire Live has contacted them all trying to put them on the record about how they intend to vote next week.\nWe're still waiting to hear back from Jon Ashworth and Ed Argar but here’s what those who have so far responded have said. Melton and Rutland MP Alan Duncan (Con) – Supports the deal Sir Alan Duncan (Image: WILL JOHNSTON)\n“This deal is the only deal that exists.\n“Most of those who wish to vote it down either secretly want no deal at all, which would be a very costly mistake, or have no realistic alternative.\n\"I will vote for it and give my full support to the Prime Minister who is doing her utmost to act in the long term interests of the UK.” South Leicestershire MP Alberto Costa (Con) - Supports the deal South Leicestershire MP Alberto Costa\n“We have five days of debate on this and I’ll listen very carefully to what is said.\n“One of the key issues for me is what this means for the rights of 3.6 million EU citizens in the UK and one million UK citizens in the EU.\n“This deal gives absolute certainty to them.\n“It also confirms the Good Friday Agreement will be honoured.\n\"There the Backstop but that is an insurance policy for an insurance policy. Politically it is in neither side’s interest to be in it.\n“And when we started the negotiations last year the figure of £100 billion was what the EU wanted for a divorce bill. That has been negotiated down to £39 billion.\n“This deal is not perfect but it is a compromise.\n“People in my constituency voted by some way for Leave and that is what will happen under this deal.” Read More ", "external_links": [], "published": "2018-12-05T02:00:00.000+02:00", "crawled": "2018-12-05T08:14:52.009+02:00", "highlightTitle": ""}