{"organizations": [], "uuid": "c0cda26f22405d99a27098081e601d69045088bb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2334694.ece/ALTERNATES/s1200/0_0.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/deaf-school-students-call-bbc-2334688", "country": "GB", "title": "Deaf School students call for BBC and ITV to have sign language interpretation on local news bulletins", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-17T11:48:00.000+02:00", "replies_count": 0, "uuid": "c0cda26f22405d99a27098081e601d69045088bb"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/deaf-school-students-call-bbc-2334688", "ord_in_thread": 0, "title": "Deaf School students call for BBC and ITV to have sign language interpretation on local news bulletins", "locations": [], "entities": {"persons": [{"name": "daniel clark", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "county hall maryam kamran", "sentiment": "none"}], "organizations": [{"name": "deaf school", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "exeter deaf academy", "sentiment": "none"}, {"name": "school council", "sentiment": "none"}, {"name": "student council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Deaf School students call for BBC and ITV to have sign language interpretation on local news bulletins And they challenged councillors to try and watch the news with the subtitles on Share Daniel Clark Local Democracy Reporter 09:48, 17 DEC 2018 Click to play Tap to play The video will start in 8 Cancel Play now\nCouncillors were challenged to watch the news on TV without sound to understand what it is like to be deaf.\nCurrently in the UK, live regional TV news programmes do not have live British Sign Language interpretation, and subtitles and closed captioning don’t offer much help for British Sign Language users when English is not their first language.\nSubtitles are not in real time, meaning that deaf audiences can find it challenging to follow news stories in the same way as hearing audiences. Read More\nLast Thursday, the School Council from Exeter Deaf Academy delivered a presentation in sign language to councillors, articulating the need for regional TV news programmes to be accessible for all. Students from the Exeter Deaf Academy outside County Hall\nMaryam Kamran, 16, vice-chairman of the Student Council, said: “The subtitles we see on live news are often not of a very high standard. Words are misspelled, information missed off and they’re quite often delayed.”\nCo-Secretary Nissi Phinehas, 15, added, “Lots of deaf people struggle to understand subtitles because they are too quick… There’s also the additional problem we have in that we’re not reading them in our first language.” Read More Flood alert for Devon rivers with more rain on the way\nStudent Council Co-Secretary Tom Bowden said that they have been writing to the Government, but as they were ‘busy sorting out Brexit’, they chose to campaign locally instead.\nSchool Governor and Devon County Councillor, Alistair Dewhirst, brought forward a motion to the council calling for the council to ask the BBC and ITV to start a process of full inclusion and to ask for Spotlight South West and for West Country News to be signed in BSL.\nCllr Dewhirst added: “I am proud to support these fine young people and their desire to be kept in the loop by our local news broadcasters. Cllr Alistair Dewhirst\n“I am incredibly aware that when these youngsters came into the council chamber and before the interpreter was signing for them, they had no idea what was going on.\n“I am asking for the council to support these young people in asking BBC and ITV to have interpretation for the news so they know what is going on in the world.” Read More Chudleigh cat owner's fury after pet returns home with air gun pellet in his nose\nAnd Alex Loveridge, 16, Student Council Chairman, challenged the councillors to watch the local TV news with the sound turned off to understand how difficult it can be to follow the detail in the stories using subtitles.\nAs is normal council procedure, the motion will be referred to the council’s cabinet for consideration, before returning to full council for a decision in 2019. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-17T11:48:00.000+02:00", "crawled": "2018-12-17T11:54:28.052+02:00", "highlightTitle": ""}