{"organizations": [], "uuid": "f86f59bf33a8a9eac7b01a4a82916dfa38b6ea09", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14212747.ece/ALTERNATES/s1200/MAIN-THP_CHP_260118SITV_2053JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/tv/piers-morgan-quit-good-morning-15540112", "country": "GB", "domain_rank": 21960, "title": "Piers Morgan to 'quit' Good Morning Britain for job with Donald Trump", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-12T12:05:00.000+02:00", "replies_count": 0, "uuid": "f86f59bf33a8a9eac7b01a4a82916dfa38b6ea09"}, "author": "nechronicle", "url": "https://www.chroniclelive.co.uk/news/tv/piers-morgan-quit-good-morning-15540112", "ord_in_thread": 0, "title": "Piers Morgan to 'quit' Good Morning Britain for job with Donald Trump", "locations": [], "entities": {"persons": [{"name": "morgan", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "susanna reid", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}], "organizations": [{"name": "news piers morgan", "sentiment": "negative"}, {"name": "invalid email piers morgan", "sentiment": "none"}, {"name": "the white house", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Piers Morgan to 'quit' Good Morning Britain for job with Donald Trump The presenter has put in an application to be the President's Chief of Staff behind his 'insulted' co-hosts' backs Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nPiers Morgan has shown interest in a job working for Donald Trump - and The White House has confirmed it.\nThe Good Morning Britain presenter has put in an application to be the President's Chief of Staff behind his co-hosts' back.\nPiers said: \"Donald Trump needs a new Chief of Staff so I made a formal application. I feel I’m perfect for it. He hired me once when I won Celebrity Apprentice. We know each other. We’ve worked together a long time.\"\nThe White House also released a statement saying: \"The White House is aware of Mr Morgan's interest in the job.\"\nSusanna Reid confessed she was \"insulted\" and claimed he was pretending to be ill so he could head off for an interview in Washington D.C. next week, Mirror Online report . Piers Morgan slams Cheryl and Liam Payne's split in epic rant on Good Morning Britain\nPiers famously won The Celebrity Apprentice USA and is hopeful of hearing Trump say the words \"you're hired\" for a second time.\nViewers then got to see clips of Piers with the US President, including their interview in Davos in January and on Air Force 1.\nPiers set out a list of reasons as to why he would be the best candidate for the role.\nReading the first one, Susanna said: \"You need someone who will look you in the eye and tell you you’re being an idiot.\" Read More\nExplaining how he would tell Trump, Piers said: \"Mr President. Your policy, for example, to remove children from parents at the border is idiotic and if you continue to do it you’re an idiot. Don't do it.\nCharlotte Hawkins joked: \"He'd probably say you're fired.\"\nThe second point read: \"You shouldn't send a single tweet without discussing it first with me.\"\nPiers explained: \"He needs a temperate, calm pair of eyes. I’m the perfect person. Like him I have a massive following. Like him I can be inpestuous. I can tell him that tweet is a bad idea. It's not going to work. If you’re whacking Madonna fine, but don't do this.\" Donald Trump on Good Morning Britain with Piers Morgan (Image: ITV)\nThe final point was that Piers reckoned he would save the country money because he doesn't need to be paid.\nShocked Susanna said: \"Why don't you need the salary? How much are we paying you? What's going on?\"\nHer co-host replied: \"Do two years and write a book for £40million. I've thought it all through. My White House diaries.\"\nSome Good Morning Britain viewers took to Twitter to call for Piers to leave the show.\nOne viewer said: \"Yes, get him out of the UK!\"\nAnother added: \"@CharlotteHawkns and @susannareid100 should be supportive of this they would finally be rid of him. Bring back @benshephard\"\nHowever, others wanted him to stay to sort out Brexit, while some thought he would make a good Chief of Staff.\nA fan said: \"Don't let him go over the pond! Put him in charge of sorting out this #brexit shambles.\"\nAnother added: \"As an American, I have to say that @piersmorgan would make an excellent chief of staff for @POTUS. He’s not beholden to the DC swamp and I believe @susannareid100 would get over it quickly.\" Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}", "https://www.mirror.co.uk/tv/tv-news/piers-morgan-set-quit-gmb-13722577"], "published": "2018-12-12T12:05:00.000+02:00", "crawled": "2018-12-12T12:24:58.002+02:00", "highlightTitle": ""}