{"organizations": [], "uuid": "ca72fd5999fdd321a5f3cbf67920a4e290489340", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2292022.ece/ALTERNATES/s1200/2_schoolcanva.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/people-really-angry-mental-health-2292093", "country": "US", "title": "People are really angry that a mental health hospital will be built next to school - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "ca72fd5999fdd321a5f3cbf67920a4e290489340"}, "author": "Anita Merritt", "url": "https://www.devonlive.com/news/devon-news/people-really-angry-mental-health-2292093", "ord_in_thread": 0, "title": "People are really angry that a mental health hospital will be built next to school - Devon Live", "locations": [], "entities": {"persons": [], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "ribston avenue", "sentiment": "none"}], "organizations": [{"name": "exeter city council", "sentiment": "none"}, {"name": "st nicholas catholic primary s", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News People are really angry that a mental health hospital will be built next to school \"We’ve just got to put up with it and get on with it, but would the councillors want it on their doorstep?” Share A mental health hospital will be built next to St Nicholas Catholic Primary School\nAnger and disappointment has been voiced by local residents over a decision to allow a mental health hospital to be built next to a primary school and housing in Exeter.\nHowever, the plans have also been praised by those living in the city and beyond with people saying it will improve mental health services locally. Artist impression of new mental health hospital for Ribston Avenue in Exeter\nLast night, December 3, members of Exeter City Council’s planning committee voted in favour of building a 54-bed secure independent hospital on land at Ribston Avenue.\nThe application received a total of 235 objections, including from the headteacher of St Nicholas Catholic Primary School who stated to allow the provision within such close proximity of the school would be “unacceptable”. Only one letter in favour of the proposal was received. Read More Exeter mental health hospital will be built next to primary school and housing\nToday, school bosses have announced they will continue to fight the plans.\nA spokesperson for Plymouth CAST, a multi-academy trust of 36 Catholic schools across the south west of which St Nicholas in Exeter is part of, said: “Plymouth CAST is disappointed by last night’s decision by Exeter City Council’s planning committee to grant approval for the building of a 54-bed secure independent hospital on land adjacent to St. Nicholas Primary School, one of the schools in its multi-academy trust.\n“We submitted an objection to the proposal, as did hundreds of local residents. We remain of the view that the decision to allow the building of this facility in such close proximity to St Nicholas Primary School will mean additional safeguarding risks to our children and the community. Land next to St Nicholas Primary School\n“We are committed to the safety and well-being of our children and staff and are not convinced by any of the arguments that the proposed facility does not increase the risk to them.\n\"While we acknowledge the need for such facilities, we simply do not understand the logic of placing the facility next door to a primary school.\n“We will continue to object to the proposal through the planning process.”\nSt Loyes ward Cllr Peter Holland, who was given permission to address the committee to make submissions ahead of the decision, said: \"I am bitterly disappointed with the decision and the way it went through. I'm flabbergasted it could happen. Read More The internet made these crimes possible\n\"All my evidence was a material consideration. Threats and fear are a material consideration, and the safeguarding issues are awesome.\n\"Not only do I live in the community, I am a retired primary school teacher so I know the impact it will have.\n\"The feedback I have had today is residents are angry and shocked the council have allowed this to happen. I am lost for words and I expect the residents will look at other avenues to see if it can be legally challenged.\" Cllr Peter Holland\nAlso looking at what they can do next is Hill Barton Community Association.\nChairman Danny Raleigh, who was given three minutes to address the committee ahead of making the decision, said: “We are very disappointed with the decision and will be reviewing our options.\n“What’s really important as a community group is people know there’s no prejudice here. It’s to do with it being in the wrong location. We feel the decision was pre-determined.” Read More Mental health crisis worker guilty of sexually grooming vulnerable teen\nThe same feeling was felt by Marjorie Hulin, 69, whose house in Ribston Avenue also backs onto the site, said: “I think it was cut and dry before it happened. We will be looking right out onto the hospital. Goodness knows what it will look like, but it will cause a lot of problems with traffic.\n“It has made me feel really angry. At the end of the day what can we do? We’ve just got to put up with it and get on with it, but would the councillors want it on their doorstep?”\nThe 54-bed independent hospital will be run by Cygnet Health Care and have three services:\n• 17 beds for men with acute mental health needs\n• 21 beds for men who require a period of longer term mental health rehabilitation\n• 16 beds for women who require a low secure environment for treatment of an emotionally unstable personality disorder Read More Government to release Brexit deal legal advice after being found to be in contempt of Parliament\nAnne Holdsworth, 68, of Ribston Avenue, will face the car park of the hospital.\nShe said: “I think they had already made their minds up before the meeting. We don’t want it near a school, and we already have quite a bit of traffic come down here as people use it for a short cut.\n“I’ve been told the car park will be in front of us with a screen of trees.”\nAlso facing the same part of the development is 84-year-old Aubrey Hill.\nHe said: “We obviously didn’t want it. I know it has to go somewhere but why in a housing estate and so close to a school?\n“I’m very sad about it. I have lived here for 40 years and we have had that green field all the time, and I remember when it was a school field.” Ben Bradshaw MP\nExeter MP Ben Bradshaw said he welcomes additional mental health services in the area, but would rather they be run by the NHS than the private sector.\nHe said: “Individual planning decisions are a matter for the local authority. But, as most people know, Exeter and Devon suffer from a desperate shortage of beds for people with mental health problems. This has led to vulnerable people, including children, being sent to the other end of the country because of the lack of provision locally.\n“One in four of us will suffer from some sort of mental illness during our life-time. Patients who need a secure bed pose much less threat to others and themselves if they are in safe and secure accommodation, receiving the treatment they need, than if they are out in the community. Read More Noel Gallagher's High Flying Birds are headlining amazing Powderham Castle mini festival\n“My preference would be for the NHS to provide these services and Devon Partnership Trust has recently built a new unit in Exeter. But Government cuts have made it impossible for the NHS to make the capital investment needed to meet demand. It will be up to the local NHS to decide whether or not to commission care from this provider and to ensure that care is of good quality.”\nDifferent views have been expressed on the Devon Live Facebook page about whether it is the right location for a mental health hospital or not. Read More\nChris Cole said: “There are plenty of perfectly adequate sites all around the Exeter area for a unit like this.\n\"Cygnet are a shocking company and already are being looked into for their failings.\n\"They recently accidentally let out a scum monster who went on to rape an elderly 74-year-old lady. That was in Paignton. St Nicholas Catholic Primary School in Ringswell Avenue\n“Of course our children are not in danger from this unit, but one rare occasion is one rare occasion too much. This unit is 100 per cent required, but it is not required on the doorstep of a primary school where traffic is already horrendous.\n“Building this could potentially ruin the school. The whole planning meeting was an absolute joke.”\nA recent mental health inpatient told how she almost sent to Harrogate as it was the only bed available in the country. Read More\nThe East Devon resident said: “Fortunately at the 11th hour a bed opened up in North Devon, but it really highlighted the lack of beds and how stretched the services are.”\nLois Pinn added: “Any improvements to mental health care would be amazing.”\nRegarding its controversial location, Beccy Price said: “I'm pretty sure Wonford House is near a housing estate and two schools. I haven't heard anybody complain about that so why is this any different?” Read More Storm Etienne to bring heavy rain and gale force winds to Devon and Cornwall\nA spokesperson for Cygnet Health Care said: “We welcome and respect the decision of the planning committee to grant consent for the proposed mental health facility in Exeter. We look forward to working in partnership with the NHS to provide services for local patients from Devon and the south west, a region where greater supply is needed to meet the demand for inpatient mental health services, as well as contribute to the local economy by producing employment in the construction and staffing of the hospital.\n\"Patient care remains our top priority, and we are committed to continuously improving our procedures, protocols and training, which we recognise are all critical to providing the highest standards of healthcare.” Like us on Facebook", "external_links": [], "published": "2018-12-05T02:00:00.000+02:00", "crawled": "2018-12-05T08:10:35.006+02:00", "highlightTitle": ""}