{"organizations": [], "uuid": "5836c9001e57d20529e6b02db4d6c464d0d77607", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2302194.ece/ALTERNATES/s1200/0_1-43.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/watch-councillors-walk-out-council-2302289", "country": "GB", "title": "Watch councillors walk out of council chamber when Brian Greenslade speaks as they are 'offended by his presence'", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-07T13:07:00.000+02:00", "replies_count": 0, "uuid": "5836c9001e57d20529e6b02db4d6c464d0d77607"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/watch-councillors-walk-out-council-2302289", "ord_in_thread": 0, "title": "Watch councillors walk out of council chamber when Brian Greenslade speaks as they are 'offended by his presence'", "locations": [], "entities": {"persons": [{"name": "brian greenslade", "sentiment": "none"}, {"name": "cllr greenslade", "sentiment": "none"}, {"name": "hilary ackland", "sentiment": "none"}, {"name": "marina asvachin", "sentiment": "none"}, {"name": "yvonne atkinson", "sentiment": "none"}, {"name": "cllr brian greenslade", "sentiment": "none"}, {"name": "carol whitton", "sentiment": "none"}, {"name": "rob hannaford", "sentiment": "none"}, {"name": "daniel clark", "sentiment": "none"}, {"name": "emma brennan", "sentiment": "none"}], "locations": [], "organizations": [{"name": "dec", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}, {"name": "su aves", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Watch councillors walk out of council chamber when Brian Greenslade speaks as they are 'offended by his presence' Cllr Greenslade had in July been found guilty of sexual harassment and abuse of four female employees over 'many years' by a standards investigation by the county council Share Daniel Clark Local Democracy Reporter 11:07, 7 DEC 2018 Click to play Tap to play The video will start in 8 Cancel Play now\nA protest by Labour councillors on Devon County Council saw them walk out of the chamber every time Cllr Brian Greenslade spoke.\nThe seven councillors – Hilary Ackland, Marina Asvachin, Yvonne Atkinson, Su Aves, Emma Brennan, Rob Hannaford and Carol Whitton – left the chamber when Cllr Greenslade spoke during Thursday's full council meeting.\nCllr Greenslade had in July been found guilty of sexual harassment and abuse of four female employees over 'many years' by a standards investigation by the county council.\nA notice of censure was served against Cllr Greenslade, which means his access to County Hall will now be restricted to the Member’s Room, Ante Chamber and Council Chamber and he must undertake ‘relevant training’.\nIt has also been confirmed in a statement by North Devon Council, where Cllr Greenslade is also a councillor, that they have had two complaints about his conduct that have been passed to the police for investigation. A police spokesman said that were unable to comment. How news of Cllr Brian Greenslade's sexual harassment allegations broke: Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nCllr Brennan, who at the July full council meeting in a ‘Me Too’ moment spoke out against his presence, told the Local Democracy Reporting Service after the moment that she is offended that he is allowed into the chamber and she does not want to acknowledge his presence.\nShe said: “There have been a number of allegations from female council officers and I feel offended that he is allowed to continue and sit in the council chamber and I don’t want to be in the room when he is speaking.\n“Back in July I spoke out against him being in the council chamber and we decided to walk out or turn our backs to him as we don’t want to acknowledge him and we don’t think his presence is welcome.”\nShe said that she didn’t speak on behalf of the whole Labour Group, but all councillors walked out on three occasions when Cllr Greenslade spoke during the meeting. Cllr Brian Greenslade\nHe had asked questions on Resilence Testing post Brexit and the Barnstaple Civic Centre, and spoke on cabinet member reports on the battle to save Appledore Shipyard and on the numbers of recorded toad traffic accidents in Devon. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nAt the July full council meeting, Cllr Brennan had stood up and said: “I have been a victim of sexual violence in the past in an abusive and manipulative relationship. As a victim I find it disgusting to be forced to share the council chamber with a man who has been found to have sexually assaulted female members of staff.\n\"He is allowed to keep his high standing, his £12,600 allowance funded by Devon taxpayers, to speak at this meeting, and propose motions, and this is wrong. It is putting him above the feelings, needs, the right to feel comfortable and safe in the council.” Cllr Emma Brennan speaking during the meeting\nCllr Greenslade continues to serve the people of Barnstaple North and having been suspended by the Liberal Democrats, currently sits as a North Devon Liberal.\nCllr Greenslade’s actions were described by Devon Council Council’s chief executive Phil Norrey as ‘inappropriate’ and ‘involving touching of a sexual nature’, but as the breaches fall short of the seriously criminal nature, he cannot be dismissed or sacked as a councillor. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-07T13:07:00.000+02:00", "crawled": "2018-12-07T16:29:58.005+02:00", "highlightTitle": ""}