{"organizations": [], "uuid": "14ac6af8ba85293747e56daf923a3dcaa56b2fb4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1233648.ece/ALTERNATES/s1200/laura-ashleyPNG.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/laura-ashley-stores-close-leaving-2334998", "country": "GB", "title": "Laura Ashley stores to close leaving more holes in the High Street", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-17T12:39:00.000+02:00", "replies_count": 0, "uuid": "14ac6af8ba85293747e56daf923a3dcaa56b2fb4"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/laura-ashley-stores-close-leaving-2334998", "ord_in_thread": 0, "title": "Laura Ashley stores to close leaving more holes in the High Street", "locations": [], "entities": {"persons": [{"name": "laura ashley", "sentiment": "none"}, {"name": "neil shaw", "sentiment": "none"}, {"name": "khoo kay peng", "sentiment": "none"}, {"name": "andrew khoo", "sentiment": "none"}, {"name": "khoo", "sentiment": "none"}], "locations": [{"name": "truro", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "plymouth", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}], "organizations": [{"name": "digital", "sentiment": "none"}, {"name": "press association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Laura Ashley stores to close leaving more holes in the High Street 40 more shops are to be shut down Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 10:39, 17 DEC 2018\nLaura Ashley is to close around 40 stores on top of 40 that have already been shut down since 2015, it has been announced.\nSpeaking to the Press Association, Andrew Khoo said he expects to reduce the number of UK stores from 160 to 120, continuing a strategy that has seen 40 retail units close since the beginning of 2015.\nLaura Ashley has three branches in Devon - in Plymouth, Exeter and Barnstaple and one in Truro in Cornwall.\nMr Khoo, who took over as chairman of Laura Ashley's owner from his father Khoo Kay Peng last week, said: \"The direction I want to go is to have not so many stores, but maybe the ones we have could be larger. It's more about showcasing the brand. It doesn't really matter if they buy online or offline, we just want them to get inspired.\" Read More Carpetright blames Brexit as it shuts stores and sees profits tank\nHe added that the group would look at moving staff from any stores which close to the enlarged shops.\nMeanwhile Laura Ashley will roll out bricks and mortar stores in China once it has built a significant online customer base.\n\"We're moving to Asia in a much bigger way,\" said Mr Khoo. \"We have a regional office in Singapore, it's a dedicated office of about 10 people and it's focused purely on ecommerce into China. Once we get a significant foothold in digital retail in China we can look at the physical stores rollout.\"\nBritish retailers have had a difficult year as high street footfall declines and consumer confidence wanes. Last week Sports Direct boss Mike Ashley said November was \"unbelievably bad\" and warned that many retailers will be unable to take the strain.\nMr Khoo said that Laura Ashley in the UK had seen some promising signs in the run-up to Christmas including an uptick in clothing sales, but it has been slow to shift big-ticket items like furniture. Read More\n\"It's a challenging environment and it could become more challenging,\" he said.\nBut he remained positive on Laura Ashley's home market despite the threat of Brexit uncertainty.\n\"My long-term view of the UK is I have confidence in the UK and we will continue to invest in the UK. As long as Laura Ashley stays relevant there's no reason we can't get over this little speed bump.\" Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-17T12:39:00.000+02:00", "crawled": "2018-12-17T12:50:20.016+02:00", "highlightTitle": ""}