{"organizations": [], "uuid": "c0339971552a97d07d7956d3ff4681707a2b54e7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2281663.ece/ALTERNATES/s1200/0_katie-hopkinsPNG.png", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/katie-hopkins-branded-racist-angry-2281571", "country": "US", "title": "Katie Hopkins branded 'racist' as angry protester barges into pro-Brexit rally", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-01T18:22:00.000+02:00", "replies_count": 0, "uuid": "c0339971552a97d07d7956d3ff4681707a2b54e7"}, "author": "Abbie Bray", "url": "https://www.devonlive.com/news/devon-news/katie-hopkins-branded-racist-angry-2281571", "ord_in_thread": 0, "title": "Katie Hopkins branded 'racist' as angry protester barges into pro-Brexit rally", "locations": [], "entities": {"persons": [{"name": "katie hopkins", "sentiment": "none"}, {"name": "katie", "sentiment": "none"}, {"name": "whipton barton", "sentiment": "none"}, {"name": "cllr brennan", "sentiment": "none"}, {"name": "emma brennan", "sentiment": "none"}], "locations": [{"name": "western way", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "heavitree", "sentiment": "none"}, {"name": "exeter high street", "sentiment": "none"}], "organizations": [{"name": "white company", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now\nAn angry protester shouted at Katie Hopkins calling her a 'racist' during a pro-Brexit demonstration at Exeter city centre today.\nKatie, alongside other passionate Brexiteers were in Exeter to spread the message 'dig deep for Brexit' and to encourage Leave voters not to give up on a so-called hard Brexit.\nThe rally, which is due to take place all afternoon started at The White Company on Exeter High Street.\nThe Brexiteers will then proceed to Western Way and on to the quay as part of their pro-Brexit rally.\nAnd while dozens of people gathered around in support of the demonstration, Emma Brennan, Councillor for Heavitree and Whipton Barton stood up in protest calling Katie Hopkins a 'racist'. Emma Brennan called Katie Hopkins a 'racist' Read More\nIn the video above Cllr Brennan, who supports the Labour party, can be seen trying to interrupt Katie during an interview where she shouts \"she's a racist woman that no one wants to hear from\".\nCllr Brennan then continued to shout \"Why is ITV giving a platform to a racist?\".\nDuring other footage captured Cllr Brennan can be seen holding her phone up with a message on it that was calling for the 'people's vote'. Read More Warning after cats kidnapped and subjected to horrifying torture in Paignton\nIn an interview ahead of the rally, Katie Hopkins said: “This is a battle of attrition - wearing down the Leave voters until they give in to Theresa May’s horrific deal just to get people to shut up about it.\n\"People are sick to death of all the talking and moaning. Right now, we need to remember what we voted for. We need to remember the feeling of elation when we won. And we need to dig deep for Brexit. May has surrendered to the EU, we have not”.\nAlison Sheridan, UKIP chairman for Exeter and representative of Leave Means Leave added: “Theresa May has not got us a deal. The word deal is a deceit. She has surrendered our sovereignty to the EU.\n\"We will still be in the single market still be in the customs Union, still be forced to comply with European rules without having a say on what those will be, and will only be allowed to leave if the EU agrees. And we will pay £60 billion pounds for the pleasure. As Nigel says, It is the worst deal in history.\" Katie Hopkins (Image: Bridget Batchelor)\nPolice hit back after Katie Hopkins likens force volunteers to 'Sharia patrols'\n“We need people to dig deep for Brexit, the Brexit they actually voted for. Which is to actually Leave the EU.\"\nMuch of the South West voted to leave the EU. Voters in North, Mid, East Devon, Plymouth, Teignbridge, Torbay, Torridge and West Devon voted to Leave. Pro-Brexit rally in Exeter (Image: Bridget Batchelor)\nWatch a video below on the worst things Katie Hopkins has said Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nExeter itself voted to remain in the EU.\nBrexiteers say this rally will be a moment of unity in what has been a very divisive time for Britain and for political parties on the left and right.\nThere will be representatives from Leave Means Leave, UKIP, the Tory Party, For Britain and Fishing for Leave to show they speak with one voice on their aim: a no-deal Brexit. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-12-01T18:22:00.000+02:00", "crawled": "2018-12-01T18:31:50.017+02:00", "highlightTitle": ""}