{"organizations": [], "uuid": "e5ef3327dc6d3b882c9977d6358b45a81463ad04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article2212052.ece/ALTERNATES/s1200/0_footie-benjpeg.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/news-opinion/peoples-vote-only-way-out-2293880", "country": "US", "title": "People’s Vote is the only way out of Brexit gridlock Parliament is facing - Ben Bradshaw - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "e5ef3327dc6d3b882c9977d6358b45a81463ad04"}, "author": "Ben Bradshaw", "url": "https://www.devonlive.com/news/news-opinion/peoples-vote-only-way-out-2293880", "ord_in_thread": 0, "title": "People’s Vote is the only way out of Brexit gridlock Parliament is facing - Ben Bradshaw - Devon Live", "locations": [], "entities": {"persons": [{"name": "ben bradshaw", "sentiment": "none"}, {"name": "invalid email ben bradshaw", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "turkey", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "people’s vote", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "people's vote", "sentiment": "none"}, {"name": "government’s brexit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion People’s Vote is the only way out of Brexit gridlock Parliament is facing Ben Bradshaw MP says he will vote against the Government’s Brexit “deal”, a General Election is unlikely as 'Turkey's don't vote for Christmas', so a People's Vote is the only solution left Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nBEN BRADSHAW IS THE LABOUR MP FOR EXETER AND HAS BEEN SINCE 1997\nBy this time next week we should know the fate of the Government’s Brexit “deal”. Of course, it’s not really a deal at all. It’s an agreement on the terms of the UK’s divorce from the European Union, accompanied by a non-binding “political declaration” about our future relationship.\nI shall be voting against it, because it represents the worst of all worlds. It will leave Britain poorer, we will have less, not more, control and it will guarantee the current uncertainty and political wrangling will go on for years to come.\nIf, as seems likely, the deal is rejected, what then? Ben Bradshaw MP\nMrs May could try to go back to Brussels to get something better. But she herself and the rest of the EU have stated clearly: “this is it”. Read More Ben Bradshaw on Dawlish rail line and the sea-change in public opinion on Brexit\nI detect little appetite among MPs and even less among the public for this to drag on.\nConservative MPs might try to get rid of the Prime Minister. But that would do nothing to change the parliamentary arithmetic. Labour will, I assume, call for a general election. But that is unlikely to succeed, because, under the Fixed Term Parliament Act, significant numbers of Tory MPs would have to vote for one and turkeys don’t vote for Christmas.\nOne of the important defeats inflicted on the Government this week ensures that, if the deal goes down, Parliament will take control of the process. The Government will have to come back to the Commons within 3 weeks with a motion proposing a way forward, which MPs will be able to amend. In practice, this should happen sooner, as it is not in the national interest to allow the uncertainty to continue through Christmas and into the New Year. Exeter MP Ben Bradshaw\nParliament will rule out “no deal” – crashing over the cliff edge in March – as that would do such calamitous damage to our economy and the fabric of our country for years to come. Read More No aspect of our local life in Exeter is immune from the impact of Brexit\nThere’s been talk this week of revisiting the “Norway option” – the least damaging form of Brexit – inside the Single Market. To solve the Irish border issue we’d also need to be in a Customs Union. But this would leave us having to abide by all the obligations of EU membership without any say over them – a rule taker, not a rule maker.\nSome of us, including me, have been arguing and voting for this over the last two and a half years as the least bad Brexit. But we have been repeatedly rebuffed by Mrs May, who’s been too weak to stand up to the hard Brexiteers in her Cabinet and on her back benches. I doubt the Labour front bench would support Norway now and, anyway, time is running out. Read More People are really angry that a mental health hospital will be built next to school\nThe rest of the EU have made clear we can only extend Article 50 for a general election or another referendum. Given the unlikelihood of an election, the only way out of this gridlock may well be to ask the public to deliver their verdict on the Government’s deal, in a People’s Vote, something I have long advocated and predicted. Like us on Facebook ", "external_links": [], "published": "2018-12-05T02:00:00.000+02:00", "crawled": "2018-12-05T14:05:06.018+02:00", "highlightTitle": ""}