{"organizations": [], "uuid": "f64ab7bcde9fc1bf57972befbae192b3c0c8bc40", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1650107.ece/ALTERNATES/s1200/Joules.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/joules-becomes-latest-big-retailer-2294230", "country": "GB", "domain_rank": 48128, "title": "Joules becomes latest big retailer to draw up no-deal Brexit contingency plans - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.634, "site_type": "news", "published": "2018-12-05T02:00:00.000+02:00", "replies_count": 0, "uuid": "f64ab7bcde9fc1bf57972befbae192b3c0c8bc40"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/joules-becomes-latest-big-retailer-2294230", "ord_in_thread": 0, "title": "Joules becomes latest big retailer to draw up no-deal Brexit contingency plans - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "joules", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexiters", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "invalid email joules", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Business\nJoules has become the latest big retailer to draw up contingency plans in case Britain drops out of the EU without a trade deal.\nAs Theresa May battles MPs within her own party and the opposition over her Brexit proposals UK businesses are trying to ensure they don’t get caught out by short-term border delays, trade restrictions and a plummeting pound should the Government force us into a hard Brexit.\nBritain will know on Tuesday if MPs have backed the PM’s controversial Chequers deal with the EU, which will see free trade areas for goods and frictionless borders – abiding by EU rules for the foreseeable future, but with no further say in them.\nIf the Chequers deal is blocked by Remainers and hard-core Brexiters then Harborough-headquartered Joules said it had teed up a warehouse in Europe to ensure its EU customers can still buy its products.\nIt is also planning to bring items into its Corby warehouse a few weeks earlier than usual in the run-up to the March 29 withdrawal date.\nIt comes a week after Topps Tiles , which is based in Enderby, said it was buying in enough of its biggest sellers to tide it over for five or six weeks in case of port delays when Britain leaves the EU on March 29. Read More Topps Tiles explains why it's stockpiling top selling products ahead of Brexit\nAnd back in September, Next PLC, also based in Enderby, warned about potential port delays, increased tariffs, and a drop in the value of the pound from a no-deal Brexit.\nIn the “unlikely event” that free-trade agreements were not in place next spring, Next said the cost of its goods could go up around £20 million, adding almost 0.5 per cent to prices.\nJoules – which announced a positive trading update today with sales up 17.6 per cent in the past six months – said trading conditions would remain “challenging” in the coming months due to economic uncertainty, changing shopping habits and tough competition. Read More How Leicester and Leicestershire MPs intend to vote on Theresa May's Brexit deal\nIt said: “Contingency plans have been put in place to mitigate the expected disruption that could arise in the event of a 'hard Brexit'.\"\n“These plans include establishing an EU-based third-party distribution facility; scheduling earlier inbound product deliveries for our spring/summer 2019 ranges; preparation for expected increased administrative activities; and hedging US dollar requirements more than 12 months forward.”\nJoules finance director Marc Dench said taking on the new warehouse in Europe – which he said was “ready to go” – had been in its medium term plans anyway, but would help in case there were issues shipping goods out of Britain and into the EU. Read More Pets at Home is stocking pet food for Brexit- and could close 30 vet practices\nHe said: “It’s just good practice to be thinking about it.\n“We’ve had a team looking for some time at what might be the worst that can happen and how we can prepare for that without adding excessive costs.\n“You have to prepare for the worst and hope for the best.” Colin Porter, the CEO of Joules, based in Market Harborough\nJoules said overall sales were up almost a sixth in the last six months to £113.1 million, compared to the same time last year.\nOnline and store sales were up more than a fifth to around £80 million – with web sales now accounting for more than half that figure.\nSales to independent stockists and big name retailers such as John Lewis and Next Label were up 8 per cent to £32.5 million.\nChief executive Colin Porter described it as another period of “strong performance”.\nHe said: “This performance, which is ahead of our initial expectations for the period, is testament to the strength of the Joules brand, the engagement of our loyal customers with our product collections, and our fantastic teams. Read More", "external_links": [], "published": "2018-12-05T02:00:00.000+02:00", "crawled": "2018-12-05T18:37:35.004+02:00", "highlightTitle": ""}