{"organizations": [], "uuid": "d22fbf5c80ab3e24ffb402b180c613014a4fee7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1359538.ece/ALTERNATES/s1200/WhatsApp-Image-2018-03-19-at-132858-1jpeg.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/what-met-office-say-the-2281044", "country": "US", "title": "This is what the Met Office has to say about 'the worst winter in 70 years'", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-01T13:06:00.000+02:00", "replies_count": 0, "uuid": "d22fbf5c80ab3e24ffb402b180c613014a4fee7a"}, "author": "Abbie Bray", "url": "https://www.devonlive.com/news/devon-news/what-met-office-say-the-2281044", "ord_in_thread": 0, "title": "This is what the Met Office has to say about 'the worst winter in 70 years'", "locations": [], "entities": {"persons": [{"name": "abbie bray", "sentiment": "none"}], "locations": [{"name": "scotland", "sentiment": "none"}], "organizations": [{"name": "met office", "sentiment": "none"}, {"name": "dec", "sentiment": "none"}, {"name": "the met office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News This is what the Met Office has to say about 'the worst winter in 70 years' Some weather forecasters reported that an arctic blast is on its way, although the Met Office say December is likely to be 'mild' Share Abbie Bray What's On Reporter 11:06, 1 DEC 2018 Click to play Tap to play The video will start in 8 Cancel Play now\nThe Met Office has responded to claims that \"the worst winter in 70 years\" is on its way.\nAccording to weather reports yesterday , some places will see a major snowstorm bringing conditions that could threaten to cause travel chaos during the festive season and into the start of 2019.\nWarning that a bitter Arctic blast will sweep across the country, some forecasters said the 'white out' could bring the most prolonged snowy winter since 1950 when parts of Scotland were under a blanket of white for 102 days.\nBut the Met Office has somewhat downplayed those forecasts - and says th eweather is expected to be pretty mild over ther festive period. Snow on the moors\nOur sister title Bristol Live approached The Met Office for a weather forecast for the Christmas period.\nThey said the forecasts given elsewhere were \"not the view of the Met Office\". Read More Cold hard winter is ahead\nOutlining what we could expect over Christmas, they said we can expect it to be \"mild\" across much of the country and and snow should be confined to hills in the north.\nA Met Office spokesperson said: \"As we head into the middle of December there are signs that it will turn unsettled again with more generally wet and windy weather affecting the UK.\n\"This will bring heavy rain and gales or severe gales, with a chance that it may even turn stormy at times.\n\"Overall, it is likely to be mild across much of the country with snow tending to be confined to hills in the north. However, in any drier interludes it will turn colder.\" Wintry showers have been forecast for some parts of the country Read More Katie Hopkins to lead pro-Brexit demo through Exeter city centre today\nForecasters previously told the Express that Britain could see the worst winter since 1950.\nJames Madden, of Exacta Weather, said: “After this brief interlude of milder weather there will be a quick reversal back to cold conditions accompanied by wintry weather and some notable snow showers, particularly, across the north.\n“This will pave the way for a number of further snow events during the early to mid part of December, some of these could be severe enough to cause disruption.\" Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.express.co.uk/news/weather/1052236/UK-weather-forecast-snow-uk-cold-how-long-freeze-met-office-long-range-forecast", "https://www.bristolpost.co.uk/news/bristol-news/what-met-office-say-worst-2279877"], "published": "2018-12-01T13:06:00.000+02:00", "crawled": "2018-12-01T13:32:15.011+02:00", "highlightTitle": ""}