{"organizations": [], "uuid": "190352181c9318fc674489c6b99e95c85c7fafb1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15574343.ece/ALTERNATES/s1200/0_CFR_NJL_191218michell_01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastles-british-engines-starts-see-15573896", "country": "GB", "domain_rank": 21960, "title": "Newcastle's British Engines starts to see results of moving into new markets", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-19T18:25:00.000+02:00", "replies_count": 0, "uuid": "190352181c9318fc674489c6b99e95c85c7fafb1"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastles-british-engines-starts-see-15573896", "ord_in_thread": 0, "title": "Newcastle's British Engines starts to see results of moving into new markets", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "south shields", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "positive"}, {"name": "rolls-royce", "sentiment": "none"}, {"name": "british engines) british engines", "sentiment": "none"}, {"name": "petrobas", "sentiment": "none"}, {"name": "michell bearings", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Newcastle's British Engines starts to see results of moving into new markets The engineering group has diversified to halt its reliance on the oil and gas sector - but says Brexit is making planning difficult Share The Michell Bearings factory in South Shields, which is part of the British Engines group (Image: British Engines) Get business updates directly to your inbox Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\nBritish Engines says it is starting to see the results of its diversification despite reporting a 10% drop in revenue.\nThe North East engineering group has unveiled results for the year ended April 30, showing the dip in revenue from £154m to £138.5m, with an underlying operating profit down to £3.6m from £6.2m the previous year.\nDespite this, reported operating profit was broadly in line with the previous year, as a result of reductions in exceptional costs relating to the company’s reorganisation.\nThe firm noted exceptional costs of £203,000 for reorganisation following the acquisition of Michell Bearings from Rolls-Royce, as well as an exceptional cost of £924,000, capital costs the firm had put in place for some R&D work for oil company Petrobas which the firm then said did not need to be carried out.\nA further £1.457m of exceptional costs came in the form of BEL Engineering (UK) Ltd’s factory move. Read More Former Morpeth register office to be transformed into luxury flats\nOver time, turnover has shrunk from a high of £154m in 2014 to £138.5m in 2018, and profit has tumbled from £20.7m to £2.46m.\nEmployee numbers have held strong over that period, despite the fall in sales and profit, increasing to 1,350 last year from the 2014 workforce of 1,173.\nDespite seeing turnover fall in recent years, the group’s chairman said its decision to diversify into a greater number of industry sectors, to reduce reliance on the oil and gas sector, was beginning to bear fruit.\nThe group, which has eight engineering businesses in the region and has been in operation for 96 years, is seeing revenue growth in new product lines and new markets, all of which have been possible due to the reorganisation.\nA degree of stability is also returning to the oil and gas markets, which has also provided encouraging news for the future. Read More Champagne bar pulls into Newcastle Central Station to serve bubbles and real ale\nChairman Alex Lamb said the group’s flexible and dynamic business model is the reason for the successful longevity of the business, which started out refurbishing engines for the shipbuilding industry on the River Tyne in the 1920s.\nMr Lamb said: “The current year remains challenging, but despite this, the level of order intake is improving in our traditional markets, and this is being supplemented by significant orders in both defence and key infrastructure projects in the energy and energy transmission sectors.\n“As a result, we are optimistic that we will see improved levels of performance going forward.\n“This optimism for the future is, however, heavily caveated by the ongoing Brexit discussions, which are making any sort of planning for the future very difficult, given that our companies are heavily reliant on export markets for growth. Read More\n“As a result, we are being quite cautious with regards to investment decisions as we are unable to predict what the costs of doing business overseas will be after Brexit. This is a\nsignificant concern for the group.”\nBritish Engines comprises CMP Products, BEL Valves, BEL Engineering, Rotary Power, Michell Bearings, Stephenson Gobin, Stadium Export Services and Tyne Subsea. Like us on Facebook", "external_links": ["https://communicatoremail.com/IN/DCF/wo13VulRxfnD9_IKKGjv78/", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-12-19T18:25:00.000+02:00", "crawled": "2018-12-19T20:37:29.000+02:00", "highlightTitle": ""}