{"organizations": [], "uuid": "951e75ee42db83e77b2a3b2f37cdf326bef2a7f7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12485638.ece/ALTERNATES/s1200/1_North-American-International-Auto-Show-Features-Latest-Car-Models.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15529318", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Nissan's Carlos Ghosn charged with \"under-reporting income\" in Japan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-12-10T10:30:00.000+02:00", "replies_count": 0, "uuid": "951e75ee42db83e77b2a3b2f37cdf326bef2a7f7"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15529318", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Nissan's Carlos Ghosn charged with \"under-reporting income\" in Japan", "locations": [], "entities": {"persons": [{"name": "carlos ghosn", "sentiment": "negative"}, {"name": "demuris", "sentiment": "none"}, {"name": "jeff errington", "sentiment": "none"}], "locations": [{"name": "japan", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "demuris", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "nissan", "sentiment": "negative"}, {"name": "demuris ltd", "sentiment": "none"}, {"name": "newcastle university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Newcastle firm discovers new breakthrough antibiotic that can combat tuberculosis\nA bioscience company in Newcastle has discovered a new antibiotic that could treat 600,000 cases of drug resistant tuberculosis every year.\nDemuris Ltd has worked with UK and US scientists, to identify the new antibiotic, which could help the 1.7 million people who die every year from tuberculosis.\nThe new drug is known as Kanglemycin A and works by binding to an essential enzyme on the bacteria that causes the disease. However, crucially, it does not bind to the human enzymes.\nDemuris was spun out of Newcastle University around 10 years ago by Professor Jeff Errington, CEO at Demuris.\nHe said:\nThis exciting project validates our company strategy of using state of the art genetic and biochemical assays and a uniquely diverse and well dereplicated collection of actinobacteria to discover new antibiotics.\nWe have also benefitted by having access to a world class group of academic scientists covering the microbiology, biochemistry and structural biology methods needed for the project. This is the first of a string of new drug starting points coming from the Demuris portfolio.\nThe work at Demuris was funded by Innovate UK.\nThe company has now patented the compound and is looking to develop even more active versions of the drug.\nThe research project involved a large multidisciplinary team involving Newcastle and Penn State University scientists, Public Health England, Newcastle upon Tyne Hospitals NHS Foundation Trust and Demuris Ltd. Prof Jeff Errington, founder of Demuris (Image: Unknown) 9:15 KEY EVENT Kromek wins first biological-threat detection with US Department of Defense\nRadiation detection firm Kromek has won its first contract with the US Department of Defense for equipment that can be used to spot biological-threats.\nThe contract is worth $1.99m over a 12-month period and will see Kromek develop a proof-of-concept for a vehicle-mounted biological-threat identifier.\nThe work will be carried out for use for the Defense Advanced Research Projects Agency (DARPA).\nIf successful Kromek could be employed by DARPA to manufacture the product for years to come.\nDr Arnab Basu, CEO of Kromek, said:\nAs the SIGMA programme has begun transitioning to the US Department of Homeland Security, DARPA is turning its focus to add the next generation of biological-threat detection systems.\nWe are delighted to be awarded this additional contract from DARPA, as it expands our relationship with them and broadens our expertise into biological threat detection, adding to our radiological and nuclear threat detection capabilities. Chief executive of Kromek, Arnab Basu (Image: Publicity Pic) 9:10 Jonathon Manning Thames Water deploys hundreds of night-time leak detectors to tackle repairs\nHundreds of Thames Water staff are walking the streets at night, listening for leaks, as the utility giant battles to make repairs after a year of extreme weather wreaked havoc.Chief executive Steve Robertson told the Press Association the group is deploying teams of night-time leak detectors as part of efforts to avoid a repeat of this year’s supply woes that left nearly 75,000 people without water.It comes after the utility giant - which has 15 million customers - revealed in its recent half-year results that the Beast from the East and prolonged heatwave caused a surge in leaks and water supply outages.The group said up to 75,000 customers saw their supply hit during the freezing cold weather and subsequent thaw in March as pipes burst.Britain’s searing hot summer compounded woes, causing a 30% rise in leaks.Mr Robertson said Thames Water was taking a raft of measures to tackle leaks and prevent a repeat of this year’s widespread water supply disruption.He said:\nWe have hundreds of people every night out on the streets listening for leaks.\nYou have to do it at night when it’s quiet - that’s how you find them.\nThese teams have high-tech acoustic loggers and electronic sensors to identify leak areas and then use so-called listening sticks to pinpoint exactly where water is escaping.While it has tried satellite imagery, drones and various new innovations, it said “nothing can beat the ear of an experienced leakage detection engineer”.Thames Water - which is Britain’s biggest water company, serving a quarter of the UK population - has hired an extra 600 staff to help with repairs and leak detection this year.It repaired more than 1,400 leaks on average a week in the six months to September 30 - a 10-year high for the group.The group has developed new techniques to better predict freezing weather and potential damage in advance, while also trialling innovations to repair pipes from the inside.\nMr Robertson said:\nOur ability to monitor and predict the sort of impact we have from the Beast from the East is much better now than it was last year. A water meter (Image: Getty Images) 9:05 KEY EVENT Hollywood Bowl to open new sites as profits rise\nHollywood Bowl has revealed it will open new sites across the country after reporting record profit and turnover revenue.\nThe company, which is the UK’s largest 10-pin bowling operator, saw its profits before tax jump 13% to £23.9m for the year ending September 2018.\nTurnover also increased by 5.8% to £120.5m.\nThe company unveiled a special dividend of 4.33p per share, taking the total dividends for the year to 10.59p per share.The group, which listed in 2016, said this would add up to £29.8m returned to shareholders since the IPO.Chief executive Stephen Burns said:\nOperating our business in line with our customer-led strategy has delivered another strong revenue performance which, combined with our continued focus on cost management, has resulted in a year of record profits and significant operating cash generation.\nThe investment into our high-quality portfolio of 58 profitable centres continues to deliver significant, above target, returns. Our new centres are performing very well and we have secured a strong pipeline of new openings that will further enhance the quality of our portfolio.\nNew sites are due to open in Intu Watford and Intu Lakeside in the current financial year, while more openings are in the pipeline until 2022. A Hollywood Bowl venue Jonathon Manning North East Fund boss assures firms investments are safe despite Brexit\nThe CEO of a major North East investment fund has spoken out to assure businesses that its funds will remain safe after the UK leaves the European Union.\nAndrew Mitchell, CEO of the North East Fund Limited which is headquartered in Newcastle, said the fund will continue after Brexit despite it deriving from the European Investment Bank (EIB).\nThe £120m investment agreed for the North East over the next five years has been secured and local businesses looking to grow should still apply for funding through the scheme, he said.\nMr Mitchell’s assurance come as local businesses raise concerns over how regional investment for start-ups will be impacted by Brexit, as many funds originate from the EU.\nHe said:\nThis is the second time that the EIB has invested and committed to the region and this demonstrates a high level of confidence in North East-based organisations, especially SMEs. EU membership has enabled regional accelerator programmes, attracted European founders and new talent, but there is also an uncertainty regarding what could replace EIB funding in the future.\nNobody truly knows what is going to happen after Brexit and speculation, either way, is something which cannot be avoided. However, our four fund management companies are now allocating the investment which we have secured.\nFrom our point of view, supporting trailblazing companies that are innovative, produce market-leading goods and who put the region on the map, will only encourage new funding opportunities in the future. The North East Fund could assist approximately 600 SMEs support economic growth, employment and generate a good return on investment, money that can be put straight back into the North East economy. Andrew Mitchell, CEO of the North East Fund (Image: Unknown) 8:52 Jonathon Manning November shopper footfall in worst decline since recession\nThe number of visits to town centres and shipping hubs during November dropped by the fastest rate since the recession, according to new figures.\nFootfall fell by 3.2% last month, according to retail analysts at Springboard, and is the steepest drio since 2009.\nDiane Wehrle, Springboard’s marketing and insights director, said:\nWhilst online shopping was inevitably more prevalent than in other months, the vast majority of spending still remained in store and this is what Black Friday impacts adversely.\nSince 2013, when Black Friday became established as a key trading day, footfall has decreased in every year bar one and the only increase in 2017 was just 0.2%.\nThe report also forecasts a 4.2% decline in footfall during December, a more severe drop than last year’s 3.5%.Ms Wehrle said:\nAs we head into the zenith of the retail trading calendar, both retailers and consumers alike are in the midst of the greatest degree of uncertainty in recent times.\nHowever, the fact that the parliamentary vote is not taking place until the middle of December might deliver a slight glimmer of hope for some large ticket item retailers, as consumers may purchase now rather than later in an attempt to outrun inflationary pressures that are expected should the Brexit deal not be ratified. Pedestrians walk past the House of Fraser flagship store on Oxford Street (Image: Getty Images) 8:47", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15529318;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-12-10T10:30:00.000+02:00", "crawled": "2018-12-10T12:09:55.005+02:00", "highlightTitle": ""}