{"organizations": [], "uuid": "b3db4c957c44da6ffede2af34f532f8381be8bca", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14823723.ece/ALTERNATES/s1200/JS155525900.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/virgin-east-coast-boss-says-14915921", "country": "GB", "domain_rank": 21960, "title": "Virgin East Coast boss says the failed franchise improved services", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-16T20:00:00.000+03:00", "replies_count": 0, "uuid": "b3db4c957c44da6ffede2af34f532f8381be8bca"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/virgin-east-coast-boss-says-14915921", "ord_in_thread": 0, "title": "Virgin East Coast boss says the failed franchise improved services", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "virgin east coast", "sentiment": "none"}, {"name": "share virgin east coast", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "pa", "sentiment": "none"}, {"name": "directly operated railways", "sentiment": "none"}, {"name": "stagecoach", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Virgin East Coast boss says the failed franchise improved services There's better carriages, improved food and more destinations on the East Coast Main Line, says rail manager Share Virgin East Coast boss says the failed franchise improved services (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing!\nThe rail operator responsible for the doomed East Coast Main Line franchise has insisted that services improved under its management.\nStagecoach, which owned 90% of Virgin East Coast, said it kept its promises to improve carriages, food and the number of destinations on offer.\nVirgin East Coast quit the franchise to run inter-city services on the East Coast Main Line on 24 June 2018, even though it was due to run until 2023.\nServices have been taken over temporarily by a Government-owned train operator.\nIt’s the third time a private operator has walked away from the East Coast Main Line and services were run by a Government-owned business called Directly Operated Railways from 2009 to 2015. Read More Donald Trump would not be welcome in the UK under a Labour government, says John McDonnell\nMartin Griffiths, Chief Executive of Stagecoach, told MPs that Stagecoach had lost £200 million because the franchise ended early.\nBut he told the House of Commons Transport Committee: “All of the things we said we would do in terms of management initiatives - the product itself, the upgrade of first class, the upgrade of standard class, the upgrade of the food offering, the extra seats, the extra destinations - all of those that were bid, were put in.”\nHe said Stagecoach was unable to continue providing services and making the payment originally promised to the Government because growth in passenger numbers had not met expectations.\n“The thing that didn’t materialise was the growth in passenger numbers and therefore the growth in revenue.”\nHe added: “The reputational damage and the financial damage to our group has been very significant.\n“On this one contract Stagecoach group will have lost about £200m.\n“That’s about a fifth of our current market capitalisation.\n“The penalty has been very significant for us.”\nVirgin East Coast began operating long-distance services on the East Coast Main Line in March 2015, nine months after submitting its bid in June 2014.\nMPs have urged the Government to invest in the neglected East Coast Main Line to prepare it for the arrival of high speed rail services.\nRail Minister Jo Johnson has met MPs campaigning for improvements to the line, led by Newcastle North MP Catherine McKinnell.\nAnd in a letter to Mr Johnson, she said: “The East Coast Main Line - one of the country’s most strategically important routes, which serves multiple traffic flows including over 20 million passengers a year - suffers from ageing and unreliable infrastructure.” Read More Why a second Brexit referendum has become more likely\nMs McKinnell chairs the all-party Parliamentary Group for the East Coast Main Line, which includes MPs from all parties.\nThey argue that the line, running between London, Newcastle and Edinburgh, has never received the same level of investment as the West Coast Main Line, which runs to Manchester and Birmingham, and was modernised ten years ago at a cost of more than £8bn.\nSections of the East Coast Main line will have to be upgraded because high speed trains will run on it once the HS2 high speed rail line starts running to Yorkshire in 2033.\nThe plan is for trains to switch on to the existing track near Leeds, and continue running to Newcastle.\nBut this will leave the rest of the East Coast Main Line offering a second-class service, according to MPs. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-16T20:00:00.000+03:00", "crawled": "2018-07-16T20:56:30.001+03:00", "highlightTitle": ""}