{"organizations": [], "uuid": "743d37504bb76151a56d36bdd9fff2c21afd11df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14943631.ece/ALTERNATES/s1200/1_Protesters-outside-the-cabinet-meeting-at-the-Sage-Gateshead-on-Monday-From-left-to-right-Libby-Mor.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-may-cabinet-meeting-protest-14943609", "country": "GB", "domain_rank": 21960, "title": "Protesters make their voices heard outside Theresa May's cabinet meeting", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-23T20:00:00.000+03:00", "replies_count": 0, "uuid": "743d37504bb76151a56d36bdd9fff2c21afd11df"}, "author": "Mike Fuller", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-may-cabinet-meeting-protest-14943609", "ord_in_thread": 0, "title": "Protesters make their voices heard outside Theresa May's cabinet meeting", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "theresa", "sentiment": "negative"}, {"name": "emma emeny", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "sage gateshead", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Protesters make their voices heard outside Theresa May's cabinet meeting The Prime Minister Theresa May held an 'away day' cabinet meeting at the Sage Gateshead on Monday Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA handful of protesters made their feelings known to Theresa May on her visit to the North East.\nThe Prime Minister held an ‘away day’ cabinet meeting at the Sage Gateshead on Monday to tie in with the Great Exhibition of the North .\nMrs May and her team had arrived unnoticed at about 11am.\nBut they faced opposition from a small but vocal group as they left the venue at about 1.15pm. Protesters outside the cabinet meeting at the Sage Gateshead (Image: Reach)\nThe campaigners were there to show their anger to the Government’s economic and Brexit policies.\nEmma Emeny, 34, from Newcastle, said she had seen the impact of Conservative austerity through her work in social care.\nShe said: “I came here because I believe the Prime Minister and the Government don’t listen to the people who elected them. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\n“I work with some of the most vulnerable people in society and I’ve seen the direct impact of so-called austerity measures. I believe these measures are wrong.\n“We have disabled people getting their benefits cut, people in full-time jobs who are using foodbanks and women are being turned away from domestic violence shelters because there’s no funding to keep them open.\n“I believe Government policies should protect the most vulnerable in society and I don’t believe this Conservative Government is doing that.” Read More\nJoe Herbert, 23, from Newcastle, said getting people together had been difficult because of the secrecy surrounding the PM’s visit.\nThe location of the cabinet meeting was only revealed on Monday morning.\nThere was a strong police presence including armed officers outside the Sage ready for Mrs May’s arrival. Prime Minister Theresa May speaks during a cabinet meeting at Sage Gateshead (Image: PA)\nLibby Morrison, 53, from Alnmouth, said: “On both sides [of Brexit] people have started to become increasingly unhappy about what’s being going on. Frankly it’s a complete shambles.\n“I just really think it’s a bad idea, it’s a bad idea for this country. Some of the forecasts for the country are absolutely shocking. This affects real people’s lives.\n“I think in some ways Theresa May has had an impossible task. Nobody seems to know what’s happening and I think we should just need to call a halt.”\nPauline Curwen, 68, from Ashington, made it a four-strong group outside the Sage from midday onwards.\nA further three members of the public joined the protest just before the time ministers were leaving.\nMrs May headed off to attend a Q&A at The Reece Group at Armstrong Works. Read More North of Tyne's £600m devolution deal set to move a step closer to reality\nThere she was asked how she could deliver “the Brexit people want”.\nThe Prime Minister answered: “The question people were asked was a simple one, leave or remain, but behind that there are layers of complexity.\n“I think the key issues were an end to freedom of movement, end to the jurisdiction of EU court of justice, end to the feeling we were paying huge sums of money, to get the feeling that we are able to take control of our borders and make our own rules.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-23T20:00:00.000+03:00", "crawled": "2018-07-24T02:22:09.001+03:00", "highlightTitle": ""}