{"organizations": [], "uuid": "0188bc56edb112295ba6cca46c2af783b09ef1e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14362162.ece/ALTERNATES/s1200/Mothercare-results.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14882716", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Mothercare to shut 60 stores with loss of 900 jobs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-09T10:30:00.000+03:00", "replies_count": 0, "uuid": "0188bc56edb112295ba6cca46c2af783b09ef1e5"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14882716", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Mothercare to shut 60 stores with loss of 900 jobs", "locations": [], "entities": {"persons": [{"name": "coreena ford", "sentiment": "none"}, {"name": "anthony joshua", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "coreena ford gateshead", "sentiment": "negative"}, {"name": "mothercare", "sentiment": "negative"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "finance durham fund", "sentiment": "none"}, {"name": "muss styling", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Gateshead car 'pimping' firm goes bust after striking £250,000 deal with investors\nCar-wrapping specialist Muss Styling has entered liquidation less than three months after striking a six-figure investment deal through a publicly-backed finance fund.\nGateshead’s Muss Styling specialised in customising car exteriors for TV and sports stars from its Team Valley workshop. Its clients included sports stars and TV personalities, and it carried out work for a number of Newcastle United players.\nThe company had developed a strong social media presence, gaining attention through the work it carried out on luxury cars and by chauffeuring heavyweight boxing champion Anthony Joshua around during the athlete’s victory tour of the UK.\nIts success led it to strike an investment deal with the Finance Durham Fund, which was reported to be worth £250,000.\nHowever, despite investing in growing the business, Muss Styling has been forced to close. Muss Styling carries out a range of automotive fashion work (Image: Unknown) 9.00 Coreena Ford £4.1m lottery grant will see restoration of one of Newcastle's finest buildings\nOne of Newcastle’s finest but least known buildings has been given the go-ahead for a major restoration project after winning a £4.1m lottery grant .\nThe North of England Institute of Mining and Mechanical Engineers, close to Central Station, was a key meeting place in the 19th century as scientists and engineers on Tyneside helped drive the Industrial Revolution.\nThe site houses an extensive archive and is currently hosting a number of displays linked to the Great Exhibition of the North.\nIt will now be turned into a public space known as the Common Room of the North which aims to inspire the next generation of engineers and innovators, thanks to a grant from the Heritage Lottery Fund.\nAs well as repairs to the building and upgrades to make it more accessible, the grant will help digitise the Mining Institute’s unique mining archive. How the Mining Institute's Neville Hall would look after restoration (Image: Clouston Group and EYELEVEL Creative) 8.54 Coreena Ford David Davis quits as Brexit Secretary - latest updates\nTheresa May faces a leadership crisis after David Davis savaged the Government’s approach to Brexit while dramatically quitting as the minister responsible for the UK’s departure from the European Union.\nHis resignation has been warmly welcomed by hardline Eurosceptics in the Tory ranks who were already expressing reservations about Mrs May’s leadership after her Cabinet agreed a plan which would keep the UK closely tied to Brussels.\nThe Prime Minister now faces a stormy meeting with Tory MPs and peers in Parliament tonight as she tries to keep her fragile administration together.\nMrs May had hoped that the Cabinet agreement secured on Friday at Chequers would help her deliver the “right Brexit” for the UK, with an offer to Brussels to share a “common rulebook” on goods and form a new UK-EU free trade area.\nWe have a separate live blog with full reaction, analysis and updates running here . David Davis (Image: Getty Images Europe) 8.42 Coreena Ford Asda boss warns over rotting food at UK border\nThe Asda chief executive has added his voice to a chorus of supermarket bosses warning that a hard Brexit could leave food rotting at the border and have severe financial implications for the sector.\nRoger Burnley told the Press Association that anything disrupting established food supply chains, currently governed by EU customs arrangements, would have “significant consequences”.\n“What would be scary is the prospect of any hold up at the border. Any prospect of a hold up - that includes the southern Ireland border - would have very significant consequences.\n“You’d be eating into the life of products with all sorts of implications for waste, for freshness, for quality,” he said.\nBusinesses such as Airbus and BMW have become increasingly vocal in recent weeks over the impact of Brexit, calling for urgent clarity as the Government continues to dither over its position.\nMike Coupe, the chief executive of Sainsbury’s, which is merging with Asda, has also issued a similar warning regarding the impact of customs delays. Asda chief executive Roger Burnley 8.40 Coreena Ford Marks & Spencer to ditch financial figures at its AGM\nMarks & Spencer has decided to forgo its usual trading update when it meets shareholders at its annual general meeting (AGM) this week.\nIt will be the first AGM under the retailer’s new chairman, Archie Norman, who was parachuted in last year to lead a turnaround of the business.\nHowever, M&S will not be informing the market on its first-quarter trading, as it has done in previous years.\nIt is understood that M&S’s decision to keep its financial figures under wraps is part of Mr Norman’s plans to take a more long-term view of the embattled business.\nClive Black, retail analyst at Shore Capital, said it was “relatively unusual” for a company not to update the market on trading at its AGM, but that there was no requirement for M&S to do so.\nHe said:\nM&S is in a multi-year change programme with a new management team. Clearly that team wants the space to implement its plans with reduced stockmarket distraction and so it is pressing on.\nHowever, the board would be obliged to issue a financial statement if it believes it will miss profit targets for the full year. The green wall on M&S Northumberland Street (Image: handout) 8.35 Coreena Ford Stobart board blocks re-entry of former chief executive\nStobart’s board has blocked the reappointment of its former chief executive as a director after its chairman narrowly survived an attempt to oust him from the company.\nAt Stobart’s annual general meeting on Friday, close to 49% of its shareholders voted against chairman Iain Ferguson’s reappointment, just under the threshold required to remove him.\nShareholders also backed a resolution to appoint former boss Andrew Tinkler as a director, after he was fired as chief executivwe last month. However, the board blocked Mr Tinkler’s appointment, saying it was not in the best interests of the company for him to become a director.\nMr Tinkler was sacked for leading a bid to push Mr Ferguson out of the company and replace him with retail boss Philip Day.\nMr Tinkler was subsequently hit with a legal case for breach of contract and breach of fiduciary duty. Warwick Brady, Stobart’s new chief executive, said Mr Tinkler had threatened to “destabilise the company”.\nMr Ferguson said the company will now work to unite its shareholders. “Andrew Tinkler will not be part of this process - the board has taken the decision again to dismiss him, following the passing of his resolution to be elected as a director of the company,” he said.\n“The board maintains the view that, notwithstanding the support of certain shareholders, given the seriousness of his breach of fiduciary duty and the impending court cases against him, it would not be in the best interests of the company for him to act as a director.” 8.30 KEY EVENT Mothercare to close 60 UK stores\nMothercare has announced that it is closing another nine stores, leading to the loss of around 100 jobs.\nThe store closures mean a total of 60 Mothercare stores will now be shut by June next year, putting 900 jobs at risk.\nThe retailer announced to shareholders that it has made “good progress” with the refinancing and restructuring plans it first set out on May 17 and that it plans to raise £32.5m from existing shareholders through a placing it expects to be complete on July 27.\nMark Newton-Jones, Chief Executive Officer, said:\nAfter a very challenging period for our business, we have now finalised arrangements to restructure and refinance the Group, ensuring that the transformation of the Mothercare brand we started four years ago can now be completed.\nMothercare is a great British brand with over 50 years of heritage and we now have the financing in place to take it forward for many more years to come.\nWe have seen an unprecedented period for UK retail and we have not been alone in facing a number of strong headwinds. I’m pleased to say however, that we are now in a position to re-focus on our customers and improve the Mothercare brand both in the UK and across the globe. We have exciting plans ahead to revitalise the brand through enhancing our product ranges, improving our design and value, developing our digital and multi-channel proposition and investing in our people. Our goal remains clear, to be the leading global specialist for parents and young children. A Mothercare store.", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14882716;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-07-09T10:30:00.000+03:00", "crawled": "2018-07-09T11:57:39.011+03:00", "highlightTitle": ""}