{"organizations": [], "uuid": "5595832e8fb62199b7032cf641a0a3d6cc7c68ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14887289.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/who-could-replace-theresa-prime-14887242", "country": "GB", "domain_rank": 21960, "title": "Who could replace Theresa May as Prime Minister? Here are the favourites", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-09T23:00:00.000+03:00", "replies_count": 0, "uuid": "5595832e8fb62199b7032cf641a0a3d6cc7c68ed"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/who-could-replace-theresa-prime-14887242", "ord_in_thread": 0, "title": "Who could replace Theresa May as Prime Minister? Here are the favourites", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Who could replace Theresa May as Prime Minister? Here are the favourites If Theresa May is forced to resign this is who could replace her Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nPrime Minister Theresa May’s government is falling apart.\nForeign Secretary Boris Johnson and Brexit Secretary David Davis have both resigned.\nAnd there’s no obvious way of uniting her party when it comes to Brexit, on which different Tory MPs have very different views.\nIt’s possible Theresa May will carry on as Prime Minister for a while longer.\nBut if she is forced to resign, who will replace her?\nAssuming she quits before the next general election , the next Prime Minister will be another Conservative . That means they will be chosen by Tory MPs and party members.\nOf course, Labour leader Jeremy Corbyn might become Prime Minister before long, if Labour wins the next general election.\nBut it still seems likely that he won’t be Prime Minister immediately after Theresa May.\nPolling company YouGov has been asking Conservatives who they want as their next leader, and here are the results: Sajid Javid Tory Home Secretary Sajid Javid (Image: BBC)\nThe most popular potential replacement for Theresa May is Sajid Javid, the Home Secretary and MP for Bromsgrove.\nYouGov found 62 per cent of party members believed he would make a good leader.\nAged 48, he’s the son of a bus driver from Rochdale.\nMr Javid would be the first Asian Prime Minister and the first Prime Minister from a Muslim backround. Ruth Davidson Scottish Conservative leader Ruth Davidson during a press conference at the Apex Waterloo Hotel in Edinburgh. (Image: PA)\nThe leader of the Scottish Conservative Party is popular with members.\nShe’s a liberal-minded centre-ground Tory who is having a baby with her same-sex partner. In the EU referendum she backed the remain campaign.\nMs Davidson comes across as likeable and more down-to-earth than some Conservatives.\nYouGov found 61 of party members thought she would make a good leader.\nThe problem for the party is that she isn’t actually an MP, and instead is a member of the Scottish Parliament. She’d need to be an MP before she could become Tory leader. Jacob Rees-Mogg Jacob Rees-Mogg (Image: PA)\nBackbench MP Jacob Rees-Mogg has never held a Government job.\nBut he’s extremely influential as chair of the European Research Group, which represents anti-EU Conservative MPs.\nThe Conservative MP has been called the “Honourable Member for the 18th century”, and some of his ideas do seem old-fashioned.\nHe’s got six children, but says he’s never changed a nappy because the family nanny does it instead.\nHe’s embraced Twitter but his first message to followers was in Latin, reading: “Tempora mutantur, et nos mutamur in illis”. It means: “the times change, and we change with them”.\nAnd he once recited a 19th century poem in the House of Commons, somewhat to the annoyance of MPs who were trying to debate animal welfare.\nYouGov found 59 per cent of party members thought he’d make a good leader. Boris Johnson Boris Johnson\nThe former Foreign Secretary would make a good leader according to 47 per cent of Tories.\nBut his role as one of the leaders of the “leave” campaign makes him a divisive figure.\nFor a long time, Conservatives thought Boris could reach the parts of the UK that other Tories could not. People liked him .\nBut he may not be as popular as he used to be. Jeremy Hunt Health Secretary Jeremy Hunt (Image: Getty Images Europe)\nThe new Foreign Secretary, Jeremy Hunt, is popular within the party.\nAnd 49 per cent of members think he would make a good leader.\nBut he oversaw reforms to the NHS that made him very unpopular with some health service workers. Michael Gove\nEnvironment Secretary Michael Gove has been Education Secretary and Justice Secretary.\nHe was a leader of the “leave” campaign in the EU referendum.\nNobody can deny that Mr Gove is smart. In person, he’s extremely likeable. Read More What will Brexit mean for jobs in the North East? MPs are in Brussels to find out Gavin Williamson\nDefence Secretary Gavin Williamson, MP for South Staffordshire, was a vital support for Mrs May in his former role as Chief Whip.\nHowever, he is said to have upset some Conservative MPs. And don’t forget Jeremy Corbyn Labour Party leader Jeremy Corbyn (Image: PA)\nIt seems unlikely that Theresa May will stay on as Prime Minister until the next election.\nBut if she does, the country will face a choice between giving the Tories under her leadership another term in office - or making Labour leader Jeremy Corbyn the next Prime Minister. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-09T23:00:00.000+03:00", "crawled": "2018-07-10T00:19:06.006+03:00", "highlightTitle": ""}