{"organizations": [], "uuid": "ac6da7548e3acbf45e27526560e2a626e61bbcfc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14862165.ece/ALTERNATES/s1200/Food-prices-figures.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-mean-higher-prices-north-14861963", "country": "GB", "domain_rank": 21960, "title": "Brexit will mean higher prices in the North East - and we will be harder hit than London", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-04T07:00:00.000+03:00", "replies_count": 0, "uuid": "ac6da7548e3acbf45e27526560e2a626e61bbcfc"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-mean-higher-prices-north-14861963", "ord_in_thread": 0, "title": "Brexit will mean higher prices in the North East - and we will be harder hit than London", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Could not subscribe, try again later Invalid Email\nPrices will go up in the North East because of Brexit , new research has found.\nThe cost of living could rise by 3% in the region, according policy think-tank IPPR.\nAnd the North will be hit harder than London.\nThat’s because housing costs, which Londoners spend a higher proportion of their income on, won’t be affected much by Brexit.\nHowever the cost of petrol is set to increase. This hits people outside London harder because they are more likely to drive, while people in the capital are more likely to use public transport.\nPrices will rise by 3% in the North East if there is a “hard Brexit” with no new trade deal with the EU, but will rise by 1.5% even if there is a deal.\nThis is on top of the usual impact of inflation each year, which tends to be matched by wage increases for many workers. British Prime Minister Theresa May (Image: REUTERS POOL)\nIPPR senior research fellow and author of the report, Marley Morris, said: “Our findings suggest that post-Brexit price rises will squeeze incomes more in parts of the UK outside London.\n“Limiting these impacts will require a new relationship with the EU that preserves our trade links. Negotiating a ‘shared market’ – based on a customs union and a deal on alignment with the EU’s single market – is the most promising strategy for minimising post-Brexit price increases for households.”\nPrime Minister Theresa May and her Cabinet are to meet at her Chequers country home, in Buckinghamshire, for a Brexit summit on Friday.\nThey will attempt to agree what the UK’s future relationship with the European Union after Brexit should look like. This includes issues relating to customs and trade which have triggered furious rows within the Tory ranks.\nAs rows within the Conservative Party continued, former justice minister Phillip Lee accused Brexiteers of “planning a coup” against Mrs May. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-04T07:00:00.000+03:00", "crawled": "2018-07-04T08:18:47.002+03:00", "highlightTitle": ""}