{"organizations": [], "uuid": "f3ab0362b9ea96ae0863986cc0485a2f3f6c12be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.cornwalllive.com/news/cornwall-news/article398725.ece/ALTERNATES/s1200/Boris-Johnson.png", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/live-updates-boris-johnson-resigns-1765275", "country": "US", "title": "Live updates as Boris Johnson resigns as foreign secretary - Cornwall Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "f3ab0362b9ea96ae0863986cc0485a2f3f6c12be"}, "author": "Richard Booth", "url": "https://www.devonlive.com/news/devon-news/live-updates-boris-johnson-resigns-1765275", "ord_in_thread": 0, "title": "Live updates as Boris Johnson resigns as foreign secretary - Cornwall Live", "locations": [], "entities": {"persons": [{"name": "boris johnson", "sentiment": "none"}, {"name": "priti patel", "sentiment": "none"}, {"name": "julia hartley-brewer", "sentiment": "none"}, {"name": "michael fallon", "sentiment": "none"}, {"name": "benjamin netanya", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}], "locations": [{"name": "israel", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Live updates as Boris Johnson resigns as foreign secretary A Downing Street spokesman confirmed the news today Share Boris Johnson in St Ives Share\nBoris Johnson has resigned as Foreign Secretary as of this afternoon.\nA Downing Street spokesman confirmed the news today: \"This afternoon, the Prime Minister accepted the resignation of Boris Johnson as Foreign Secretary. His replacement will be announced shortly. The Prime Minister thanks Boris for his work.\"\nPrime Minister Theresa May has faced a series of Cabinet members leaving their positions since the snap election last June.\nThe first to leave was defence secretary Sir Michael Fallon, who resigned his post after being caught up in Westminster sleaze allegations.\nHe said his behaviour had \"fallen below the high standards required\" after he admitted putting his hand on the knee of radio presenter Julia Hartley-Brewer some years ago when he resigned on November 1.\nOne week later, Priti Patel quit as international development secretary over undisclosed and unauthorised meetings in Israel, including with prime minister Benjamin Netanyahu.\nIn her resignation letter, she echoed the words of Sir Michael, saying her actions \"fell below the high standards\" expected.\nThe following month, Ms May's deputy Damian Green left the Cabinet after a probe found he made \"inaccurate and misleading\" statements about pornography on his computer.\nJustine Greening was sacked in the PM's reshuffle in January after refusing to move from her education post to the Department for Work and Pensions.\nHome secretary Amber Rudd resigned in April after admitting she had \"inadvertently\" misled MPs over the existence of targets for removing illegal immigrants over the Windrush scandal.\nBrexit secretary David Davis became the latest senior figure to leave when he quit the Government following crunch talks at Chequers.\nFollow live updates below: Theresa May thanks David Davis and Boris Johnson 16:41 15:35 Exeter MP Ben Bradshaw calls for either a fresh General Election or second Brexit vote\nExeter MP Ben Bradshaw says his constituents ‘deserve better’ as he calls for a General Election or a second vote on the terms of a Brexit deal before Britain leaves the EU.\n“The Government is in meltdown and only a fresh general election or a People’s Vote on a Brexit deal, if the Government is capable of getting one, will get us out of this mess.\n“Boris Johnson and his fellow hard Brexiteers are responsible for this chaos, yet, they have never had a plan for Brexit and still don’t.\n“There are so many important issues the Government should be focussed on - the NHS and social care, education, increasing inequality, yet they are wholly absorbed by the Conservative Party’s nervous breakdown on Brexit.\n“Exeter and the country deserve better than this.” 15:31 15:25 What was agreed at Chequers?\nPrime Minister Theresa May came up with what she hoped would be a peace offering for both the Remain and Leave camps.\nIn a bid to solve the Northern Ireland issue, she now wants to keep the UK closely aligned with the EU in a new “free trade area” for goods.\nThis will include sharing a “common rulebook” for all goods including agricultural and food products - which critics had feared would make it harder to get a US trade deal.\nMrs May claimed this will help the UK “avoid friction” in trade - protecting jobs and businesses.\nBut in a desperate bid to prevent Brexiteers resigning, she also said Parliament would keep the right to block future changes to the trading rules.\nThe olive branch to the Brexiteers means Mrs May remains vulnerable - because there is no guarantee the EU will accept her new plan.\nIn a sign of nerves across government, the Cabinet also agreed to “step up” backup plans for a No Deal Brexit. 15:19 Johnson resigns\nBoris Johnson has sensationally resigned as Foreign Secretary, throwing Theresa May’s Government into further turmoil after the departure of David Davis as Brexit Secretary.\nThe resignations of the two Cabinet “big beasts” comes just days after Mrs May secured senior ministers’ agreement at Chequers for a Brexit plan about which both men had expressed reservations.\nMr Davis was first to go, announcing his exit just before midnight on Sunday.\nBut there was growing speculation about Mr Johnson’s plans on Monday after he failed to attend a meeting of the Government’s Cobra emergencies committee as well as a summit of Western Balkan nations being held in London. 15:15 Southgate for PM Boris Johnson gone. David Davis gone. Only one person can now be elected Prime Minister, unite the country and save us all... pic.twitter.com/ZFrN74GkcA — Peter Eastwood (@BarryEastwood10) 9 July 2018 15:15 Reaction on Twitter David Davis gone, Boris Johnson gone, either this is really positive for the PM May or there will be a leadership challenge in days ahead. My guess, the latter. #gbpusd #fx will come under pressure should pro-brexit mount a challenge #fx #sterling #Brexit — Brannigan Barrett (@Trader_Bran) 9 July 2018 More On ", "external_links": [], "published": "2018-07-09T03:00:00.000+03:00", "crawled": "2018-07-09T18:50:48.037+03:00", "highlightTitle": ""}