{"organizations": [], "uuid": "e8d02d837254a4dc0163a67d68b253447d4a6a90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14877574.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-may-brexit-plan-chequers-14877542", "country": "GB", "domain_rank": 21960, "title": "At last: Theresa May reveals her plan for Brexit after crunch talks on Friday", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-06T23:00:00.000+03:00", "replies_count": 0, "uuid": "e8d02d837254a4dc0163a67d68b253447d4a6a90"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-may-brexit-plan-chequers-14877542", "ord_in_thread": 0, "title": "At last: Theresa May reveals her plan for Brexit after crunch talks on Friday", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe United Kingdom will try to agree a new “free trade area” with the European Union, Prime Minister Theresa May has announced.\nBut freedom of movement will end.\nAnd the UK will be free to sign its own trade deals with other countries - an issue that will be on the agenda when US President Donald Trump visits next week.\nThe details were agreed by the Cabinet following talks at Chequers, the Prime Minister’s country residence.\nThe Government’s proposals are likely to upset some supporters of Brexit . Under Mrs May’s plan, the UK will sign a treaty with the EU promising to accept “ongoing harmonisation with EU rules on goods”.\nThis means accepting some EU rules, which the UK will have little or no influence over.\nDowning Street argues that the rules are “relatively stable”, meaning they are unlikely to change much from the existing EU rules which the UK helped to create. They are also backed by employers. Prime Minister Theresa May speaks during a cabinet meeting (Image: PA)\nAnd Parliament would have to bring any new or changed rules into the British legal system, potentially allowing MPs to reject changes if they were willing to risk a row with the EU.\nThere will also be a continued role for the Court of Justice of the European Union, which will be recognised by the UK as the body that interprets EU rules.\nHowever, while the plans are likely to be portrayed as a ‘soft Brexit’, they still involve the UK leaving the Single Market and the EU Customs Union.\nMrs May said: “Now we must all move at pace to negotiate our proposal with the EU to deliver the prosperous and secure future all our people deserve.” A man protests against Brexit outside the Houses of Parliament (Image: Getty Images Europe)\nHere are the key points:\n• UK to leave the European Union on 29 March 2020, but an “implementation period” will continue until the end of 2020\n• The UK and the EU to establish a free trade area for goods\n• But as far as services are concerned, “the UK and the EU will not have current levels of access to each other’s markets”\n• The UK commits by treaty to ongoing harmonisation with EU rules on goods, covering only those necessary to provide for frictionless trade at the border\n• The UK would commit to apply a common rulebook on state aid. (This would probably mean the UK Government was unable to rescue failing businesses)\n• The UK would also guarantee to keep up the current standards for rules regulating protection of the environment, climate change, social and employment, and consumer protection\n• The EU and UK would work together to create a “combined customs territory”. The UK would charge apply the British tariffs on goods intended for the UK, and the EU’s tariffs and trade policy for goods intended for the EU. (It means the UK would effectively collect taxes on behalf of the EU for goods coming into the UK that are due to be exported to the EU)\n• The UK will leave the Common Agricultural Policy and Common Fisheries Policy, taking back control of UK waters as an independent coastal state\n• The UK will be able to sign its own trade deals with other countries. Brexit", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-06T23:00:00.000+03:00", "crawled": "2018-07-06T23:15:40.042+03:00", "highlightTitle": ""}