{"organizations": [], "uuid": "81f3b60a88daf0cae329d08bc7128031fbfb3382", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/business/article1800319.ece/ALTERNATES/s1200/0_TimandHannah.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/wetherspoons-boss-tim-martin-favourite-1798634", "country": "US", "title": "Wetherspoons' boss Tim Martin on his favourite Exeter pubs, the best ‘spoons, students, Brexit and pink gin", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-18T19:14:00.000+03:00", "replies_count": 0, "uuid": "81f3b60a88daf0cae329d08bc7128031fbfb3382"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/wetherspoons-boss-tim-martin-favourite-1798634", "ord_in_thread": 0, "title": "Wetherspoons' boss Tim Martin on his favourite Exeter pubs, the best ‘spoons, students, Brexit and pink gin", "locations": [], "entities": {"persons": [{"name": "tim martin", "sentiment": "none"}, {"name": "wetherspoons", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "george", "sentiment": "none"}, {"name": "wetherspoon", "sentiment": "none"}, {"name": "tim", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "south street", "sentiment": "none"}, {"name": "st leonard", "sentiment": "none"}], "organizations": [{"name": "meeting house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wetherspoons' boss Tim Martin on his favourite Exeter pubs, the best ‘spoons, students, Brexit and pink gin The man behind the Wetherspoon chain chats to us over a, umm, coffee. Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing!\nIs it a sign of the times that when I meet the UK’s most famous publican at his local ‘spoons that we opt for a coffee instead of a lunchtime pint?\nTim Martin, the founder and chairman of the Wetherspoon pub empire, tells me that the brand is not immune from the latest trends and that they now sell about one million cups of coffee every week compared to virtually none 20 years ago.\nTim said: “We are trying hard to stay groovy.\n“I never thought I would see the day when I saw a couple of builders drinking pink gin. I said to them: “I’m not going to say anything about this, your secret is safe with me fellas.”\nGeorge’s Meeting House in South Street is Tim’s local Wetherspoon - he lives just up the road in St Leonard's. Read More This adorable police dog is retiring and needs a new home George's Meeting House, on South Street, Exeter (Image: GoogleMaps)\nAnd he says it is one of his favourite Wetherspoon pubs - referred to as 'spoons by customers - along with many others in Devon that have the JD Wetherspoon name above the door.\nAnd it’s not just a ‘spoons he is partial to.\nHe said: “I like Samuel Jones on the Quay, The Hourglass is a good old fashioned pub with a good atmosphere and you will see me a the bar in the Devon and Exeter Squash Club plus the Nobody Inn in Doddiscombsleigh has been a favourite for a good long time.” Samuel Jones, owned by St Austell Brewery, on Exeter Quay\nHis 895-strong UK portfolio takes in almost every town and city in the UK, including 23 pubs in Devon and two hotels - the White Hart Hotel in Okehampton and Queens Head Hotel in Tavistock. Alan Young, manager of the Panniers Wetherspoons pub and restaurant in Barnstaple (Image: Joel Cooper)\nConfirming that there’s unlikely to be any more opening in Devon, he said that an increase in the number of hotel rooms and bigger gardens for existing outlets, like the recent refurbishment at The Panniers in Barnstaple may be on the cards along with the new hotel plans for Ilfracombe . This is how the proposed Wetherspoons hotel in Ilfracombe would look\nJD Wetherspoon enjoyed a boost in profits last year, with operating profit up nearly 14 per cent and profit before tax up more than 20 per cent. Tim Martin, founder and chairman of JD Wetherspoon at George's Meeting House, Exeter\nThe pub chain saw its revenue increase by 3.6 per cent to £830.4million and its like-for-like sales increase by 6 per cent. Read More King Billy has closed\nBy keeping the prices below your average boozer, it is no surprise that the FTSE 250 firm is buoyant.\nBut it is not immune to the overall pressures of the pub trade all too evident with the loss of the King Billy in Longbrook Street and the demolition of the Honiton Inn to make way for student accommodation.\nWetherspoon itself opened three pubs last year but closed 12.\nIf Wetherspoon can serve drinks for less than your average boozer, does that heap on additional pressure?\nTim said: “Wetherspoon accounts for less than 10% of the pub market in all towns and cities. The majority of people will chose to go elsewhere and that’s fine, “ he said. The Jolie Brise Wetherspoons pub in Teignmouth (Image: TripAdvisor)\nAnd he has been a long time campaigner for the business rate and VAT tax burden for supermarkets and pubs to be the same.\nAccording to a 2016 report in the pub trade publication, the Morning Advertiser , based on an average selling price of a pint in the supermarket of £1, excluding VAT, supermarkets are paying business rates of about 2p per pint.\nBut pubs are assessed for business rates at about 12% of sales. It means that if a pub pint costs an average £3.60, pubs are paying about 18p per pint in business rates.\nTim said: “Pubs have been punished with unfair taxes and that has driven the price differentiation between pubs and supermarkets which has resulted in too many pub closures. The Powder Monkey pub in Exmouth\n“Many might have closed down anyway but it is putting off people going out for a pint which is a sad thing. Pubs are part of our culture.”\nBut the culture is changing. A report last year on the spending habits of millennials showed that they were far more likely to head to the gym rather than go down the pub. Read More\nAnd with cheaper booze available at the supermarkets, they are more likely to drink at home before heading out for the night. The Imperial JD Wetherspoon\nTim agrees, calling on experience with his own son, who when aged about 18, was playing computer games with his friends with a box of beers from the supermarket.\n“I remember saying to him, why don’t you f* off down the pub?”\nLast week, it emerged that student accommodation in Exeter was double the population of Cranbrook - something that Tim says is a good thing for the community.\nHe said: “Universities are very helpful for preserving a town or city culture in the long run as they attract a lot of business and they create a vibe. I’m in favour of universities and I would rather build too much than not enough student housing. Read More The top five reasons why Exeter's posh pubs and bars seem to be struggling\n“Once it’s build, it could be changed to accommodate whoever it needs to. It’s more important to build accommodation rather than worrying about who it’s for.”\nTim is not frightened of weighing in on contentious subjects. A fervent Brexiteer , he has become a familiar face in the media, poo-pooing those who say the UK will crumble outside of the EU.\nHe has even printed the Wetherspoon manifesto on 500,000 beer mats in all his pubs calling for the UK to unilaterally grant rights of citizenship to legal EU immigrants; end tax on food imports from outside the EU and stop paying the EU £200 million per week.\nWatch as we test the new takeaway pizza service at Panniers in Barnstaple Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nBut aside from the Brexit issues - does he have any thoughts on how the process has been executed and whether there will be a leadership bid in May’s shaky government?\nHe said:”I wish it would have been Boris. He is a Brexiteer, he was twice voted for London Mayor and he has been an editor of a magazine which is a tough job in these times. I would have gone for Boris because I think it needs a leader. I think that Theresa May may be a good peace time leader but this is not peace.”\nTim said that the best piece of advice he has ever been given in business boils down to one word, ‘listen’.\n“You have to listen to be able to modify a good idea or eradicate a stupid idea.\n“The biggest danger is ego, if you have always got to be right. What Tim Martin orders off the menu at Wetherspoon\nFor breakfast\nI like a breakfast wrap though I’m told there’s too many calories but it is gorgeous.\nI’ll probably have eggs benedict instead\nFor lunch\nI’m told it’s healthy, so it will be a jacket potato with tuna\nFor dinner\nIt’s got to be fish and chips.\n\"That might not work if you’re Bill Gates creating the software for a PC but if you are running a pub, they require modification and you have to have a small ego.”\nHe said that success has come through a mix of both confidence and insecurity - on one hand having the courage of conviction with self-doubt fuelling a drive ever on.\nIs that why he famously named his pub chain after a teacher who said he would never amount to much?\n“That’s a myth, but it has lasted because it is such a good story!’ he admits.\nActually, it was named for a teacher who could not command a class during his schooldays in New Zealand.\nBut perhaps Tim was too difficult to command.\nHe said: “I was mostly bolshy but in the end I worked quite hard. I ran away from school once, I was sent to boarding school when I was 13 and I hitch hiked home and got there before my old man.\n“Having a bolshy and questioning attitude can be a plus, if you get advice from a lawyer who says ‘you can’t do that’ you don’t say ‘OK’ and that’s it. It might be helpful to say ‘I don’t believe that’, that can make me sound like an extremely arrogant person but you have to question things.” Like us on Facebook", "external_links": ["https://www.morningadvertiser.co.uk/Article/2016/11/22/Tim-Martin-on-taxes-and-supermarkets", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-18T19:14:00.000+03:00", "crawled": "2018-07-18T19:23:13.022+03:00", "highlightTitle": ""}