{"organizations": [], "uuid": "d1bc6281cf5e222c6c3b730c3f5d7fa7ed5fade7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/sport/football/article1571923.ece/ALTERNATES/s1200/Gary-Lineker-3.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/leicester-news/leicesters-gary-lineker-calls-second-1828011", "country": "GB", "domain_rank": 48128, "title": "Leicester's Gary Lineker calls for second Brexit referendum after returning from World Cup - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "d1bc6281cf5e222c6c3b730c3f5d7fa7ed5fade7"}, "author": "Katrina Chilver", "url": "https://www.leicestermercury.co.uk/news/leicester-news/leicesters-gary-lineker-calls-second-1828011", "ord_in_thread": 0, "title": "Leicester's Gary Lineker calls for second Brexit referendum after returning from World Cup - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "gary lineker", "sentiment": "negative"}, {"name": "anthony", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "invalid email leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "leicestershire live leicester", "sentiment": "negative"}, {"name": "bbc", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "leicester city", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leicester's Gary Lineker calls for second Brexit referendum after returning from World Cup BBC pundit says: \"I find the whole thing more bewildering and worrying than ever\" Share Gary Lineker (Image: Anthony Harvey/AFP/Getty Images) Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nLeicester lad and football pundit Gary Lineker has said there should be a 'people's vote' on the final Brexit deal.\nThe former Leicester City player , who grew up in Leicester, has called for a second referendum.\nHe has accused Theresa May of being “unable to resolve” the “mess” the UK is in as it prepares to exit the EU.\nAnd he backed campaigners who have demanded millions of Brits get a say on the final deal, the Mirror reports .\nThe 57-year-old ex-footballer said: “I spent most of the last few weeks totally focused on a fantastic World Cup.\n\"But it was impossible to avoid what was happening in the Brexit debate back home.\n“Now I’m back I find the whole thing more bewildering and worrying than ever.\n\"Whether you voted Leave or Remain, did anyone really vote for the mess we seem to be in, let alone the prospect of no deal with all the terrible consequences attached to that. Read More Why India still loves doing business\n“There are some things in life that, even for someone like me, are more important than football. This is one of them.\n“I am not a politician but I know when something is going wrong and right now Brexit feels like it is going very wrong indeed.\n“The politicians seem unable to resolve the problem the people gave them in voting to Leave.\n\"That is why I think there should be a People’s Vote on the final deal, and why I am sending best wishes and good luck to the campaigners who will be stepping up the pressure over the summer.”\nMeanwhile, Theresa May has insisted the British public should take “comfort” from the fact the government is stockpiling blood and food in preparation for a no deal Brexit. The UK is negotiating Brexit terms with the European Union (Image: Stefan Rousseau/PA Wire)\nThe Prime Minister said her government was doing the “responsible” and “sensible” thing and not trying to alarm people.\nHealth Secretary Matt Hancock has told MPs his department is working with industry “for the potential need for stockpiling in the event of a no-deal Brexit”.\nHe added: “This includes the chain of medical supplies, vaccines, medical devices, clinical consumables, blood products.”\nAnd Brexit Secretary Dominic Raab has said he is working to “make sure that there’s adequate food supplies” should the UK depart the EU without a deal.\nSee how Leicestershire Live readers voted in our poll on Brexit 2.0 here. Like us on Facebook ", "external_links": [], "published": "2018-07-26T03:00:00.000+03:00", "crawled": "2018-07-26T18:23:15.015+03:00", "highlightTitle": ""}