{"organizations": [], "uuid": "ec0d05138f1db3c819aa4fca29a818f75c9a42d8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1841368.ece/ALTERNATES/s1200/0_chips-potatoes-1418192_1280.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/whats-on/food-drink/cheese-onion-crisp-shortage-thanks-1841363", "country": "GB", "title": "Cheese and onion crisp shortage thanks to weather and Brexit", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-30T15:26:00.000+03:00", "replies_count": 0, "uuid": "ec0d05138f1db3c819aa4fca29a818f75c9a42d8"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/whats-on/food-drink/cheese-onion-crisp-shortage-thanks-1841363", "ord_in_thread": 0, "title": "Cheese and onion crisp shortage thanks to weather and Brexit", "locations": [], "entities": {"persons": [{"name": "neil shaw", "sentiment": "none"}], "locations": [{"name": "brexit cheese", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "invalid email britain", "sentiment": "none"}], "organizations": [{"name": "digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cheese and onion crisp shortage thanks to weather and Brexit Panic buy! Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 13:26, 30 JUL 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nBritain looks set to run out of cheese and onion crisps - the nation's favourite flavour - thanks to the weather and Brexit.\nA cold, wet winter with the Beast from the East blanketing Devon in snow, followed by the long, dry heat wave means there are fewer potatoes and onions than are needed for a good supply of crisps.\nThose that are growing are much smaller than usual, reports The Mirror . Growers fear weather of the next few weeks - whether than it sun, floods or hail, could further damage crops.\nAt the same time Walkers and other crisp manufacturers are preparing for a national cheses shortage in the event of a no-deal or hard Brexit. Read More UK faces 'crisp crisis' as potato crops wrecked by blistering heatwave\nTim Elcombe, chairman of British Onions, said: “We are entering unprecedented territory. We need rain but the ground is now so hard, the danger is a heavy deluge will just run off the top and hailstones could further damage the crop.”\nThe farming struggle could also see the prices of vegetables rise in the near future and many shops may be forced to import their stock from abroad.\nPeople took to social media to share their outrage at the prospect of losing cheese and onion crisps - which were voted the nation's favourite flavour in a recent study by YouGov .\nOne person said: \"I opened the news. I am in despair. Now there is a threat to cheese and onion crisps. I can't even.\" Read More How to make sure you picnic like a boss this summer - the key tips you will have forgotten\nAnother person wrote: \"What am I meant to do when I got to the pub for a pint and a packet of cheese and onion crisps?\"\nA third planned to stock up on the snack while it was still available. Others merely criticised people blaming Brexit.\n\"What next, we will run out of air due to Brexit,\" asked one person. \"Why is it nearly everything comes back to Brexit,\" said another. Like us on Facebook ", "external_links": ["https://www.mirror.co.uk/news/uk-news/cheese-onion-crisps-under-threat-13002993", "http://yougov.co.uk/news/2014/08/30/generation-ready-salted/?utm_source=website_article&utm_medium=twitter&utm_campaign=crisp_flavours", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-30T15:26:00.000+03:00", "crawled": "2018-07-30T16:30:06.006+03:00", "highlightTitle": ""}