{"organizations": [], "uuid": "ac65e95c6204b1f0d658ab6d1a41062dea819df3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14890093.ece/ALTERNATES/s1200/The-NFUs-new-regional-director-for-the-North-East-Adam-Bedford.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/farming/confidence-among-north-east-farmers-14889897", "country": "GB", "domain_rank": 21960, "title": "Confidence among North East farmers set to plummet on Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-10T15:56:00.000+03:00", "replies_count": 0, "uuid": "ac65e95c6204b1f0d658ab6d1a41062dea819df3"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/farming/confidence-among-north-east-farmers-14889897", "ord_in_thread": 0, "title": "Confidence among North East farmers set to plummet on Brexit", "locations": [], "entities": {"persons": [{"name": "adam bedford", "sentiment": "none"}], "locations": [{"name": "brexit farmers", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "yorkshire", "sentiment": "none"}, {"name": "nfu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Confidence among North East farmers set to plummet on Brexit Farmers in the region highlight concerns over future agricultural policy and the ability to sell food overseas Share Adam Bedford (Image: Publicity Pic)\nConfidence among farmers in the North East is set to plummet when the UK leaves the EU , a new survey suggests.\nThe survey by the NFU across the whole of North East and Yorkshire shows that while 64% of farmers are very or fairly positive about their business prospects now, this drops to just 23% after Brexit.\nRespondents highlighted a lack of clarity over a future domestic agriculture policy as a major cause for concern, along with future trading regimes and the inability to plan for the future.\nNFU regional director Adam Bedford said the aim of the poll was to take a snapshot ahead of Brexit to see how the local farming industry is faring, how it is preparing for change, and how farming organisations can help ensure the most positive business prospects going forward.\nHe said: “It is good news for the North East that current farm business confidence is still buoyant and it is perhaps not surprising, given the uncertainty surrounding Brexit , that confidence takes a knock as things progress.\n“But we are very concerned that beyond next year the number of farmers with a positive outlook drops to less than a quarter of respondents.” Read More Newcastle's Grown Urban plans to turn abandoned buildings into urban farms\nThe survey asked farmers whether they have changed anything to make their business more resilient ahead of Brexit. 37% of respondents have taken steps and of those, 28% have diversified their business, 19% have worked to reduce their costs or debt and 19% have invested in machinery, automation or renewables.\nA further 19% have reduced their reliance on labour or changed their recruitment strategy.\nAsked what could be done to support farm businesses after EU, respondents highlighted financial incentives and the need to spend more on R&D in the agricultural sector.\nMr Bedford said: “It is encouraging to see a proportion of our farming and agri-food businesses taking steps to make themselves more resilient in the face of change. But the point was made by most that continued uncertainty is a real stumbling block to effective decision making. Read More Next bosses urged to keep Gateshead store open as closure date confirmed\n“This is something we are raising with increased urgency in Westminster as well as stressing the importance of getting the right framework to encourage business confidence particularly during the transition period.\n“Current productivity grants delivered through the Rural Development Programme for England (RDPE), whilst beset with problems such as launch delays and a recognised underspend, are now starting to deliver benefits for farm businesses.\n“We would like to see these schemes continued through the transition to help support micro and small businesses, farm diversifications and to boost farm productivity. The design of any new measures for the future must encourage uptake and confidence across the industry if they are to be effective.” Read More The Naked Deli kicks off expansion with cafe at Newcastle Airport\nThe NFU survey also looked at the importance of retaining access to export markets, with 53% of respondents supplying produce destined for overseas sales. Of those farmers producing for export markets, 93% said those markets were either very or fairly important to their business.\n“This paints a very clear picture of an agri-food sector ready and able to supply export markets, generating wealth and jobs for the regional economy in the process,” said Mr Bedford. “With business confidence dropping significantly as we head into Brexit, this must be a clear signal to government of the potential damage to our economy of continued uncertainty for our farming and agri-food business communities.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-10T15:56:00.000+03:00", "crawled": "2018-07-11T06:17:26.004+03:00", "highlightTitle": ""}