{"organizations": [], "uuid": "f7eb175e1bc10463bb692657cf7787bcfa2ebe5a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14859205.ece/ALTERNATES/s1200/Political-Leaders-Attend-The-June-2018-EU-Council-Meeting-Day-One.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/businesses-running-out-patience-government-14859136", "country": "GB", "domain_rank": 21960, "title": "Businesses are 'running out of patience' with Government over Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-03T13:44:00.000+03:00", "replies_count": 0, "uuid": "f7eb175e1bc10463bb692657cf7787bcfa2ebe5a"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/businesses-running-out-patience-government-14859136", "ord_in_thread": 0, "title": "Businesses are 'running out of patience' with Government over Brexit", "locations": [], "entities": {"persons": [{"name": "jeremy hunt", "sentiment": "none"}, {"name": "liam fox", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}], "organizations": [{"name": "brexit businesses", "sentiment": "negative"}, {"name": "brexit british chambers of commerce", "sentiment": "negative"}, {"name": "airbus", "sentiment": "none"}, {"name": "bcc", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}, {"name": "chambers of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Businesses are 'running out of patience' with Government over Brexit British Chambers of Commerce list 24 areas of concern that companies have with the Brexit process Share Prime Minister Theresa May arrives at the Council of the European Union (Image: Getty Images Europe)\nFirms are running out of patience over the lack of progress in the Brexit talks, a major business organisation has warned Theresa May.\nThe British Chambers of Commerce said companies still face uncertainty over tax, tariffs, customs and regulation, with time running out ahead of the the March 29, 2019 Brexit date.\nCabinet ministers were urged to “stop squabbling” and put the nation’s economic interests first in reaching agreement at the crunch Chequers meeting on Friday as business patience reaches “breaking point”.\nThe BCC’s intervention comes after warnings from firms including Airbus and BMW about Brexit were dismissed by Cabinet ministers including Jeremy Hunt and Liam Fox, while Boris Johnson reportedly said “F*** business” when asked about industry concerns.\nThe group listed 24 main concerns, and gave a red rating to all but two - which received an amber grade on the traffic-light scale.\nBCC director-general Adam Marshall said: “Over the past two years, businesses have been patient. We have supported the Government’s drive to seek the best possible deal for the UK economy.\n“We have given time, expertise and real-world experience to support hard-pressed Civil Service negotiators. We have convened all across the UK to ensure that every business community’s Brexit concerns can be heard by elected representatives and officials.\n“Now, with the time running out ahead of the UK’s exit from the EU , business patience is reaching breaking point.\n“Businesses have every right to speak out when it is abundantly clear that the practical questions affecting the competitiveness of their firms and the livelihoods of millions of people remain unanswered.\n“With less than nine months go to until Brexit day, we are little closer to the answers businesses need than we were the day after the referendum.\n“It’s time for politicians to stop the squabbling and the Westminster point-scoring - and start putting the national economic interest first.\n“These are not ‘siren voices’ or special interests. They are the practical, real-world concerns of businesses of every size and sector, in every part of the UK.”\nThe BCC said the uncertainty was causing a “significant slowdown” in business investment, with many firms making contingency plans or considering alternatives to sinking cash into the UK.\nOf the 24 concerns raised by the BCC, only the issues of access to the EU workforce and industrial standards received amber ratings.\nRed ratings were given to issues including customs, tariffs, VAT, aviation and the Irish border.\nA Government spokesman said ministers remain confident of securing a good deal with the EU, ensuring trade would remain “as free and frictionless as possible”.\n“Ministers continue to work closely with business to understand their concerns and by successfully negotiating the implementation period with the EU until December 2020, companies can carry on trading with confidence on the same terms as they do now,” the spokesman said.\nThe BCC’s intervention comes a week after the North East England Chamber of Commerce said that businesses in the region were “exasperated” at the Government’s lack of planning on Brexit. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-03T13:44:00.000+03:00", "crawled": "2018-07-04T01:29:40.000+03:00", "highlightTitle": ""}