{"organizations": [], "uuid": "25b4eb2d27dd88f5736de927ddc8ba44b990fde7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14936513.ece/ALTERNATES/s1200/0_British-Prime-Minister-Theresa-May-Visits-Northern-Ireland.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-may-cabinet-newcastle-north-14936170", "country": "GB", "domain_rank": 21960, "title": "This is what to expect when Theresa May brings her Cabinet to the North East on Monday", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-22T07:00:00.000+03:00", "replies_count": 0, "uuid": "25b4eb2d27dd88f5736de927ddc8ba44b990fde7"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-may-cabinet-newcastle-north-14936170", "ord_in_thread": 0, "title": "This is what to expect when Theresa May brings her Cabinet to the North East on Monday", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "cabi", "sentiment": "neutral"}, {"name": "michael gove", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "more department for transport", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News This is what to expect when Theresa May brings her Cabinet to the North East on Monday The Cabinet is having a special meeting in the North East to coincide with the Great Exhibition of the North Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nCabinet Ministers will visit towns, cities and villages across the North East on Monday, after taking part in a special meeting of the Cabinet.\nPrime Minister Theresa May is bringing her Cabinet to the region for a special meeting to tie in with the Great Exhibition of the North, taking place in Newcastle and Gateshead .\nEconomic growth, skills and export strategy are expected to be on the agenda. Read More Department for Transport consider cutting rail services to Northumberland\nThis will be followed by a series of individual visits by top members of the Government to different parts of the region.\nConservative sources say the aim is “to take the temperature of the communities there and get a better understanding of what’s happening”.\nFor example, Environment Secretary Michael Gove is to visit Northumberland National Park.\nMrs May is expected to use the visit to make announce new Government investment in the North East.\nThe Cabinet usually meets in 10 Downing Street. British Prime Minister Theresa May (Image: Getty Images Europe)\nConservative MP Guy Opperman, who represents Hexham, said: “It is a very significant step that the Prime Minister is bringing her Cabinet to the North.\n“Post-Brexit there is an acceptance that we need to find the buccaneering spirit that is evident in so many of the creations you see at the Great Exhibition of the North .\n“It’s fantastic that she and her colleagues are coming and seeing that so much of what makes Britain great is created in the North, and a lot of it specifically in the North East.”\nThe Government insists it remains committed to the idea of creating a ‘Northern Powerhouse’, and the Government-backed Great Exhibition of the North is one high profile example.\nOther projects are less colourful, but Ministers say designed to boost the economy of the North. Read More Farming industry\nFor example, earlier this month the Government published a report setting out how businesses in the North could do business with Latin American countries.\nAnd while Monday’s Cabinet meeting will be the Prime Minister’s first visit to the Great Exhibition of the North, other Government ministers have already made the trip.\nFor example, the Government sponsored a business summit earlier this month, held at the NewcastleGateshead Convention Bureau in Gateshead, attended by Business Secretary Greg Clark.\nThere is also a mayor for Tees Valley, with some control over funding for skills and transport. Confetti rains down on visitors in front of the Tyne Bridge during the opening ceremony of the Great Exhibition of the North (Image: Getty Images Europe)\nAnd the Government is backing plans for a new combined authority and mayor to serve the 815,000 people living in Newcastle, North Tyneside and Northumberland.\nOnce elected in May 2019, they will have some control over housing, planning and skills - and £600m to invest in the region, albeit over 30 years.\nThe Government says the deal will boost the local economy by £1.1bn, creating 10,000 new jobs and attracting £2.1bn in private investment. Read More Chief whip Julian Smith faces calls to resign over claims he told MPs to break 'pairing' agreement\nHowever the key to the Northern Powerhouse is a massive rail project called Northern Powerhouse Rail, overseen by Transport for the North.\nGeorge Osborne’s original vision for the Northern Powerhouse was to bring the major cities of the North together, so that in effect they behaved like one giant city.\nThat’s because economists believe there are benefits to being bigger. Having more people to sell to, buy from and employ is good for business.\nNorthern Powerhouse Rail is designed to link the North’s six major city regions, Newcastle, Sheffield, Hull, Leeds, Manchester and Liverpool, as well as Manchester Airport, with rapid, frequent and reliable rail services.\nThere will be brand new rail lines and improvements to existing rail track, and the whole thing will connect to the HS2 high speed rail network currently planned.\nBut even assuming everything goes to plan, it might be 30 years before the whole thing is completed. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-22T07:00:00.000+03:00", "crawled": "2018-07-22T08:22:20.004+03:00", "highlightTitle": ""}