{"organizations": [], "uuid": "7488e5244b44c9792adf47a8dbe8dd48df0ef013", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1817735.ece/ALTERNATES/s1200/0_Secretary-of-State-Esther-McVey-visits-EMA.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/local-news/esther-mcvey-confident-east-midlands-1817723", "country": "GB", "domain_rank": 48128, "title": "Esther McVey confident about East Midlands Airport growth despite Brexit uncertainty - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-23T03:00:00.000+03:00", "replies_count": 0, "uuid": "7488e5244b44c9792adf47a8dbe8dd48df0ef013"}, "author": "Dan Martin", "url": "https://www.leicestermercury.co.uk/news/local-news/esther-mcvey-confident-east-midlands-1817723", "ord_in_thread": 0, "title": "Esther McVey confident about East Midlands Airport growth despite Brexit uncertainty - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "esther mcvey", "sentiment": "negative"}, {"name": "alistair langham", "sentiment": "none"}, {"name": "karen smart", "sentiment": "none"}], "locations": [{"name": "east midlands airport", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Esther McVey confident about East Midlands Airport growth despite Brexit uncertainty The Work and Pensions Secretary highlighted 8,000 planed new posts during a visit to EMA Share Secretary of State Esther McVey with Airport managing director Karen Smart (Image: Alistair Langham - The Studio 17) Share Get Daily Thank you for subscribing! Could\nSome 8,000 jobs are set to be created at East Midlands Airport over the next five years.\nAirport officials say their plans will double the number of people working in and around the Castle Donington-based cargo hub in roles from freight handling to retail, hospitality, logistics, airport security and as car park assistants.\nToday Work and Pensions Secretary of State Esther McVey visited a training academy at the airport and spoke of its potential to grow post-Brexit.\nSome senior figures at the airport have previously expressed concerns that UK and European Union may fail to reach a final Brexit deal resulting in harm to the national and regional economy.\nHowever Ms McVey pointed to the recent successes around the airport.\nWhen asked if the planned airport jobs would be secure whatever the outcome of Brexit negotiations she said: “Let's be honest, businesses have been planning for Brexit for two years. Secretary of State, Esther McVey with Airport MD Karen Smart and Neil Robinson, group Director for CSR on her visit to East Midlands Airport (Image: Alistair Langham - The Studio 17)\n\"We had Project Fear and the scare stories.\n“We were told 500,000 jobs would be lost after the referendum. It hasn't happened.\n\"We were told the economy would dip. it hasn't happened.\n“East Midlands Airport is one of the places that has been doing really well.\n“The amount cargo it handles up went almost 10 per cent up on last year.\n“The value of non-EU goods handled at the airport are £9.935 billion a year.\n“Here they want to double the number of jobs. Read More", "external_links": [], "published": "2018-07-23T03:00:00.000+03:00", "crawled": "2018-07-24T01:02:19.016+03:00", "highlightTitle": ""}