{"organizations": [], "uuid": "45721fb2fb67d6279d70cfe30d6930719b138298", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14940626.ece/ALTERNATES/s1200/0_BESTPIX-British-Prime-Minister-Theresa-May-Visits-Northern-Ireland.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-cabinet-north-east-14940362", "country": "GB", "domain_rank": 21960, "title": "Theresa May's cabinet are in the North East - but how Northern are they?", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-23T13:00:00.000+03:00", "replies_count": 0, "uuid": "45721fb2fb67d6279d70cfe30d6930719b138298"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-cabinet-north-east-14940362", "ord_in_thread": 0, "title": "Theresa May's cabinet are in the North East - but how Northern are they?", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "neutral"}, {"name": "greg clark", "sentiment": "none"}, {"name": "chester", "sentiment": "none"}, {"name": "gavin williamson", "sentiment": "none"}, {"name": "sajid javid", "sentiment": "none"}, {"name": "scarbrough", "sentiment": "none"}, {"name": "matthew hancock", "sentiment": "none"}, {"name": "esther mcvery", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "rochdale", "sentiment": "none"}, {"name": "middlesbrough", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "getty images europe", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing!\nTheresa May has brought her cabinet to the North East for a little outing - but do they really have any Northern credentials?\nMonday’s visit by the Prime Minister and her team is supposed to tie in with the Great Exhibition of the North, a summer-long celebration of what the region has to offer.\nBut it’s fair to say England’s upper reaches aren’t particularly well represented around the cabinet table.\nOf the 29 ministers attending cabinet, just two were born in the region and only five represent constituencies in the North. Prime Minister Theresa May (Image: Getty Images Europe)\nThe only MP with an immediate link to the North East is Greg Clark, the business secretary, who was born in Middlesbrough.\nAfter that, the closest is Gavin Williamson, the defence secretary, who was born in Scarbrough.\nHome Secretary Sajid Javid, Health Secretary Matthew Hancock and Secretary of State for Work and Pension Esther McVery were born in Rochdale, Chester and Liverpool respectively.\nOf the constituencies represented by those in the cabinet, the nearest to the North East is Skipton and Ripon. Business Secretary Greg Clark (Image: Getty Images Europe)\nThat’s held by chief whip Julian Smith who, at time of writing, is still in a job but has faced calls to resign in recent days. Read More This is what to expect when Theresa May brings her Cabinet to the North East on Monday\nHe’s been embroiled in controversy over whether or not he told another minister to vote in a crunch Brexit vote, despite the fact an agreement was in place for him to abstain and balance out new-mum Jo Swinson’s absence.\nThe only other is Esther McVey’s seat, Tatton in Cheshire, which she won after George Osborne resigned to become editor of the London Evening Standard. Home Secretary Sajid Javid (Image: PA)\nIn terms of the very top level of Government , Home Secretary Sajid Javid is the only one with any link to the region and the rest are dominated by the South.\nEvery other holder of a ‘great office of state’ - the Prime Minister, the Foreign Secretary and the Chancellor - represents a seat in the home counties.\nFour cabinet ministers hail from further north: Liam Fox, Michael Gove, David Mundell and Julian Smith were all born in Scotland. Read More Parliamentary logjam could derail North of Tyne devolution, Newcastle leader warns\nMichael Gove spent some time living in Newcastle when he was training to be a journalist on a course based in Thomson House, the same building which used to house The Chronicle, The Journal and The Sunday Sun.\nBut beyond that tenuous link, few cabinet ministers will be heading ‘home’ when they visit the North East today. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-23T13:00:00.000+03:00", "crawled": "2018-07-23T13:19:05.013+03:00", "highlightTitle": ""}