{"organizations": [], "uuid": "4833b55b75e68c428a0017f76d96cf5d50a13c9f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14884388.ece/ALTERNATES/s1200/Political-Leaders-Attend-The-June-2018-EU-Council-Meeting-Day-One.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/what-brexit-mean-jobs-north-14884230", "country": "GB", "domain_rank": 21960, "title": "What will Brexit mean for jobs in the North East? MPs are in Brussels to find out", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-09T15:05:00.000+03:00", "replies_count": 0, "uuid": "4833b55b75e68c428a0017f76d96cf5d50a13c9f"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/what-brexit-mean-jobs-north-14884230", "ord_in_thread": 0, "title": "What will Brexit mean for jobs in the North East? MPs are in Brussels to find out", "locations": [], "entities": {"persons": [{"name": "anna turley", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "sharon hodgson", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "paul williams", "sentiment": "none"}, {"name": "bridget phillipson", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "houghton", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "sunderland west", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "redcar", "sentiment": "none"}, {"name": "sunderland south", "sentiment": "none"}, {"name": "stockton south", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News What will Brexit mean for jobs in the North East? MPs are in Brussels to find out The trip to the EU headquarters comes as the Government's Brexit policy is in chaos with the resignation of David Davis Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing!\nNorth East MPs have been to Brussels, headquarters of the European Union, to discuss how jobs in the region can be protected after Brexit.\nIt came as the Government’s strategy was in chaos following the resignation of former Brexit Secretary David Davis.\nNewcastle North MP Catherine McKinnell said: “I am in Brussels today with colleagues to make the case for what the North East needs from Brexit, as I am not prepared to sit back and let the Government fail to do it for us.”\nOther MPs on the visit included Washington and Sunderland West MP Sharon Hodgson, Houghton and Sunderland South MP Bridget Phillipson, Stockton South MP Paul Williams and Redcar MP Anna Turley.\nThere have been a series of warnings about the impact Brexit could have on the North East.\nA Government analysis leaked in February found the North East economy will suffer massive damage as a result of Brexit and shrink by 11% even if there is a comprehensive trade deal. A woman polishes a flag pole at the Council of the European Union on the first day of the European Council leaders' summit on June 28, 2018 in Brussels, Belgium (Image: Getty Images Europe)\nIf we leave the EU without a deal then GDP in the region will be hit by 16%.\nNissan chief executive Carlos Ghosn said in June that the firm was unable to make decisions about investment in the Sunderland factory because it is “in the dark” over how Brexit will turn out.\nAnd James Ramsbotham, chief executive of the North East England Chamber of Commerce, wrote to Theresa May to warn that poor progress on Brexit negotiations was causing huge frustration and potential damage to businesses in the North East.\nMs McKinnell said: “Leaving the EU is the single most important and complex moment in the UK’s history since the Second World War, but the Government’s handling of this entire process has been absolutely shambolic since the referendum result was declared.\n“It’s been evident for quite some time now that this situation has been driven by people clearly not up to the task, despite hundreds of thousands of British jobs and livelihoods being on the line. David Davis’ resignation is yet another example of this.’\n“The Government’s own analysis shows the North East has the most to lose from Brexit, but it remains totally unclear what case ministers - particularly David Davis - have been making on our behalf.” Read More\nThe Brexit deal agreed by the Cabinet last week has been broadly welcomed by employers.\nThey will be included in a White Paper to be published by the Government this week.\nCarolyn Fairbairn, CBI Director-General, said: “Proposals unveiled last week gave a genuine confidence boost to businesses struggling with uncertainty, yet the devil will be in the detail. The White Paper therefore needs to deliver confidence for the UK’s world-leading services sector, as well as goods.\n“Meanwhile, Europe’s leaders must approach the UK’s proposals with an open mind and flexibility, putting jobs and economic growth at the heart of a future deal that delivers for both sides.”\nUnder the Government’s plans, the UK will try to agree a new “free trade area” with the EU. Read More\nFreedom of movement will end, but there will be “a mobility framework so that UK and EU citizens can continue to travel to each other’s territories, and apply for study and work”.\nAnd the UK will be free to sign its own trade deals with other countries.\nUnder Mrs May’s plan, the UK will sign a treaty with the EU promising to accept “ongoing harmonisation with EU rules on goods”.\nThere will also be a continued role for the Court of Justice of the European Union, which will be recognised by the UK as the body that interprets EU rules. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-09T15:05:00.000+03:00", "crawled": "2018-07-09T15:51:50.008+03:00", "highlightTitle": ""}