{"organizations": [], "uuid": "afbcf09c73e49b1857c4b7acc7a93727c6f05d2d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13187774.ece/ALTERNATES/s1200/2016-Labour-Party-Conference-Liverpool.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/were-ready-take-over-brexit-14891519", "country": "GB", "domain_rank": 21960, "title": "We're ready to take over Brexit talks right now, says Labour chair", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-11T10:00:00.000+03:00", "replies_count": 0, "uuid": "afbcf09c73e49b1857c4b7acc7a93727c6f05d2d"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/were-ready-take-over-brexit-14891519", "ord_in_thread": 0, "title": "We're ready to take over Brexit talks right now, says Labour chair", "locations": [], "entities": {"persons": [{"name": "ian lavery", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "david davis", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "invalid email labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News We're ready to take over Brexit talks right now, says Labour chair Labour Chair Ian Lavery says his party is respected across Europe while Theresa May is a laughing stock Share Ian Lavery (Image: Daily Mirror) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nLabour says it is ready to take over Brexit negotiations immediately - and would do a better job than the Tories because they have become a “laughing stock” across Europe.\nIan Lavery, the party chair, said Labour would succeed in getting a good deal for the UK because it was respected by foreign leaders.\nHe spoke after US President Donald Trump declared that the UK was in “turmoil” following the resignations of former Foreign Secretary Boris Johnson and former Brexit Secretary David Davis.\nTheresa May’s Cabinet last week agreed proposals for a Brexit deal which would involve creating a free trade area with the UK for goods, but not for services.\nIt would also create complex customs arrangements designed to allow the UK to import and export goods without delays, while still being free to sign its own trade deals.\nBut the proposal was condemned by Mr Johnson, who said in his resignation letter that it would make the UK a “colony” of the EU. Ian Lavery (Image: Daily Mirror)\nPro-Brexit Conservative MPs are furious that the planned deal would mean the UK continues to obey some EU rules, while around 20 Tory supporters of a “soft” Brexit are pushing for the UK to remain full members of the EU’s Customs Union.\nWhile this is going on, Mrs May’s task is to sell her planned deal to 27 leaders of EU countries. But it remains to be see whether they will accept the UK’s plans, or demand more concessions.\nSpeaking to the Journal, Mr Lavery said: “I’ll tell you why Labour could take over - because have a better standing in Europe with the EU27 leaders.\n“Jeremy Corbyn and the Labour Party have a much higher standing in Europe than the Conservatives.\n“The Conservative Party, Theresa May, David Davis, Boris Johnson, they are a laughing stock.\n“Yes of course, we are ready to take over the reins.\n“So we want a general election. That will decide who leads the country. And then we would be ready immediately to take over negotiations at such a critical time.”\nLabour is likely to reject Mrs May’s proposed Brexit deal but will not make a final decision until it sees a Government white paper setting out the plans in more detail, due to be published on Thursday. Read More All your NUFC news\nMr Lavery said: “It doesn’t look on the face of it that the deal will be passed through the commons.\n“We need to have a look at what is presented in the White Paper, and then we will decide on that.\n“But the Labour Party is quite clear that we want a customs union, we want the benefits of a single market.”\nUS President Donald Trump delivered his verdict as he answered questions from reporters on the lawn of the White House.\nHe will meet the Prime Minister at a Nato summit in Brussels before arriving in the UK on Thursday.\nMr Trump said: “It’s going to be an interesting time in the UK and an interesting time at Nato. We will work it out and all countries will be happy.\n“So I have Nato, I have the UK - which is in somewhat turmoil.”\nReferring to a planned summit with Russian president Vladimir Putin on Monday, Mr Trump added: “And I have Putin. Frankly, Putin may be the easiest of all.” Read More Who could replace Theresa May as Prime Minister? Here are the favourites\nAsked whether Mrs May should be replaced as Prime Minister, the US president replied: “Well that’s up to the people. I get along with her very well, I have a very good relationship. That’s certainly up to the people, not up to me.”\nMr Trump said he had not spoken with Mrs May, adding: “Boris Johnson is a friend of mine. He’s been very, very nice to me, very supportive. Maybe I’ll speak to him when I get over there.\n“I like Boris Johnson, I’ve always liked him.”\nNorth East business leaders urged the Government to end uncertainty and make progress on a deal with the EU.\nJames Ramsbotham, chief executive, North East England Chamber of Commerce said: “The North East business community welcomes the desire to have a much closer working relationship with our European neighbours and encourages the Government to make real progress in this regard.”\nBut it was confirmed that Government departments are beginning to plan for leaving the EU without a deal. Read More More than 55,000 sign petition calling for a bank holiday if England win World Cup\nJustice Minister Lucy Frazer revealed in the House of Commons that the Treasury had handed the Ministry of Justice £17.3 million to prepare for a no-deal Brexit.\nMeanwhile, Labour Deputy Leader Tom Watson said it is “highly unlikely” his party would call for a second referendum on Brexit, but he said the option hadn’t been taken “off the table”.\nSpeaking to BBC Radio 4, he said: “It is conceivable that there is no majority position for any deal in the current arrangements in Parliament.\n“So, even though we’d prefer a meaningful vote in Parliament, and I have said many, many times it’s highly, highly, highly unlikely we will support a people’s vote, and we have not called for it, we haven’t taken that off the table because there are a rare set of circumstances where Parliament just can’t make a decision on it, and in those circumstances you’d keep your options open.\n“But ... it’s highly, highly unlikely we’ll go down that route.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-11T10:00:00.000+03:00", "crawled": "2018-07-11T10:35:08.004+03:00", "highlightTitle": ""}