{"organizations": [], "uuid": "5a441c9e0ae4f4b139d5e9048b1d444d79a2f583", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14919256.ece/ALTERNATES/s1200/0_Brexit.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/leave-campaign-cheated-win-eu-14919038", "country": "GB", "domain_rank": 21960, "title": "Leave campaign 'cheated' to win EU referendum - now North East MP wants Brexit to be scrapped", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-17T17:33:00.000+03:00", "replies_count": 0, "uuid": "5a441c9e0ae4f4b139d5e9048b1d444d79a2f583"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/leave-campaign-cheated-win-eu-14919038", "ord_in_thread": 0, "title": "Leave campaign 'cheated' to win EU referendum - now North East MP wants Brexit to be scrapped", "locations": [], "entities": {"persons": [{"name": "nicholas soames", "sentiment": "none"}, {"name": "julie elliott", "sentiment": "none"}, {"name": "darren grimes", "sentiment": "none"}, {"name": "winston churchill", "sentiment": "none"}, {"name": "elliott", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "electoral commission", "sentiment": "none"}, {"name": "sunderland central", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Could not subscribe, try again later Invalid Email\nBrexit should be scrapped because the Leave campaign won by “cheating”, according to one MP.\nJulie Elliott, MP for Sunderland Central , spoke out after it emerged that the official Leave campaign group has been referred to the police, and fined £61,000, for breaking electoral law.\nShe wasn’t alone. Conservative MP Sir Nicholas Soames, Winston Churchill’s grandson, called for “the whole damn thing” to be “blown up and started again”.\nIndependent watchdog the Electoral Commission fined Vote Leave, the official Leave campaign in the 2016 referendum, because it handed more than £600,000 to a group called BeLeave, which spent the money on a data analytics and voter targeting firm.\nThe Commission found there was “significant evidence of joint working” between Darren Grimes, who ran BeLeave, and the Vote Leave campaign.\nThis meant Vote Leave should have declared the spending as its own - which would have taken it over the £7m spending limit, the watchdog said. Read More Why a second Brexit referendum has become more likely\nMs Elliott, a Labour MP, said the finding “clearly has proved that this referendum was won by cheating.”\nShe asked: “Will the minister do what the Government should be doing, and in fact call this referendum null and void and protect British democracy?”\nCabinet office minister Chloe Smith rejected the request and said the referendum would not be re-run. A Vote Leave placard during the EU referendum (Image: PA)\nBut Sedgefield Labour MP Phil Wilson stepped up calls for a second public vote on Brexit , as he warned the North East faced “industrial extinction” on the same scale as the death of the mining industry.\nThe MP, the son of a coal miner, said: “In the 1960s, there were 500,000 miners working down 480 pits in the UK.\n“By the 1980s, there were 133 pits employing 180,000 miners. Today there are none.”\nMr Wilson said major manufacturers such as Nissan faced “death by a thousand cuts” as Brexit made it harder to invest in the region.\n“We should listen to the warning of companies such as Nissan, Airbus, Jaguar Land Rover and BMW when they predict the future.\n“They know their business and they provide hundreds of thousands of jobs in areas of the country most affected by Brexit.\n“Even the Government’s own regional impact assessments point to a dire outcome in the North East, whatever the Brexit deal.” Read More Virgin East Coast boss says the failed franchise improved services\nMr Wilson added: “Before we retreat to the past, people should be given another chance to decide whether that is where they want to end up.\n“A People’s Vote on the final Brexit deal will give people a say on what it is we know in 2018 that we didn’t know in 2016.”\nThe Conservative Party continued its descent into civil war after the Prime Minister was hit by an unexpected ministerial resignation on Monday night.\nDefence minister Guto Bebb voted against the Government, effectively quitting his frontbench role.\nAnd Theresa May saw off defeat in the House of Commons by just three votes, when MPs debated two key changes to the Customs Bill.\nShe had agreed to amend the legislation to keep hardline pro-Brexit MPs happy - but this sparked a backlash from Tories who want a softer Brexit, and 11 of them joined forces with Labour and other opposition parties in an attempt to defeat the Government. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-17T17:33:00.000+03:00", "crawled": "2018-07-17T18:29:08.010+03:00", "highlightTitle": ""}