{"organizations": [], "uuid": "c8e068288b0195b28c88073ce0d132b84e9a7740", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14899705.ece/ALTERNATES/s1200/RAIL-Scenic-1.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/east-coast-main-line-needs-14899678", "country": "GB", "domain_rank": 21960, "title": "East Coast Main Line needs 'immediate investment' before it's too late", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-12T18:00:00.000+03:00", "replies_count": 0, "uuid": "c8e068288b0195b28c88073ce0d132b84e9a7740"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/east-coast-main-line-needs-14899678", "ord_in_thread": 0, "title": "East Coast Main Line needs 'immediate investment' before it's too late", "locations": [], "entities": {"persons": [{"name": "johnson", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "lindisfarne castle", "sentiment": "none"}, {"name": "mckinnell", "sentiment": "none"}, {"name": "jo johnson", "sentiment": "none"}], "locations": [{"name": "east coast", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}], "organizations": [{"name": "news east coast main line", "sentiment": "negative"}, {"name": "parliamentary group", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News East Coast Main Line needs 'immediate investment' before it's too late Billions was spent on improving the West Coast Main Line but the East Coast track is in danger of being neglected, MPs say Share A train passing Lindisfarne Castle (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing!\nThe neglected East Coast Main Line requires investment to prepare it for the arrival of high speed rail services, ministers have been told.\nRail Minister Jo Johnson has met MPs campaigning for improvements to the line, led by Newcastle North MP Catherine McKinnell.\nAnd in a letter to Mr Johnson, she said: “ The East Coast Main Line - one of the country’s most strategically important routes, which serves multiple traffic flows including over 20 million passengers a year - suffers from ageing and unreliable infrastructure.”\nMs McKinnell chairs the all-party Parliamentary Group for the East Coast Main Line, which includes MPs from all parties.\nThey argue that the line, running between London, Newcastle and Edinburgh, has never received the same level of investment as the West Coast Main Line, which runs to Manchester and Birmingham, and was modernised ten years ago at a cost of more than £8bn.\nSections of the East Coast Main line will have to be upgraded because high speed trains will run on it once the HS2 high speed rail line starts running to Yorkshire in 2033.\nThe plan is for trains to switch on to the existing track near Leeds, and continue running to Newcastle.\nBut this will leave the rest of the East Coast Main Line offering a second-class service, according to MPs. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nIn her letter to the Rail Minister, Ms McKinnell said: “Investment is clearly needed in the immediate term to tackle issues of capacity, speed and resilience and a clear commitment from the Government on this issue is therefore pressing.”\nAnd the introduction of HS2 would make the problem more pressing.\n“The far northern, central and southern sections - which will not be served by HS2 - need investment so that they do not become remote in terms of connectivity and prosperity.”\nShe added: “In essence, in 2033 the East Coast Main Line should take on a new lease of life.\n“To the north of York, it will link the North East to HS2 and Northern Powerhouse Rail, and to the south it will provide new capacity for freight and enhanced commuting into London.\n“But we need to know how the Government intends to fund the route from now onwards in order to make this happen.” Read More We're ready to take over Brexit talks right now, says Labour chair\nThere have been repeated claims that the North East is underfunded when it comes to transport.\nA report by House of Commons Transport Committee found transport funding for the North East was £291 per person last year, including money for roads, rail and other forms of public transport, while the average figure for England was £425 per head, while for London it was £944 per head.\nThere have been some recent wins such as the announcement of £337m in funding for new trains on the Tyne and Wear Metro.\nThe Department for Transport says the next few years will see higher Government spending in the North, compared to the South, and by 2020 all Northern and TransPennine trains will be new or refurbished, with an extra 500 carriages providing space for 40,000 extra passengers and 2,000 extra services each week. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-12T18:00:00.000+03:00", "crawled": "2018-07-12T19:48:53.000+03:00", "highlightTitle": ""}