{"organizations": [], "uuid": "51e4a38285dcf8e9a0172c174922ae6d31490efe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1367716.ece/ALTERNATES/s1200/ac-italy.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/news-opinion/what-happen-farming-devon-post-1367671", "country": "GB", "title": "What will happen to farming in Devon post Brexit?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-11T10:21:00.000+03:00", "replies_count": 0, "uuid": "51e4a38285dcf8e9a0172c174922ae6d31490efe"}, "author": "devonlive", "url": "https://www.devonlive.com/news/news-opinion/what-happen-farming-devon-post-1367671", "ord_in_thread": 0, "title": "What will happen to farming in Devon post Brexit?", "locations": [], "entities": {"persons": [{"name": "matt", "sentiment": "none"}, {"name": "michael gove", "sentiment": "none"}, {"name": "matt lobley", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "devon local nature partnership", "sentiment": "none"}, {"name": "rural policy research", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nYesterday I attended the Devon Local Nature Partnership conference ‘New Horizons for Devon’s Natural Capital’.\nGreat speakers, well attended and well organised. Whilst there are many exciting initiatives happening right now in Devon and the ‘Green Brexit’ mission of Michael Gove gives environmentalists much to be optimistic about with the mantra of ‘public money for pubic goods’, I nevertheless left the conference with a sick feeling in my stomach. What does the future hold for Devon’s multitude of small family farms?\nMost of my friends are not rural policy wonks and therefore they are unaware of the situation that farming in Devon (and elsewhere) finds itself. Read on.\nHere is Professor Matt Lobley from the Centre for Rural Policy Research (where I work) at the University of Exeter talking about Farm Business Income.\nMatt told the audience that the bottom 42% of small farms in England contribute just 2% of agricultural output…. There will be those who say these farmers are inefficient and a widespread re-structuring of the industry is required, I say be careful what you wish for. Read More Poundstretcher is the latest retailer to face problems\nThe consequences for the natural character, landscapes, biodiversity and social fabric of counties like Devon in losing 42% of its small family farms would be immense and would led to outcomes which would fly in the face of the Green Brexit objectives.\nThe rest of this blog attempts to explain the predicament that farmers in Devon now find themselves and gives a small insight into what has to be done over the coming 5 years. The following data comes from various Defra Farm Income reports.\nThis graph shows the average Farm Business income in England for the various different types of farming. It shows that across England cereals, grazing livestock (lowlands), grazing livestock LFA (Less Favoured Areas) and mixed farming all lose money on the agricultural side of their businesses.\nThis table gives the actual figures included in the above graph. So if we look at Grazing Livestock (lowland) i.e. much of Devon that isn’t on Dartmoor or Exmoor, the figures show that the agricultural business lost £8,700 but agri-environment payments (money for looking after wildlife) generated £3000, diversified income (e.g. running a B & B on the farm) produced £6500, the Basic Payment Scheme (subsidy for owning land) provided £15,300 giving an overall Farm Business Income of £16,100. Read More Britain is 'under attack' by Russia, says Devon MP\nSo £24,800 comes from grants, diversified non agricultural businesses and the Basic Payment Scheme to offset the £8700 agricultural loss giving the family farm an income of £16,100. That is not a living wage, i.e. the income provided is unable to pay the farmer, spouse and other working family members a rate of pay equal to the minimum agricultural wage.\nThe above figures are the 2016/17 figures for England but if you look at the regional numbers other trends emerge.\nThese are the 2015/16 figures: the average England FBI figure for grazing livestock is £14,400 but in the south west this drops to £10,300. The dairy sector on the other hand is stronger in the south west.\nHere are the summary forecasts for 2017/18.\nAnd here are the detailed forecast figures for 2017/18 along with the trends since 2012/13, an 8% decline for upland hill-farmers (LFA) and a standstill position for lowland grazing livestock. A major increase for dairy and a substantial one for cereals. A volatile market but a very precarious one for livestock farmers.\nThere are some pretty stark numbers in these datasets. Many farms, particularly small farms make small margins and many others are very reliant on agri-environment grants and the Basic Payment Scheme. Read More Exmoor’s ambition to become the test-bed for national policy post-Brexit\nAfter we leave the EU the Basic Payment Scheme will be phased out and public money for farmers will be provided in return for the provision of public goods (e.g. wildlife, access, looking after the historic environment, carbon storage, flood prevention, provision of drinking water etc). The following table shows the scale of the shift in policy and the implications of what might happen if it can’t be achieved.\nThe column titled CAP (Common Agricultural Policy) Subsidy is the sum of the agri-environment grants and the BPS subsidy. This is the amount of money therefore that farmers will have to earn via the provision of pubic goods if they are to maintain their current income levels. The final column shows what the impact would be on their Farm Business Income if they are unable to do this.\nAnd here’s the rub – some farms on account of their location are much better placed than others to provide a suite of public goods and therefore receive public money.\nSo for example hill-farmers in National Parks have made a very strong case that they can provide these public goods as these areas are rich in natural capital and this has been acknowledged by Government. Read More How a nomination for a young farmer can kick start an agricultural career\nOn the other hand lowland graziers perhaps will find it much more difficult to provide public goods as they are not situated in National Parks with Bronze Age landscapes and Special Areas of Conservation where millions of people go for access and recreation.\nThe stated aim of these changes is to leave the environment in a better condition than it is in now, this means changes to the way things are done. Judging by the conversations that I’ve heard hill-farmers might be able to provide £22,800 worth of public goods to make up for the loss of their Basic Payment Scheme subsidy, the question is whether for example lowland graziers can provide £15,300 and dairy farmers £25,300 worth of public goods in return for the money.\nI had a conversation with Robin Milton, Chair of Exmoor National Park, hill-farmer and NFU Uplands chair about this very topic yesterday and that was why I left the conference with a sick feeling in my stomach.\nAdrian Colston's blog can be found at: https://adriancolston.wordpress.com/ Like us on Facebook ", "external_links": ["https://adriancolston.wordpress.com/", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-11T10:21:00.000+03:00", "crawled": "2018-07-11T11:44:19.012+03:00", "highlightTitle": ""}