{"organizations": [], "uuid": "0110d6ba567ff021f4631450eea047782af96bdb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13988050.ece/ALTERNATES/s1200/SMR_NEC-031217CCtrain-2.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/department-transport-consider-cutting-rail-14929007", "country": "GB", "domain_rank": 21960, "title": "Department for Transport consider cutting rail services to Northumberland", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-19T20:00:00.000+03:00", "replies_count": 0, "uuid": "0110d6ba567ff021f4631450eea047782af96bdb"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/department-transport-consider-cutting-rail-14929007", "ord_in_thread": 0, "title": "Department for Transport consider cutting rail services to Northumberland", "locations": [], "entities": {"persons": [{"name": "baroness sugg", "sentiment": "none"}], "locations": [{"name": "morpeth", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "edinburgh", "sentiment": "none"}], "organizations": [{"name": "department for transport", "sentiment": "negative"}, {"name": "northumberland department for transport", "sentiment": "negative"}, {"name": "northumberland rail", "sentiment": "negative"}, {"name": "house of lords", "sentiment": "none"}, {"name": "invalid email transport ministers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Department for Transport consider cutting rail services to Northumberland Rail services to Morpeth, Alnmouth and Berwick-upon-Tweed could be cut Share A CrossCountry train (Image: REX/Shutterstock) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nTransport Ministers have confirmed that services to smaller stations north of Newcastle could be cut, as part of a plan to reduce overcrowding.\nIt emerged in June that the Department for Transport is considering reducing the number of stops on CrossCountry passenger services. The aim would be to cut the number of passengers using the service for short journeys, so there is more room for commuters making long-distance trips.\nBut it led to concern that fewer trains will stop at stations such as Morpeth, Alnmouth and Berwick-upon-Tweed.\nAnd Transport Minister Baroness Sugg has now confirmed that this is being considered.\nShe told the House of Lords: “There will be at least one CrossCountry train per hour north of Newcastle, to Edinburgh or beyond. The options for intermediate stops to stations north of Newcastle form part of the consultation.”\nThe proposal is one of a number of ideas in a public consultation about the future of the CrossCountry Passenger Rail Franchise, which includes long-distance services stretching from Aberdeen, Glasgow and Edinburgh in Scotland to Cambridge in the south east of England and Penzance in the south west.\nDestinations on the Cross Country franchise include Newcastle , Durham and Darlington.\nA Department for Transport document published by Transport Secretary Chris Grayling suggested cutting overcrowding by “reducing the number of short distance passengers, where there are suitable alternatives”.\nIt asked passengers whether they would support “removing calls from towns closest to the conurbation centre either completely or just at peak times.”\nAnother proposal in the document is to continue calling at smaller stations - but to avoid including the stops in timetables.\nThe idea is that this would allow people to get off at smaller stations, but it would cut the number of people getting on because many passengers wouldn’t know the service existed. Read More Leave campaign 'cheated' to win EU referendum - now North East MP wants Brexit to be scrapped\nConcerns were raised in the House of Lords by Alan Beith , the former Liberal Democrat MP for Berwick-upon-Tweed.\nLord Beith told Ministers: “CrossCountry is a key provider of train services from Berwick, Alnmouth and Morpeth, leading to 475,000 passenger journeys a year.”\nHe asked Baroness Suggs: “Does she recognise that there are worrying suggestions in the consultation document to which she referred of, ‘fewer calls at some stations’, and fewer trains between York and Edinburgh?\n“The Secretary of State states that his priority is to reduce crowding. Will he do that with longer trains, or by telling people in Northumberland to get into their cars while the trains whizz through the stations without stopping?”\nIan Wrigglesworth, a former Teesside MP and now a Lib Dem member of the House of Lords, said the North East needed public transport in order to support the economy.\nHe said: “It has the highest level of unemployment and having a good public transport system to enable people to travel round the whole region is essential to get those figures down.” Read More Labour councillors 'uniting' over plans to stop them choosing council leaders\nBaroness Sugg said a consultation was underway and the views of passengers would be taken into account.\nShe said: “We want to address overcrowding, which will be done through additional rolling stock but there are other ways to look at that too.\n“Of course passengers have conflicting demands: some will want quick express services and others will want a stopping service to get around locally.\n“The point of the consultation ​is for passengers to tell us what they want from that service.”\nThe consultation document, and details of how to respond, are at www.gov.uk/government/consultations/cross-country-rail-franchise . Like us on Facebook", "external_links": ["http://www.gov.uk/government/consultations/cross-country-rail-franchise", "https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-19T20:00:00.000+03:00", "crawled": "2018-07-20T01:21:00.007+03:00", "highlightTitle": ""}