{"organizations": [], "uuid": "fc9034e5d9e39923b4876ab9f49642071ec40471", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14852995.ece/ALTERNATES/s1200/1_JS156326181.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14971543", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: House of Fraser asks Mike Ashley for £50m loan, reports claim", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-31T10:00:00.000+03:00", "replies_count": 0, "uuid": "fc9034e5d9e39923b4876ab9f49642071ec40471"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14971543", "ord_in_thread": 0, "title": "Business Breakfast LIVE: House of Fraser asks Mike Ashley for £50m loan, reports claim", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}, {"name": "fraser", "sentiment": "negative"}, {"name": "jonathon manning", "sentiment": "negative"}, {"name": "simon embley", "sentiment": "none"}], "locations": [], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "lsl propert", "sentiment": "negative"}, {"name": "lsl property services", "sentiment": "negative"}, {"name": "estate agency division", "sentiment": "none"}, {"name": "financial services", "sentiment": "none"}, {"name": "lsl", "sentiment": "none"}, {"name": "lloyds bank plc", "sentiment": "none"}, {"name": "the group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning LSL Property Services profits half at half year\nNewcastle estate agents LSL Property Services saw its operating profit slashed in half during the first six months of 2018.\nThe firm saw its operating fall from £14.3m in 2017 to £7.4m for the six months ending Jun 2018. Turnover increased by 0.9% to £152.9m.\nSimon Embley, LSL’s chairman, said:\nThe Group has delivered a resilient first half revenue performance in the context of challenging residential property market conditions. Whilst Residential Sales volumes remained suppressed, revenue trends in other parts of our business are more robust due to our ongoing self-help measures. Our Lettings and Financial Services businesses continue to perform positively and Financial Services income now represents 33% of total Estate Agency Division income.\nDuring the first half, Lloyds Bank plc awarded LSL a material five-year contract to deliver surveying and valuation services which demonstrates the market leading proposition that we are able to offer our customers and reflects well on our technology investment.\nWhilst market conditions in the first half of 2018 have been softer than the Board’s expectations and the equivalent period in 2017, LSL’s financial performance in the first half of 2018 was in line with the Board’s expectations. Given Residential Sale pipelines are above previous expectations, current trading in Surveying is positive and the range of self-help initiatives in progress, the Board is confident of delivering a full year Group Underlying Operating Profit in line with expectations. Your Move is owned by LSL Property Services Plc (Image: pa) 9:10 Jonathon Manning Car production falls 3.3% in first half of the year\nCar production fell by 3.3% during the first half of 2018, compared with the same period last year.\nThe Society of Motor Manufacturers and TRaders (SMMT) said 834,402 cars were buils in UK factories between January and June.\nDomestic demand was down by 12.9%, while exports fell by 0.8%. Despite a 3.6% in decline from the European Union, it remained the UK’s biggest trading partner.\nSMMT chief executive Mike Hawes said:\nFirst-half figures are a reminder of the exports-led nature of UK automotive, the integrated EU supply chain and our mutual dependency on free and frictionless trade.\nThe UK Government’s latest Brexit proposals are a step in the right direction to safeguard future growth, jobs and consumer choice - not just in Britain but right across Europe.\nWe now look to negotiators on both sides to recognise the needs of the whole European automotive industry which, combined, employs more than 12 million people.\nAny disruption risks undermining one of our most valuable shared economic assets. UK car sales have fallen during the first six months of 2018 9:05 Jonathon Manning Centrica keeps prices 'under review' amid falling profits\nThe owner of British Gas has reported a 20% drop in earnings within its residential supply arm, and has raised the prospect of increases tariffs.\nCentrica’s consumer arm saw it underlying operating profits fall to £430m for the six months ending June 30 after it was hit by last year’s price cap, loss of customers, and rising wholesale energy prices.\nMore than four million British Gas customers were hit by a price hike at the end of May, but the firm said wholesale costs have risen even further since then.\nThe firm said:\nWe are keeping the movement of wholesale energy prices and their impact on our cost of supply under review.\nThe group’s half-year results showed it lost another 341,000 UK household energy accounts in the first half as customers continued to switch away to smaller competitors.\nBut it said this also included 50,000 pre-payment accounts after the Government imposed a pre-payment price cap last April and insisted the overall customer exodus has slowed in recent months.\nOverall, Centrica group-wide underlying half-year operating profits fell 4% to £782m. British Gas logo (Image: PA) 9:00 KEY EVENT Recruitment firm that turned down cash from Dragons' Den star aims to create 25 jobs\nA recruitment specialist that once turned down investment from Dragons’ Den star James Khan , is planning to create 25 new jobs in Newcastle as part of plans to boost his company’s turnover to £24m.\nSteven Rawlingson’s business Samuel Knight - which specialises in recruiting engineers for the energy and rail sectors - has grown rapidly since it launched four years ago and is now generating £10m in turnover.\nThe company - which is also considering overseas expansion - focuses on finding engineers from the local area for major companies such as GE, Siemens, and the Northern Power Grid, sending them out to work on some of the biggest projects in the world, including building three power stations in Egypt.\nIt currently employs around 60 people at its Newcastle office, but the company is planning on hiring a further 25 members of staff to grow the business.\nMr Rawlingson said:\nWe are looking to hire roughly 25 graduates but we might push it to 30.\nWe bring in the graduates and put them through a training scheme. They learn about the concept of Samuel Knight and then we determine which division to put them in.\nMr Rawlingson founded Samuel Knight after spotting a gap in the market while working at another large corporate recruitment firm. Instead of recruiting engineers for a large range of sectors, he wanted to launch a firm that specialised in the rail and energy markets, where there was a skills shortage.\nWhile looking to set up his business he pitched his idea to James Khan’s investment business, and won the backing of the Dragons’ Den star. However, he ultimately turned the cash down in favour of working with another silent business partner. Steven Rawlingson, founder and managing director of Samuel Knight (Image: Staff) 8:55 Jonathon Manning Thomas Cook warns profit figures could be lower than hoped\nHoliday giant Thomas Cook said its annual profit growth would come in at the lower end of expectations after Europe’s heatwave hit demand for late bookings.\nThomas Cook said group tour operator summer 2018 bookings were flat, while they rose 1% in the UK.It said UK package holiday prices were 7% higher as it sought to offset surging hotel inflation in the Spanish market.The Thomas Cook airline business saw a 15% rise in bookings, with demand for short-haul offsetting a decline in long-haul flight bookings.Overall gross profit fell 3% to £443m in the three months to June 30, while underlying earnings rose 8% to £14m.\nPeter Fankhauser, chief executive of Thomas Cook, said:\nBookings for the summer are up 11% overall, fuelled by strong growth in our group airline, in line with the planned increase in capacity, particularly in Germany.\nThis has helped to offset a slowdown in package holiday bookings in recent weeks, with customers across our European markets delaying decisions about their summer holidays as they enjoy the record temperatures at home.\nIt’s clear that we remain in a competitive environment, particularly in the UK where the growth in popularity of higher-margin destinations like Turkey and Egypt has not fully offset the continued pressure on margins to Spanish holidays.\nBased on our current view, we now expect growth in full-year underlying operating profit to be at the lower end of market expectations. Thomas Cook Airlines plane (Image: Publicity Picture) 8:50 Jonathon Manning Virgin Money suitor CYBG on track for full-year loss, analysts say\nThe company bidding to buy Newcastle’s Virgin Money could be on track for a full-year loss , an analyst has warned.\nCYBG’s interim results showed a reduction in mortgage drawdowns in the three months to June 30 due to lower applications earlier in the year, and stressed that the mortgage market “remains extremely competitive”.\nPricing pressure in its retail banking operations has been offset in part by improved margins in its division serving small and medium-sized businesses.\nBut it is still expecting full-year mortgage growth to be at the lower end of its guidance range.\nMortgage growth has risen 3.8% to £24.2bn in the year to date, while growth in its core small and medium-sized business division grew 4.7% so far this year, with £420m of gross loans and facilities written in the third quarter.\nCYBG also noted that complaints over the misselling of payment protection insurance (PPI) “remain elevated”, having already been knocked by an extra £350m charge in additional provisions in the first half of the year.\nChief executive David Duffy said it was a “solid performance” for the lender, but questions have been raised over the bank’s ability to deliver full-year profits.\nIan Gordon, a banking analyst at Investec, said it was an “underwhelming” interim statement which “illustrates the challenges which should ensure a loss in FY2018”.\nHe said:\nCYBG has delivered steady income growth alongside absolute cost reduction through FY2016/17 (full year), which we broadly expect to continue through FY2018 to FY2020, driving further improvement in underlying profit before tax.\nHowever, conduct and restructuring costs have taken their toll, and, after the material PPI charge in the first half of FY2018, we forecast a loss in FY2018, before a return to profit in FY2019. Clydesdale Bank chief executive David Duffy (Image: PA) 8:45 KEY EVENT CYBG appoints directors ahead of Virgin Money takeover\nCYBG has appointed three non-executive directors ahead of is upcoming merger with Newcastle challenger bank Virgin Money.\nCYBG - which owns Clydesdale and Yorkshire Bank - is set to acquire Virgin Money following regulator approval.\nThe company has today revealed that it has appointed to three non-executive directors to the firm, dependent on whether the deal is approved.\nGeeta Gopalan and Darren Pope will be appointed independent non-executive directors of CYBG, while Amy Stirling will be a non-executive director of CYBG. They will each also join the Board of Clydesdale Bank PLC.\nMs Gopalan will be appointed a member of the CYBG Risk Committee and of the Clydesdale Bank PLC Risk Committee and Mr Pope will be appointed a member of the CYBG Audit Committee and of the Clydesdale Bank PLC Audit Committee.\nJim Pettigrew, CYBG chairman said,\nWe are delighted Geeta, Darren and Amy have agreed to join the CYBG Board on completion of the Offer. We believe the combination of CYBG and Virgin Money will be a powerful force in UK banking and the insight, expertise and experience of all three proposed directors will be invaluable as we bring both businesses together to create the first true national competitor to the status quo. Clydesdale Bank (Image: PA)", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14971543;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-07-31T10:00:00.000+03:00", "crawled": "2018-07-31T12:01:24.007+03:00", "highlightTitle": ""}