{"organizations": [], "uuid": "9dc4e77be56e6f24f320dde18d73b8629b7a9836", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14862023.ece/ALTERNATES/s1200/Northumberland-Street-Newcastle.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/high-streets-cant-survive-shops-14861933", "country": "GB", "domain_rank": 21960, "title": "High streets can't survive on shops alone, new report says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-04T02:01:00.000+03:00", "replies_count": 0, "uuid": "9dc4e77be56e6f24f320dde18d73b8629b7a9836"}, "author": "Agency Staff", "url": "https://www.chroniclelive.co.uk/business/business-news/high-streets-cant-survive-shops-14861933", "ord_in_thread": 0, "title": "High streets can't survive on shops alone, new report says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business High streets can't survive on shops alone, new report says String of shop closures has sparked warning that other uses will have to be found for city centre buildings Share Northumberland Street, Newcastle (Image: Staff) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nBricks-and-mortar retailing can no longer be the anchor for thriving high streets, which must become community hubs that include housing, offices and some shops, according to an influential independent review.\nChains including House of Fraser, Marks and Spencer and New Look have announced store closures in the North East in recent weeks while Toys’R’Us and Maplins have gone bust entirely.\nNow retail expert Bill Grimsey has warned it was time to accept that there was already too much retail space in the UK and town centres needed to be “repopulated and re-fashioned” with libraries and public spaces at the heart of each community.\nThe review is the second from a team led by the former Wickes and Iceland boss and comes amid a wave of closures and restructurings from major high street names including Toys R Us and Maplin and an ongoing shift to online shopping.\nIt argues that greater devolution and stronger local leadership is needed to give high streets a renewed sense of purpose and identity.\nAmong the 25 recommendations are calls to replace business rates, create a Town Centre Commission to develop a 20-year strategy for local high streets, and accelerate digital transformation in smaller towns.\nOther recommendations include the appointment of “high-quality” designers to celebrate the historic character and local identity of town centres, 30 minutes’ free parking in high streets with no paid extension option, improved street lighting and free public wi-fi.\nMr Grimsey said there had been some progress since his original 2013 review “but not nearly enough”. Read More Virgin Money suitor CYBG issues reassurances over jobs in Newcastle\nHe said: “The first six months of 2018 have seen the highest rate of retail closures, administrations and CVAs (company voluntary arrangements) for more than a decade and there is no sign of a slowdown.\n“Our cities, towns and communities are facing their greatest challenge in history, which is how to remain relevant, and economically and socially viable in the 21st century.\n“Towns must stop trying to compete with out-of-town shopping parks that are convenient and with free parking. They must create their own unique reason for communities to gather there - being interesting and engaging and altogether a compelling and great experience.”\nLocal Government Association economy spokesman Martin Tett said: “Many councils throughout the country are already leading the way in transforming the future potential of their town centres in the face of unprecedented changes in shopping habits and the retail landscape.\n“We are pleased that the report backs our calls for councils to have more powers and flexibility, particularly in relation to planning, to help shape and deliver vibrant town centres.\n“The LGA stands ready to work with the Government, councils and other stakeholders to help secure a prosperous long-term future for our high streets and town and city centres.” Read More Businesses are 'running out of patience' with Government over Brexit\nThe report comes a day after it wa revealed that at least 50,000 jobs have been axed in the first half of the year in the retail sector.\nAnalysis by the Press Association showed that approximately 50,000 staff have been made redundant or seen their role put under threat, with the bulk of them working for well-known high street chains.\nThe crisis in retail has been matched by a similar slowdown in the casual dining sector, with chains including Prezzo, Byron and Jamie’s Italian shutting restaurants. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-04T02:01:00.000+03:00", "crawled": "2018-07-04T08:19:16.005+03:00", "highlightTitle": ""}