{"organizations": [], "uuid": "d0e5eb76d738887b17c325293337c8dc1e4d158e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14948574.ece/ALTERNATES/s1200/0_GCSEs-study.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/public-sector-pay-must-rise-14948479", "country": "GB", "domain_rank": 21960, "title": "Public sector pay must rise but Government announcement could leave schools struggling, unions warn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-25T07:00:00.000+03:00", "replies_count": 0, "uuid": "d0e5eb76d738887b17c325293337c8dc1e4d158e"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/public-sector-pay-must-rise-14948479", "ord_in_thread": 0, "title": "Public sector pay must rise but Government announcement could leave schools struggling, unions warn", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "none"}, {"name": "david davies/pa wire", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "government", "sentiment": "negative"}, {"name": "news public", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Public sector pay must rise but Government announcement could leave schools struggling, unions warn The Government has announced an end to the public sector 1% pay cap and rises for a number of workers Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe North East’s public sector workers deserve a pay rise, but it must be properly funded, local unions have said.\nTeachers, armed forces personnel, doctors and nurses are among those in line for the pay rises announced by Theresa May on the last day of the parliamentary term.\nPublic sector pay was frozen for two years when the Conservative-Lib Dem coalition came to power in 2010, which was followed by a 1% maximum annual pay rise from 2013.\nThough the cap is now at an end, unions have accused the Government of “robbing Peter to pay Paul” after it emerged the rises would come from existing department budgets. A teacher during a lesson (Image: David Davies/PA Wire)\nPolice, Number 10 said, would get a 1% hike in basic pay along with a 1% “non-consolidated” one-year lump sum.\nSome teachers are set for a 3.5% pay rise, with prison service workers in line for a 2.75% jump and a 2% increase for the armed forces.\nThe offer also includes 2.9% for the armed forces and at least 2.75% for prison officers, backdated to April.\nFor teachers, it’s understood the Department for Education (DfE) will offer cash to cover anything over a 1% increase, but schools will have to stump up the rest themselves.\nMike McDonald, regional secretary of the Northern Region National Education Union, said the region’s schools were already stretched to capacity following budget cuts. Mike McDonald (Image: Newcastle Chronicle)\nHe said: “We’d welcome the 3.5%, but in terms of the funding it does need to be fully funded by Government. Individual schools will struggle to find the money, and that will lead to inequality.\n“You could have two schools a few miles apart, one of which can fund this and one of which can’t.\n“That creates a vicious cycle, where schools can’t attract the best teachers, can’t afford what they need for children. Then Ofsted come in, and say they’re not up to scratch, and start scrutinising them closely, which is stressful and many more teachers will vote with their feet.”\nEducation unions have also expressed concern that money which will be taken from the DfE budget may be needed elsewhere, and said it’s unfair that higher-paid teachers will receive lower percentage increases.\nMr McDonald’s concerns were echoed by union representatives across the country. Read More Andrea Leadsom: 'Brexit will be a success - and North East could vote Tory'\nUnison assistant general secretary, Christina McAnea, said: “Behind the good news headlines, the Government is simply robbing Peter to pay Paul.\n“Without extra money from the Treasury to fund these pay increases, services and jobs somewhere will have to be cut.\n“Ministers have finally recognised the damage and hardship their ill-thought-out pay policies have inflicted on public services and millions of public servants and their families.\n“But just as it did for the NHS and health workers, the Treasury should have come up with the money to fund all these pay promises.” Read More First firefighter recruitment drive since 2010 sees 5,000 apply in just 5 days\nMeanwhile, the GMB union criticised the way the rises were announced, saying public sector page should be based on independent reviews.\nRehana Azam, GMB National Secretary, said: “One million public sector workers have been left in limbo by this cloak and dagger briefing on the last day of Parliament.\n“This is not the way to treat dedicated public sector workers who have already suffered eight years of real terms pay cuts.\n“They haven’t even made a proper announcement - it just shows how out of touch Theresa May is.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-25T07:00:00.000+03:00", "crawled": "2018-07-25T08:35:13.003+03:00", "highlightTitle": ""}