{"organizations": [], "uuid": "1fa1d6dca095c010c06c0f32a72780878deff312", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14872791.ece/ALTERNATES/s1200/JS154736816.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14872780", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Rolls-Royce to sell commercial marine business in £500m deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-06T10:15:00.000+03:00", "replies_count": 0, "uuid": "1fa1d6dca095c010c06c0f32a72780878deff312"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14872780", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Rolls-Royce to sell commercial marine business in £500m deal", "locations": [], "entities": {"persons": [{"name": "chucos", "sentiment": "none"}, {"name": "byker", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "trakol", "sentiment": "none"}, {"name": "hillgate quay", "sentiment": "none"}], "organizations": [{"name": "coreena ford feast", "sentiment": "negative"}, {"name": "rolls-royce", "sentiment": "negative"}, {"name": "river brew co", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9.12 Coreena Ford Feast of street food to open at By The River Brew Co as 15 firms set up residence\nA feast of 15 independent food companies will take up residence at the North East’s latest leisure venue today .\nBy The River Brew Co has already opened its tap room and Trakol restaurant to the public in a complex of converted shipping containers at Hillgate Quay in Gateshead, with brewing at its in-house microbrewery set to get into full swing soon.\nThe second phase of the £1.5m project will come to life this weekend in the shape of HWKRMRKT (hawkers’ market), a group of 15 independent street food traders serving everything from burgers, tacos and pizza to waffle ice creams and crepes, together with a cocktail bar and gin bar.\nThe market will open today at 5pm and will stay open until 11pm, after which it will open every weekend from 5pm to 11pm on Fridays, 12pm to 11pm on Saturdays and from 12pm to 8pm on Sundays.\nPermanent residents include Mexican taco specialists Chucos, who already have a successful eaterie in Byker; Indian street food favourite Dabbawal, which also has a restaurant on High Bridge in Newcastle; fellow city firm Dastardly & Dutty, which serves up loaded fries; waffle ice cream makers Dubble Bubble; and vegan junk food firm Grumpy Panda.\nThe list is rounded off by Kaltur, which also has a Spanish restaurant on High Bridge in Newcastle; gourmet burger specialists Lola Jeans; seafood company Oktupus; Papa Ganoush; and Scream for Pizza.\nGuests serving the sweet treats will be Cakes Contour; Chay Chay; and Le Petit Creperie, alongside melted cheese firm Cheese Sir. Mildred’s Twisted Ankle will be serving gin while That’s Nice Dear will be selling cocktails. By The River Brew Co (Image: Copyright Unknown) 9.03 Pay rises as shortage of candidates for jobs continues\nSalaries are rising amid a continued shortage of candidates for jobs, according to new research.\nThe Recruitment and Employment Confederation (REC) said the number of candidates for vacancies has fallen again despite a “robust” demand for workers. The number of people available for permanent and temporary jobs continued to fall in recent months.\nREC chief executive Neil Carberry said it is a “candidates’ market”, adding: “It’s a great time for people looking to take the next step in their careers, as employers compete for new staff in a tight market.\n“Across the majority of sectors, both temporary and permanent opportunities are growing, and a lack of candidates means it is no surprise to see starting pay also rising.\n“Recruiters report that some of this high vacancy rate may be driven by good demand from companies not being matched by candidate willingness to move in the face of the current economic uncertainty.\n“The one sector that stands out as in a different place is retail. Placements are stagnating as the sector reshapes quickly, driven by changing customer demand and stiff competition.\n“But the type of customer service skills retail workers develop are in huge demand in other sectors, and the sheer size of our retail sector means there are still opportunities in stores.” A welder at work (Image: Andrew Milligan/PA Wire) 8.48 Newcastle's newest micropub opens today\nNewcastle’s newest micropub opens today in a converted railway arch.\nBeer Street is the result of a joint venture between craft beer enthusiasts Pete Allan and Karl Parkin and their partners.\nThe bar takes its name from the famous Hogarth painting duo Beer Street and Gin Lane -\nThe pair have more than 30 years’ experience in the trade and, just like the healthy, happy drinkers in Hogarth’s 18th Century picture – with beer depicted as a health alternative to gin – they are looking forward to similarly nourishing visitors with a host of local ales and beers.\nThe 50-capacity unit in Forth Street is right next to fellow micropub Box Social and round the corner from another, Split Chimp.\nArtist Toby Heaps, better known as Sune, has used the curved walls of the arch to create stunning backdrops within the bar, inspired by the Hogarth prints.\nIt opens from 12pm today. Karl Parkin, Jan Colman and Pete Allan in front of art work by Sune inside their new micropub, Beer Street (Image: Beer Street) 8.45 Coreena Ford Stobart's CFO resigns ahead of AGM\nStobart’s chief financial officer Richard Laycock has resigned just hours ahead of its contentious annual general meeting.\nThe company said that while Mr Laycock would not be putting himself up for election at the meeting, he would “continue to support the Stobart Group business.” An executive search will be launched “as soon as possible”.\nThe group said in the update that its energy division has performed well, logging a 54% rise in tonnages year-on-year thanks to new contracts coming online. Its infrastructure division meanwhile generated £25.5 million in cash following the successful sale and leaseback of properties and land at its Widnes site. “Further non-operating asset disposals are being pursued,” the company said.\nThe disposals are part of a wider strategy meant to boost its dividend. Stobart confirmed a 4.5p per share dividend would be paid out to shareholders today, bringing its total dividend for the year to 18p per share.\nChief executive Warwick Brady said:\nSince stepping into my role last year, we have made significant progress across our business divisions, and continue to focus on delivering on our ambition to double the value of the business by 2022. 8.36 Coreena Ford De La Rue in deal to be official 2018 FIFA World Cup Russia licensee\nDe La Rue has signed a licensing agreement to produce official licenced product authentication holograms that help fans know the products they buy are genuine.\nThe Gateshead firm’s highly secure holographic labels protect against counterfeit goods, and it has worked with FIFA since 2006 on the last three FIFA World Cups\nOver 120 million highly secure labels have been delivered for use on officially licensed merchandise such as clothing, football stickers, and souvenir items for the 2018 FIFA World Cup Russia.\nThe secure labels are easy to recognise and validate to check the product is not a fake, and each one includes a high security customised hologram with a colour stereogram animation, which incorporates microprint, tamper evidence and an individual serial number.\nThese holograms, which are officially referred to as Licensed Authentication Devices, are distributed to Authorised Licensees and are very difficult to counterfeit.\nThe cost of counterfeit and pirated goods is annually estimated to be around $1.2 trillion and growing, so the need to protect products is vital for both consumers to know they have a genuine product, and for businesses to protect their revenues.\nSteve Mercer, service delivery director at De La Rue, said:\nWe are incredibly proud to have again been selected to help to protect the licensed products for this year’s FIFA World Cup and hope fans feel confident they know they are getting the real deal when they see one of our holographic labels. They might seem simple enough, but they are in fact highly secure and include an array of features which guard against fraud and make it really tough to counterfeit.\nDe La Rue also produces hologram labels for the UEFA (Union of European Football Associations) and the FA (Football Association UK). The FIFA World Cup 2018 hologram produced for official products by De La Rue 8.33 KEY EVENT Business Secretary makes plea for business-friendly Brexit\nBusiness Secretary Greg Clark has used a speech on the eve of the crunch Brexit Cabinet meeting to issue a plea for a business-friendly relationship with the EU.\nMr Clark was speaking at the Northern Powerhouse Business Summit, part of the Great Exhibition of the North, just hours after the country’s largest car maker, Jaguar Land Rover, joined a chorus of businesses warning over the impact of Brexit.\nThe country’s biggest car-maker said a bad Brexit deal would cost the company more than £1.2bn in profit each year, adding that its UK investments would be “in jeopardy” if faced with the “wrong outcome”.\nIts warnings come after a similar concerns from Airbus and BMW, and just a few days after Nissan chairman Carlos Ghosn said the company had been left “in the dark” on Brexit and couldn’t make decisions on future investments for its massive plant in Sunderland.\nSpeaking in the Boiler Shop in Newcastle yesterday, Mr Clark said: “To the investors and workers in our car industry, whether they are at Jaguar Landrover in the West Midlands or Nissan not far away in Sunderland, you are a big part of Britain’s success. We will listen to you with the seriousness and respect due to people who give to our country more than you take. We are determined to make sure that you can continue to prosper and to invest in Britain.\n“Just take the North East’s contribution, a region that is based on trade and always has been. From cars to chemicals, local jobs and livelihoods rely on supply chains that cover the continent.\n“We have more than 120,000 men and women who work in manufacturing here in the North East and almost half a million people working across the North. “Those jobs in manufacturing are increasingly sophisticated and depend on the excellence of our design, the creative sector and the universities we have represented here to come together to form a cluster of excellence that is increasingly successful.” Business Secretary Greg Clark Coreena Ford Sports Direct to hand out free souvenir T-shirts if England wins World Cup\nSports Direct boss Mike Ashley has pledged to give out free souvenir T-shirts if England win the World Cup.\nThe billionaire Newcastle United owner has won the rights to make shirts with the official Three Lions logo, emblazoned with the words “2018 Winners” underneath it.\nMr Ashley was in Italy to witness Gareth Southgate’s anguish as he missed a penalty against Germany in 1996, and wants to give England fans an extra boost if their team bring the World Cup home.\nThe shirts will be available through Sports Direct’s app, and the company has warned Apple and Google that there could be a huge surge on their servers if England do win.\nA spokesman for Sports Direct said:\nMike knows the whole country will go potty if Gareth Southgate’s boys go all the way.\nThe only limit on how many we can give away will be how fast we can get them printed.\nMike’s ordered everybody at Sports Direct to pull out all the stops in order to make it happen.\nMike has always been an England fan and he was in Mexico in person to see the heartache of Maradona’s Hand of God goal, and in Italy in 1990 to see Gazza’s tears. He knows how much it will mean to people if we bring home the World Cup.\nThe team are now gearing up to face Sweden on Saturday, a match which former England manager Sven-Goran Eriksson has said will be “their most difficult game so far”. Mike Ashley (Image: PA) Coreena Ford Inmarsat knocks back £2.45bn takeover offer\nBritish satellite firm Inmarsat has rejected a second takeover approach by US rival Echostar in a deal that would have valued the business at £2.45bn. Echostar confirmed on Friday that it put forward a “new and improved proposal” earlier this week which offered shareholders 265p per share in cash and an exchange of 0.0777 Echostar stock for each Inmarsat share.\nBut that sweetened deal was rebuffed by Wednesday, nearly a month after Echostar’s initial approach was rejected on the basis that it “very significantly” undervalued the business.\nThe terms of the first proposal have not been disclosed. Echostar has not yet given up hope, saying it “continues ... to seek engagement with the board of Inmarsat on a constructive basis, with a view to agreeing the terms of a recommended transaction”.\nThe company is now seeking an extension of a deadline that requires it to table a firm proposal by 5pm today.\n“EchoStar believes a combination of EchoStar and Inmarsat is strategically compelling,” its market statement said.\n“The combined group would be one of the world’s leading satellite providers and be well supported by a global portfolio of complementary assets and service offerings.\n“EchoStar believes that the improved proposal presents a compelling opportunity for Inmarsat’s shareholders to realise certain value from their investment in Inmarsat while also participating meaningfully in the upside potential of the combined company.” The Inmarsat Logo KEY EVENT Rolls-Royce agrees sale of commercial marine unit in £500m deal\nRolls-Royce has agreed to sell its loss-making commercial marine business to Norwegian firm Kongsberg for an enterprise value of £500m.\nThe Derby manufacturer said the net proceeds will be around £350m to £400m after taking pension liabilities and other costs into account.\nThe announcement comes as Rolls-Royce enacts a sweeping restructuring plan aimed at saving £400m per year.\nThe transaction has been approved by the boards of both companies and is expected to close in the first quarter of 2019, subject to clearance from the regulatory authorities.\n“This transaction builds on the actions we have taken over the last two years to simplify our business,” said chief executive Warren East.\n“The sale of our commercial marine business will enable us to focus on our three core businesses and on meeting the vital power needs of our customers.” Rolls-Royce’s commercial marine arm has approximately 3,600 employees, most of which are based in the Nordic region.\nLast year the division generated revenue of £817m with an operating loss of £70m.\nThe disposal of the marine business is expected to have a positive profit impact of around £50m based on 2017 figures, Rolls-Royce said.\nCommercial Marine president Mikael Makinen said: “Rolls-Royce has been responsible for leading many of those technological advancements, and, with the combination of great people, market-leading technology and a desire by Kongsberg to take this business to the next level, I am sure that this business will prosper in the years to come.” The Rolls-Royce Raynesway Site in Derby More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14872780;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-07-06T10:15:00.000+03:00", "crawled": "2018-07-06T12:02:44.023+03:00", "highlightTitle": ""}