{"organizations": [], "uuid": "2f77babaae12f7fb086bd2bcaceb5cc0b162db80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14945296.ece/ALTERNATES/s1200/0_JS155967843.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/places-theresa-should-visited-see-14945187", "country": "GB", "domain_rank": 21960, "title": "Places strangled by austerity and threatened by Brexit that Theresa May missed during her visit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-24T13:11:00.000+03:00", "replies_count": 0, "uuid": "2f77babaae12f7fb086bd2bcaceb5cc0b162db80"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/places-theresa-should-visited-see-14945187", "ord_in_thread": 0, "title": "Places strangled by austerity and threatened by Brexit that Theresa May missed during her visit", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "none"}, {"name": "reece group", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Places strangled by austerity and threatened by Brexit that Theresa May missed during her visit The Prime Minister paid a visit to Sage and Reece Group - but we've thought of a few places she missed seeing Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nTheresa May visited the North East on Monday to insist her Government was “working for the whole country”.\nNow, we know our region is filled with fantastic places and success stories worth celebrating.\nThe Sage and Reece Group, where she visited on Monday, are just a few which make the list.\nBut on a rare visit, we wondered whether the Prime Minister should have stopped by a few other places to see first hand cuts are having on the region\nHere are a few suggestions of places where locals might have had a few things they’d like to ask her:\nSunderland’s Nissan plant The Nissan factory in Sunderland (Image: Unknown)\nIf there’s one factory where people might want to put a few questions to the PM, it’s probably some of the 7,000 people working at this vital North East car plant.\nTheresa May addressed questions about issues which will affect Nissan in Sunderland when speaking to Reece Group employees, although a visit was not on her schedule. Read More Research centre in Blyth to benefit from £180m funding package\nShe insisted “frictionless trade” with the EU would ensure areas like Wearside were still an attractive location for big business.\nAnd when asked about the plant later, she said the Business Department was “always in contact” with “key employers” like Nissan, claiming she understood what such businesses needed to keep them in the UK.\nStill, it seems likely those actually working in the plant might have had a few things to ask. West End foodbank Michael Nixon at work in the West End Food Bank on Benwell Lane (Image: newcastle chronicle)\nIn a damning report this April, the Trussell Trust said that Universal Credit, the Government’s flagship reform to the benefits system, helped explain why foodbank use had shot up.\nHuge numbers of foodbank users live in the North East, with Newcastle’s West End foodbank thought to be the largest in the country.\nFrom Belfast to Benwell: The new foodbank boss confident he hasn't bitten off more than he can chew\nOriginally set up in 2013 as a temporary measure to help those hardest hit by austerity, it’s been forced to stay open as families in the region struggle to buy enough to eat.\nCritics of the Government argue that as Universal Credit continues to be rolled out under Mrs May, claimants are sometimes left for weeks without the money they need.\nIf the Prime Minister wants to answer questions from ordinary people, maybe she should have started there. HMP Durham HM Prison Durham\nA damning documentary aired on Channel Four last week highlighted an “escalating drug problem” and violence against staff inside the category B jail.\nInmates spoke boldly to the cameras of their trade in drugs including ‘Spice’. Hit by Government cuts, staff struggle to deal with some inmates and recidivism is common. Read More Drugs, violence and notorious inmates: Life behind bars at HMP Durham exposed\nThe documentary also examined the increasing mental health problems faced by prisoners, with self harm rife inside.\nSince the PM has often said mental healthcare is one of her priorities, she might have visited some of the people living at the pleasure of her Government, in an institution beset by potentially life-threatening problems. The former Discovery School Discovery School Blandford Street, Newcastle (Image: newcastle chronicle)\nParents and students were shocked in June when £9m flagship free school the Discovery School, opened in 2014 to provide specialist science education, was forced to close its doors at short notice.\nUnable to control students or offer them the education they needed, school bosses said the institution was “simply not working”. Read More Theresa May's deal may not give us the Brexit we voted for, warns Anne-Marie Trevelyan\nSpeaking to employees at Reece Group on Thursday, the Prime Minister mentioned her party’s free schools programme as part of a solution to ensuring the country has enough high-quality school places. And she spoke of the importance of ensuring the youth of the North East have the technical and science skills they’ll need for the jobs of the future.\nPerhaps she should have paid a visit to the now-empty school buildings, to answer Newcastle City Council leader Nick Forbes’ accusation that the closure is a “damning indictment” of her Government’s “high-risk experiment in our education system”. De La Rue De La Rue in Gateshead, which has lost the contract to make British passports (Image: Daily Mirror)\nIt was almost beyond satire when, in March, we learned the brand new blue passports - a symbol of British independence from Europe - would no longer be made in Britain.\nBusiness was taken away from De La Rue’s factory in Gateshead and handed to a company in mainland Europe.\nThe company has printed UK passports from its Team Valley factory for the last 10 years but this year the Government contract was issued to Franco-Dutch firm Gemalto.\nBosses first hoped to appeal the decision but eventually withdrew their complaint, saying it was “disappointing” but “just the rough and tumble of business”.\nAs she attempted to sell her Brexit plan to the North East, Mrs May could have popped by the Gateshead factory to explain to workers facing an “uncertain future” how she plans to “protect jobs and livelihoods” in the North East. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-24T13:11:00.000+03:00", "crawled": "2018-07-24T15:36:33.016+03:00", "highlightTitle": ""}