{"organizations": [], "uuid": "4ebbcd37a38c0ac9e536d743f25306d1077ee6ab", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14900479.ece/ALTERNATES/s1200/Untitled-design-1.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/heres-stories-you-might-missed-14900215", "country": "GB", "domain_rank": 21960, "title": "Here's the stories you might have missed during the World Cup", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-12T16:05:00.000+03:00", "replies_count": 0, "uuid": "4ebbcd37a38c0ac9e536d743f25306d1077ee6ab"}, "author": "Sara Nichol", "url": "https://www.chroniclelive.co.uk/news/north-east-news/heres-stories-you-might-missed-14900215", "ord_in_thread": 0, "title": "Here's the stories you might have missed during the World Cup", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}], "locations": [{"name": "lancashire", "sentiment": "none"}, {"name": "greater manchester", "sentiment": "none"}, {"name": "barbados", "sentiment": "none"}, {"name": "novichok", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "amesbury", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Here's the stories you might have missed during the World Cup As the country was gripped with football fever, some headline news stories may have dipped under the radar. Here's a catch-up: Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nAs the nation remained firmly in the grip of World Cup fever, you may have missed several national and local news stories making the headlines.\nAway from the football, the last four weeks saw Brexit turmoil within the Government as two prominent figures quit, a catastrophic blaze rip through moorland in Lancashire and Greater Manchester, while a major probe was launched after a woman died and man was hospitalised due to suspected exposure to Novichok in Amesbury.\nBritain also basked in three-week-long heatwave, with temperatures in the south hitting 31.7C (89F) on Sunday, making the country hotter than Barbados.\nMeanwhile, over in the food and drink industry, a carbon dioxide shortage could spell a less beer, bacon - and even crumpets - being produced.\nInternationally, one story dominated the headlines and that was the heroic rescue of 12 young footballers and their coach from a flooded cave in Thailand.\nOn a local level, tributes poured in when Love Island star and former Miss Newcastle, Sophie Gradon, was found dead at her parents’ home in Northumberland. Just weeks later, he boyfriend, Aaron Armstrong was also found dead. Read More The World Cup boost\nOver in the region’s courts, predatory paedophile football coach and former Newcastle United volunteer, George Ormond, was jailed for 20 years for a campaign of sex abuse on young players, while South Shields garage boss, Richard Spottiswood, was warned he faced a life sentence after he was found guilty of murdering his employee, Darren Bonner, and dumping his fatally injured body in a shallow grave.\nSo, while Gareth Southgate’s men kept the country gripped to the World Cup, here’s a round-up of the news you may have missed. Cave rescue in Thailand (Image: Getty Images AsiaPac)\nTwelve boys and their football coach are continuing to recover in hospital after being rescued from a cave in northern Thailand, where they spent 17 days trapped underground.\nThe plight of the young team captured the attention of the world.\nOfficial help for the rescue came from Britain, the United States, Japan, Laos, Myanmar, China and Australia.\nThe dozen boys and their coach were rescued from inside a flooded Thai cave and lost an average of 2kg (4.4 lb) during their ordeal but were generally in good condition and showed no major signs of stress, a senior health official said.\nThe BBC reported that the boys and coach were heavily-sedated and only semi-conscious for their treacherous journey out of the cave. Brexit turmoil as Boris Johnson and David Davis quit Boris Johnson (left) and David Davis (right) (Image: PA)\nThere was uncertainty once again within Theresa May’s Government as Boris Johnson and Brexit Secretary David Davis quit the cabinet.\nMr Johnson launched a scathing attack on the Prime Minister’s Brexit strategy, saying the “dream is dying, suffocated by needless self-doubt”.\nIn his letter resigning as foreign secretary, he said Mrs May was leading the UK into a “semi-Brexit” with the “status of a colony”.\nHealth Secretary Jeremy Hunt has been named as Mr Johnson’s replacement as foreign secretary, with Matt Hancock as the new health secretary, while Dominic Raab was announced as the UK’s new Brexit Secretary. Love Island star dies at family home Aaron Armstrong and Sophie Gradon (Image: Handout)\nTributes poured in after Love Island star and former Miss Newcastle, Sophie Gradon, was found dead at her parents’ home in Northumberland.\nPolice said there were no suspicious circumstances after her body was found on June 20 in Medburn, Northumberland.\nJust weeks after the 32-year-old’s tragic death, her boyfriend Aaron Armstrong also died .\nHis body was discovered at his home on Furnace Road, Blyth, in the early hours of Tuesday. Predatory paedophile football coach and former Newcastle United volunteer jailed Former Newcastle United coach George Ormond (Image: Newcastle Chronicle)\nFormer football coach and Newcastle United volunteer, George Ormond, was locked-up for 20 years after being found guilty of a campaign of sex abuse on young players.\nThe pervert was a popular and respected figure in North East football but cynically abused his position for his own twisted sex kicks.\nOrmond sexually abused lads as young as 11 during a persistent course of offending which spanned 24 years, believing he could act with impunity as the victims would never dare speak out.\nHe was found guilty after a trial at Newcastle Crown Court of 36 sex offences on 18 victims between the 1970s and 1990s.\nThe 62-year-old was first convicted of abusing young players in 2002, when he was jailed for six years.\nSentencing him, Judge Edward Bindloss said: “Evidence showed that over a 25-year period, George Ormond was a man wholly preoccupied with sex who used his position as a respected football coach to target boys and young men in his care.” Fires on moorland in Greater Manchester and Lancashire A helicopter drops water as firefighters tackle the wildfire on Saddleworth Moor (Image: PA)\nHuge blazes engulfed large amounts of moorland in northern England.\nGreater Manchester Fire and Rescue Service is still tackling huge fires on Winter Hill and near Saddleworth Moor, while around 20 firefighters remain at a “significant” wildfire that broke out in Denshaw, Oldham.\nTwo men arrested on suspicion of starting the Winter Hill blaze have been released under investigation.\nThe fire near Saddleworth Moor fire is also being treated as arson by police. Woman dies and man hospitalised after suspected Novichok poisoning\nA woman died and a man was in a critical condition in hospital after suspected exposure to nerve agent, Novichok.\nDawn Sturgess, 44, is thought to have been exposed to the poison in Amesbury on June 30 and passed away on Sunday.\nCharlie Rowley, 45, is no longer in a critical condition, Salisbury District Hospital said, after also being exposed to the nerve agent.\nPolice are investigating a possible link to the case of Russians Sergei and Yulia Skripal, who were poisoned with the same substance in nearby Salisbury in March. Read More North East news LIVE: Latest breaking news, sport, weather, traffic and travel Britain basks!\nThe UK enjoyed a three-week-long heatwave, with temperatures in the south hitting 31.7C (89F) on Sunday, making the country hotter than Barbados.\nThe Met Office is also predicting the warm weather to continue for at least another two weeks, but there will be a break for the next few days as cooler air drifts in, bringing the mercury down to the high teens in the North East.\nAs thousands continued flock to beaches and parks to make the most of the sun, water companies throughout the UK urged customers to use as little water as possible.\nUnusually, there has been little or no rain in the country for three weeks. Shortage of carbon dioxide\nA shortage of carbon dioxide in the food and drink industry could spell a less beer, bacon - and even crumpets - being produced.\nThis has reportedly been caused an unusually high number of factory closures, where the gas is produced.\nThe current shortage of gas is because too many factories have shut at the same time across Europe.\nIt’s also because the high price of natural gas means production has been limited in the UK.\nAs a result, the food and drink industry could see shortages of produce.\nThis is because carbon dioxide is used to slaughter farm animals, package food and make drinks fizzy. Read More Donald Trump UK visit LIVE: Protests in Newcastle for American President trip to Britain Garage boss found guilty of murdering his employee\nMurderer Richard Spottiswood was warned he will be jailed for life after he was found guilty of killing a man found fatally injured in a shallow grave.\nSpottiswood choked the life out of Darren Bonner, 24, by putting him in a headlock in a caravan in Cresswell, Northumberland. Richard Spottiswood (Image: Northumbria Police)\nThe garage boss then transported Mr Bonner’s unconscious body in the back of a former police riot van and dumped him in a shallow grave close to the picturesque village.\nSpottiswood, 34, of Canterbury Way, Jarrow had denied murder, claiming self-defence, but he was unanimously convicted by a jury at Newcastle Crown Court.\nAfter the guilty verdict was returned, Judge Stephen Ashurst told the jury: “In the light of your verdict it will fall to me to sentence Richard Spottiswood.\n“That will be a sentence of imprisonment for life. I’m required to set out and state the minimum period he should serve.” Spotlight on the region for Great Exhibition of the North Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nThousands flocked to the Quayside in June as the Great Exhibition of the North kicked off.\nNewcastle and Gateshead showcased everything that is great about the North as a summer-long event started.\nThe Great Exhibition of the North officially got under way with an extravagant ceremony on June 23 culminating in a fantastic firework display .\nThe overall exhibition includes trails, exhibits and installations across Newcastle and Gateshead.\nHundreds of people from every corner of the North - designers, engineers, artists, musicians, makers, community groups, businesses and universities – have come together to tell the story of the region.\nOver the next 80 days it promises to inspire a summer of love for the region, celebrating its pioneering spirit and the impact of our inventors, artists and designers, to be enjoyed by an estimated three million visitors. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-12T16:05:00.000+03:00", "crawled": "2018-07-12T16:17:58.010+03:00", "highlightTitle": ""}