{"organizations": [], "uuid": "47bb2dffe3d49f3d4cdfb5db348d08cb308bd350", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14772154.ece/ALTERNATES/s1200/Ministers-Attend-Emergency-Brexit-Meeting-After-Backtop-Border-Plan-Meets-Resistance.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/david-davis-resignation-live-brexit-14882624", "country": "GB", "domain_rank": 21960, "title": "David Davis resignation LIVE: Brexit secretary quits, leaving Theresa May's government in chaos", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-09T09:28:00.000+03:00", "replies_count": 0, "uuid": "47bb2dffe3d49f3d4cdfb5db348d08cb308bd350"}, "author": "Tom Eden", "url": "https://www.chroniclelive.co.uk/news/north-east-news/david-davis-resignation-live-brexit-14882624", "ord_in_thread": 0, "title": "David Davis resignation LIVE: Brexit secretary quits, leaving Theresa May's government in chaos", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "ian lavery", "sentiment": "negative"}, {"name": "chi onwurah", "sentiment": "negative"}, {"name": "david davis", "sentiment": "negative"}, {"name": "emily thornberry", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "brexiteer jacob rees-mogg", "sentiment": "none"}, {"name": "tom eden will", "sentiment": "none"}, {"name": "graham brady", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [], "organizations": [{"name": "newcastle central", "sentiment": "negative"}, {"name": "brexit", "sentiment": "negative"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'She will drive the UK right off the Brexit cliff'\nLiberal Democrat Brexit spokesman Tom Brake said:\n“Theresa May has had almost two years to put together a coherent proposal for the future of our country and has wholly failed to do so.\n“With just eight months to go before Brexit, and a new ministerial team being inducted, extending Article 50 is the only viable option left for the Conservative Government.\n“If Theresa May does not act immediately she will drive the UK right off the Brexit cliff. I hope the Prime Minister will see sense and listen to the Liberal Democrat call for a final say on the deal so that we can exit from Brexit.” 14:29 What does David Davis's resignation mean for Theresa May?\nHere are some of the questions being asked:\nHow damaging is this to the Prime Minister?\nThere is no question that losing the man in charge of implementing her Brexit policy just two days after she achieved Cabinet agreement at Chequers is a massive blow to Mrs May. Mr Davis is the seventh minister to leave Mrs May’s Cabinet since last year’s election but the first to quit over a fundamental difference on her Brexit platform. However, Mr Davis has said that he is not seeking to trigger a coup to remove the Prime Minister, and Downing Street insiders indicated that he was seen as doing “the honourable thing” in the light of Mrs May’s announcement that the doctrine of strict collective responsibility was being reimposed on Brexit.\nDoes it mean the end of Mrs May’s premiership?\nThis is far less certain that some of her opponents appear to believe. In order to oust the Prime Minister as Tory leader, some 48 Conservative MPs would have to send letters demanding a vote of no confidence. There are believed to be around 60 backbenchers in the Eurosceptic European Research Group, along with many others who would like to see a “harder” Brexit than the version set out at Chequers last week, making her vulnerable to an anti-EU revolt. However, the ERG’s chairman Jacob Rees-Mogg has said he has not sent a letter to the 1922 Committee, and expects Mrs May to remain in office at least until Brexit day in March 2019. Others may take their lead from him.\nWhy wouldn’t they want to challenge Mrs May?\nThere are a number of issues that may make Eurosceptic critics hold back from an attempt to unseat the PM. Aside from the loyalty which MPs naturally feel towards their leader, many are concerned that Mrs May’s removal could plunge the party into chaos, with no obvious replacement lined up, potentially setting the scene for Jeremy Corbyn to seize power in a new general election. Some Brexiteers think that the most crucial issue is to ensure that Britain actually leaves the EU in March next year, and feel that whatever arrangements Mrs May has secured can always be renegotiated once that point has been reached.\nCould that change?\nThis is a possibility, particularly if big beasts like Boris Johnson or Michael Gove follow Mr Davis out of the Cabinet. A fracturing of unity at the top of the party could test the loyalty of rank-and-file MPs, many of whom have spent the weekend listening to complaints of betrayal from pro-Brexit constituents.\nWhat if she does face a vote?\nIt is far from clear that Mrs May would lose any vote of no confidence. Rebels are by no means certain of securing the backing of 159 Tory MPs which they would need for a successful coup. However, a narrow victory would leave Mrs May as a wounded premier and raise doubts over the viability of her remaining in office.\nWhat does it mean for Brexit negotiations?\nMrs May has said that she wants talks to go ahead with greater intensity and pace once Britain has set its position out in the White Paper due for publication later this week. European Commission president Jean-Claude Juncker promised that the EU would “continue to negotiate in good faith”, while his chief spokesman said Mr Davis’s departure would not affect the approach of Brussels, saying: “We are here to work.” However, Mrs May’s ability to squeeze concessions out of Brussels is likely to be undermined if the Commission and the 27 other member states doubt her ability to get her proposals through Parliament. 14:07 Tom Eden 1922 chair refused to comment on no-confidence vote\nThe chairman of the influential Tory backbench 1922 committee - and the guardian of no-confidence letters - Graham Brady, is refusing to say if any Conservative MPs have submitted letters calling for a no confidence vote in the Prime Minister Theresa May.\nHe said:\n“My view ever since I became chairman of the ‘22 is that it would be entirely improper ever to comment in any way on that subject, because inevitably a commentary could influence the course of events. 13:22 Tom Eden Boris Johnson awol\nThere’s no sign of Boris Johnson at his scheduled appearance, according to the BBC’s Laura Kuenssberg: EU Tom Eden Davis quitting 'won't affect Brexit talks'\nThe Commission’s chief spokesman Margaritis Schinas said the resignation of Mr Davis would not hit the talks.Asked if it was a problem, he replied: “Not for us. We are here to work.”\nMr Schinas said the Commission did “not have a specific comment” about the resignation and refused to be drawn when asked to pay tribute to the outgoing Cabinet minister.\nHe said the Commission was “available 24/7”, including over the summer, to discuss Brexit.\nHe added:\n“In this house it is very clear that our position has always been very cool.\n“We avoided positioning the Commission in terms of psychological elements - concern, enthusiasm, disappointment and so on.\n“ We are here to do a job.”\nMr Junker spoke to Mrs May at 5pm. More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14882624;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-07-09T09:28:00.000+03:00", "crawled": "2018-07-09T11:04:12.000+03:00", "highlightTitle": ""}