{"organizations": [], "uuid": "fa3e570e3fcf16767be00e43d731c7b3152b50d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14760040.ece/ALTERNATES/s1200/Breaking-News-Graphic-Live-Blog-Smaller.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-14890361", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-12T08:00:00.000+03:00", "replies_count": 0, "uuid": "fa3e570e3fcf16767be00e43d731c7b3152b50d3"}, "author": "Tom Eden", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-14890361", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "tom eden", "sentiment": "negative"}, {"name": "lee taylor", "sentiment": "none"}], "locations": [{"name": "durham", "sentiment": "none"}, {"name": "penny ferry bridge", "sentiment": "none"}, {"name": "sands car park", "sentiment": "none"}, {"name": "aykley heads", "sentiment": "none"}], "organizations": [{"name": "durham", "sentiment": "none"}, {"name": "county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A train from Newcastle Central has been cancelled: Gateshead Tom Eden Council's embarrassing £700k car park almost empty\nGateshead Council has said a £700,000 car park it built before granting itself permission was not just for the Great Exhibition of the North , after it has stood almost empty since the event opened. (Image: Newcastle Chronicle)\nThe council was left red-faced last month when it emerged that the 550-space car park had been built without official approval.\nThe authority blamed urgency for the oversight, and said the temporary car park in Quarryfield Road is primarily intended to serve the extra visitors coming to Tyneside for the Great Exhibition of the North between June 22 to September 9.\nHowever, weeks after the launch of the exhibition, the car park still isn’t busy.\nThe council has said the facility - which is temporary with permission to be in place for five years - will be used more as the Gateshead Quays is developed.\nA spokesperson said:\n“We knew we were likely to lose parking spaces on Gateshead Quays for some of the events connected to the Great Exhibition of the North, and also that the starting points for two of the three trails were in Gateshead. We therefore wanted to provide alternative parking for the public, and quickly. But we never intended this car park to be purely for the exhibition.\n“Later this year, PROTO the emerging technology centre opens at Baltic Quarter and construction also starts on a major 54,000 sq. ft. office development, both immediately adjacent to the car park. As well as the building contractors involved in building these developments who will need somewhere to park, there will eventually be around 600 new employees here, and many of those will be looking for somewhere to park their cars.\n“In fact, over the next four or five years we are anticipating a series of major new developments right across the Gateshead Quays area which will not only remove large number of existing parking spaces but will create huge new demand for more.\n“Feedback from potential occupiers suggests that the availability of car parking is an important consideration in deciding where to locate, so having Quarryfield Road ready now means we have everything in place to support those developments.” donald trump Tom Eden Protests to greet Trump's UK visit\nUS president Donald Trump is set to touch down in Britain for a highly controversial visit after sparking a new firestorm on the international stage.\nFresh from a fierce row with American allies at a Nato summit, Mr Trump begins a four day trip to the UK that is expected to leave taxpayers with a police and security bill of up to £10 million.\nTheresa May will host Mr Trump, and his wife Melania, at a lavish dinner at Blenheim Palace on Thursday evening, just days after the US president said the UK was in “turmoil” following the Cabinet resignations triggered by the Prime Minister’s Brexit plans.\nAfter spending the night at the US ambassador’s official residence in Regent’s Park, London, Mr Trump will join the PM at a military base on Friday to observe a joint counter-terrorism exercise involving UK and US special forces.\nThe two leaders will hold talks at the Prime Minister’s country residence of Chequers where Russia, Brexit and the Middle East will top the agenda.\nMr Trump will then travel to Windsor Castle to meet the Queen before heading to Scotland for a private part of the four-day visit, ahead of travelling to Helsinki for a summit with Russian president Vladimir Putin.\nOpponents have threatened mass protests against the visit, but Mr Trump is expected to avoid areas such as central London where demonstrators could gather.\nMrs May will be seeking to improve her often publicly strained relationship with he US president as she pushes for a post-Brexit trade deal with America.\nMr Trump raised eyebrows when he went out of his way to praise Boris Johnson after resigning as foreign secretary, while insisting it was up to the British people whether Mrs May remained in office or not.\nThe US president also suggested his summit with the Russian president could prove to be the easiest part of his European tour compared with the Nato meeting and UK visit.\nAnd tension could be sparked as Mrs May expects the US president to remember the “malign behaviour” of Russia when he meets Mr Putin.\nDowning Street made it clear that Mrs May wants the US leader to raise issues such as the Salisbury nerve agent attack on former spy Sergei Skripal and his daughter Yulia at the meeting.", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14890361;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-07-12T08:00:00.000+03:00", "crawled": "2018-07-12T10:06:57.005+03:00", "highlightTitle": ""}