{"organizations": [], "uuid": "b9b13a1d6b2e7ca053528268706ff0f82f9fc4d9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1770585.ece/ALTERNATES/s1200/lw9T2DkLjpeg.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/local-news/full-andrew-bridgens-stinging-no-1770043", "country": "GB", "domain_rank": 48128, "title": "In full: Andrew Bridgen's stinging no-confidence letter blasts Theresa May's Brexit plan", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-10T19:05:00.000+03:00", "replies_count": 0, "uuid": "b9b13a1d6b2e7ca053528268706ff0f82f9fc4d9"}, "author": "Dan Martin", "url": "https://www.leicestermercury.co.uk/news/local-news/full-andrew-bridgens-stinging-no-1770043", "ord_in_thread": 0, "title": "In full: Andrew Bridgen's stinging no-confidence letter blasts Theresa May's Brexit plan", "locations": [], "entities": {"persons": [{"name": "andrew bridgen", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "negative"}, {"name": "david davis", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "boris johnson", "sentiment": "none"}, {"name": "graham brady", "sentiment": "none"}, {"name": "bridgen", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}], "organizations": [{"name": "west leicestershire tory", "sentiment": "none"}, {"name": "tory", "sentiment": "none"}, {"name": "north west leicestershire", "sentiment": "none"}, {"name": "committee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Could not subscribe, try again later Invalid Email\nAndrew Bridgen is seeking to topple Prime Minister Theresa May over her plan for Brexit.\nThe North West Leicestershire Tory MP said he has no confidence in the Prime Minister and wants to trigger a Conservative leadership contest.\nMr Bridgen, a supporter of a hard Brexit for the UK, has written to the 1922 Committee - a group of backbench Conservative MPs which plays a key role in deciding the Tory leadership – warning the party will be punished at the polls if it follows Mrs May’s current path to exiting the EU.\nThe Government has been thrown into chaos after Mrs May set out a future model for the UK’s relationship with the EU after Brexit agreed by her cabinet at Chequers on Friday. North West Leicestershire MP Andrew Bridgen\nHer softer Brexit triggered the resignation first of Brexit Secretary David Davis, then of Foreign Secretary Boris Johnson and other junior ministers.\nNow Mr Bridgen has written to the chairman of the 1922 Committee Graham Brady saying he had no confidence in Mrs May.\nIf 47 of his Tory colleagues do likewise a leadership contest will be triggered.\nIt is unclear how many other Tory MPs have written similar letter because Mr Brady keeps their existence a tightly guarded secret. poll loading Should Theresa May be removed by the Tories 0+ VOTES SO FAR Yes - we need a stronger PM No - She's trying to prevent a dangerous Brexit What the letter says\nMr Bridgen’s letter, which has been leaked to the media, said: “The negotiations with the European Union appear to have deteriorated into a state of complete capitulation.\n“We have to deliver Brexit or we will be punished at the polls at the next General Election.\n“All we have asked from the Prime Minister is that she sticks to what she has promised on repeated occasions when she declared that ‘Brexit means Brexit’ and pledged to take back control of our money borders and laws. Andrew Bridgen's letter about Brexit and the Prime Minister\n“But it now appears those promises are all a pretence and a charade intended to dupe the electorate which is an insult to their intelligence.\n“Therefore, in the interests of our country and the future of the Conservative Party, I feel the time has come for a new leader as so I am writing this letter to inform you I have no confidence in the Prime Minister.”\nThe Mercury has contacted Mr Bridgen for comment. Previous challenge to David Cameron\nMrs May is the second Tory Prime Minister Mr Bridgen has challenged. Prime Minister Theresa May (Image: Daniel Leal-Olivas /PA Wire)\nIn 2013 he wrote to the 1922 Committee to call for a vote of no confidence in David Cameron.\nAt the time he said: “I have come to the view that although many of our policies are right, whether on welfare reform or reducing the deficit, there is a credibility problem with the current leader,” he said.\n“By pressing ahead with gay marriage and delaying a promise on an EU referendum until he was forced to do so, Mr Cameron has fuelled the rise of UKIP.\n\"We have created our own nemesis.”\nHe later withdrew his letter which failed to attract the support of enough colleagues to trigger a vote. Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}", "https://recommendations.data.tm-awx.com/rhs&quot;,&quot;modularCss&quot;:&quot;true&quot;,&quot;nativeAppBanner&quot;:&quot;true&quot;}}}"], "published": "2018-07-10T19:05:00.000+03:00", "crawled": "2018-07-10T19:24:50.021+03:00", "highlightTitle": ""}