{"organizations": [], "uuid": "389de92d8a373cdba3db5657e29b5285fec0b278", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14371260.ece/ALTERNATES/s1200/IBP_NEC_120314greys_02JPG.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/brexit-concerns-rising-among-north-14906332", "country": "GB", "domain_rank": 21960, "title": "Brexit concerns rising among North East businesses, two surveys report", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-16T02:01:00.000+03:00", "replies_count": 0, "uuid": "389de92d8a373cdba3db5657e29b5285fec0b278"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/brexit-concerns-rising-among-north-14906332", "ord_in_thread": 0, "title": "Brexit concerns rising among North East businesses, two surveys report", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "grey", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "newcastle city centre", "sentiment": "none"}], "organizations": [{"name": "lloyds", "sentiment": "negative"}, {"name": "lloyds bank", "sentiment": "none"}, {"name": "newcastle journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit concerns rising among North East businesses, two surveys report Lloyds and EEF reports highlight concerns over ability for firms to trade in Europe Share Part of the Newcastle City Centre skyline, including Grey's Monument (centre) (Image: Newcastle Journal) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nTwo separate business surveys have reported rising concerns over Brexit in the North East business community.\nThe latest Business in Britain report from Lloyds Bank shows the region having the largest fall in confidence in the UK over the last quarter, while the EEF/BDO annual survey of manufacturing companies also highlights concerns.\nBoth surveys were undertaken before Thursday’s publication of the Government’s White Paper on Brexit, which has eased some fears around companies’ ability to trade overseas.\nLloyds said business confidence in the North East – based on the outlook for sales, orders and profits – has dipped by 13 points since January to 25 points, the largest single drop in the UK.\nUncertainty surrounding Brexit was reported as the single greatest risk to firms in the North East in the next six months, with almost a third of companies polled expecting a negative impact on their business if no trade agreement is reached with the EU.\nKelly Green, Lloyds’ regional director for the North East, said: “There is no doubt that businesses are facing challenges at the moment, with Brexit uncertainty and concerns over global demand highest among them. As a result, confidence has fallen in the first half of this year.\n“But the fact that confidence remains in line with the national average, and is the highest among all the Northern Powerhouse regions, suggests firms are resilient and becoming more comfortable operating in the current uncertainty.\n“While investment and recruitment plans have not fallen as much, firms must still make sure that they are not missing out on the opportunities being created amid the current turbulence.” Read More Hundreds of North East jobs could be lost if shipbuilding contract goes abroad, unions warn\nMeanwhile, the EEF survey highlights a number of positives for the region’s manufacturing sector, with some of the largest growth in job numbers in the UK.\nManufacturers have seen momentum continue to build throughout the past year, culminating in one of its strongest ever output balances, EEF said, with growth coming in especially chemicals and metals.\nBut EEF warned that the region’s economy depends significantly on exports to Europe and would be hard hit by any barriers to trade with the EU. Read More Miller UK overhauls strategy and management team after missing targets\nRichard Halstead, director of member engagement for EEF in the North, said: “The report shows that industry continues to have an increasingly vital role to play in the North East. The last year has seen a strong performance with lofty heights being reached in the second half of last year and it is no surprise to see some easing back in the first half of 2018.\n“There are well documented challenges going forward, not least those facing the automotive and construction supply chains. Furthermore, the progress of Brexit negotiations has the potential to be a factor in the future performance of manufacturers in the North East.\n“Despite this, those companies who invest and innovate will still have the best long term prospects and can contribute to raising the productivity performance of the region and the UK as a whole.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-16T02:01:00.000+03:00", "crawled": "2018-07-16T03:31:07.009+03:00", "highlightTitle": ""}