{"organizations": [], "uuid": "0b857a34bc7dfe34e40d4a48954961b83895f7c5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1824825.ece/ALTERNATES/s1200/0_John-Rogers-auctioneer.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/brexit-could-leave-fish-rotting-1824801", "country": "GB", "title": "Brexit could leave fish rotting on the quayside", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-25T16:17:00.000+03:00", "replies_count": 0, "uuid": "0b857a34bc7dfe34e40d4a48954961b83895f7c5"}, "author": "Keith Rossiter", "url": "https://www.devonlive.com/news/devon-news/brexit-could-leave-fish-rotting-1824801", "ord_in_thread": 0, "title": "Brexit could leave fish rotting on the quayside", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "john rogers", "sentiment": "none"}, {"name": "james marsden", "sentiment": "none"}, {"name": "keith rossiter", "sentiment": "none"}, {"name": "marsden", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brixham", "sentiment": "none"}, {"name": "england", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "marine conservation society", "sentiment": "none"}, {"name": "severn inshore fisheries and conservation authority", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit could leave fish rotting on the quayside Cliff-edge warning from fisheries boss Share Auctioneer John Rogers at Brixham Fish Market (Image: Keith Rossiter) Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA “hard” Brexit could leave piles of fish rotting on the quayside, fishermen have been warned.\n“If they get a hard Brexit, they won’t know what hit them,” fisheries boss James Marsden said during a tour of Brixham fish market yesterday.\nBrixham is England’s top fishing harbour by value of catch landed.\nThe port has almost doubled the value of landings, from £22million three years ago to £40million in 2017 – mostly on the back of a booming cuttlefish fishery. Read More The auction at Brixham Fish Market (Image: Keith Rossiter)\nAbout 90% of the cuttlefish is exported to EU countries.\nMr Marsden is vice chair of the Devon and Severn Inshore Fisheries and Conservation Authority and a board member of the Marine Conservation Society.\n“What happens if we ‘fall off a cliff’ and don’t get a trade deal?” he said. “This market thrives as the moment because it’s able to move fast and transport the fish within hours from here to the end destination. If that can’t happen, it would be very serious for Brixham.”\nBut Jim Portus, chief executive of the South Western Fish Producers Organisation, said: “I believe we’ll end up with a deal with our European colleagues because they also want frictionless trade into the UK. Read More Special forces expert with death wish in stand off with armed cops on Looe Beach A box of small scallops (Image: Keith Rossiter)\n“It’s true that we have a perishable product going to the Continent, but there will be a deal.”\nAlthough some fishermen are pushing for a cliff-edge departure, in which Britain severs its links to the EU on March 30 next year, Mr Portus said: “We are having a transition period and that’s already a done deal.\n“In the EU referendum fishermen just wanted to get out. There’s the desire of the fishing industry, and then there’s the reality.”\nBrixham fish market is leading the way in innovation in the industry. The market was knocked down and rebuilt in 2010, with most of the money coming from the EU and Torbay Council. Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-25T16:17:00.000+03:00", "crawled": "2018-07-25T17:39:30.002+03:00", "highlightTitle": ""}