{"organizations": [], "uuid": "45497850aa583013e7201dd9e9d6545833117bb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14872882.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/chequers-brexit-eu-meeting-may-14872838", "country": "GB", "domain_rank": 21960, "title": "What you need to know about Theresa May's big Brexit meeting at Chequers today", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-06T11:00:00.000+03:00", "replies_count": 0, "uuid": "45497850aa583013e7201dd9e9d6545833117bb8"}, "author": "Simon Meechan", "url": "https://www.chroniclelive.co.uk/news/chequers-brexit-eu-meeting-may-14872838", "ord_in_thread": 0, "title": "What you need to know about Theresa May's big Brexit meeting at Chequers today", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News What you need to know about Theresa May's big Brexit meeting at Chequers today Ministers have to thrash out a general blueprint for Brexit and what our relationship with the EU will look like after the UK leaves the union Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nToday is a very important day in the run up to Britain exiting the European Union .\nPrime Minister Theresa May has gathered her cabinet for a meeting in Chequers, the Government's rural retreat in Buckinghamshire.\nThere's only one topic on the agenda: Brexit . What is happening at Chequers?\nTheresa May's entire cabinet is getting together at Chequers.\nMrs May is attempting to get her Government to agree on an official blueprint for Brexit. Why Chequers? What's wrong with Downing Street?\nChequers, in leafy Buckinghamshire, offers more privacy than Downing Street, as in London reporters and press photographers can linger outside number 10's black door.\nMinisters will be kept at the mansion until they come to agreement. They will eat dinner there and could talk late into the night. Chequers offers more accommodation than Number 10, so it is seen as an ideal venue to rub heads together and reach a final agreement. Read More So what have they got to decide? We already know we're leaving the EU... Theresa May's Cabinet is meeting at Chequers today (Image: PA)\nThe UK needs to decide what its relationship with the EU will be like after Brexit. That includes issues regarding trade and customs, which Tory politicians are split over. So what are their ideas?\nPapers sent to minister reportedly suggest the sticks to a \"common rulebook\" with the EU for trading agricultural and food products.\nThe package could prevent a new trade deal with the US, due to a difference in quality standards, but Downing Street denies it would stop a deal completely. How has this been received?\nHard Brexit Tories are hostile to the idea, with Lucy Allan MP saying : \"This is not Brexit.\".\nBrexit Secretary David Davis is sceptical that the EU will give it the time of day. What about financial services?\nShifting away from EU rules and regulations is likely to result in reduced access for UK firms to European markets. The Government is betting on offsetting that by boosting access to global markets. Will they actually reach an agreement? Chequers, near Ellesborough, Buckinghamshire (Image: PA)\nWith a mix of Brexiteers and Remainers in her Cabinet, it could be a long night for Mrs May.\nSo far, the Prime Minister has managed to hold them together, but it's crunch time and she is going to have to get off the fence, which could strain their truce.\nMrs May says her Government has \"a great opportunity - and a duty\" to reach decisions in order to \"set an ambitious course to enhance our prosperity and security outside the European Union\". Read More Businesses are 'running out of patience' with Government over Brexit Could there be resignations?\nTensions are undoubtedly running high. Mr Davis has teetered close to the brink of resignation before and may do so again given his reservations about the plan, while all eyes will be on Foreign Secretary Boris Johnson, to see how he responds.\nOn the other hand, Chancellor Philip Hammond and Business Secretary Greg Clark would resist any Brexit deal which would hit jobs and the economy. What happens next? When will the EU look at the deal? Theresa May was battling to keep her Cabinet together ahead of a crunch Brexit showdown at her country retreat (Image: PA)\nAny blueprint agreed by ministers is set to be published in a Government White Paper next week. Mrs May wants to step up talks with Brussels once its published.\nEU leaders, who have been frustrated that it has taken the UK Government so long to set out its plan, have called for \"realistic and workable\" proposals.\nBrussels is expected to decide on any deal at an EU summit in October. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-06T11:00:00.000+03:00", "crawled": "2018-07-06T12:02:34.020+03:00", "highlightTitle": ""}