{"organizations": [], "uuid": "0c2d4e95949f19bd79a9c3d56c913b7eea9547a6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14870741.ece/ALTERNATES/s1200/GWR_-NJL_050718summit_01.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/business-secretary-makes-plea-business-14870700", "country": "GB", "domain_rank": 21960, "title": "Business Secretary makes plea for business-friendly Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-05T17:06:00.000+03:00", "replies_count": 0, "uuid": "0c2d4e95949f19bd79a9c3d56c913b7eea9547a6"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/business-secretary-makes-plea-business-14870700", "ord_in_thread": 0, "title": "Business Secretary makes plea for business-friendly Brexit", "locations": [], "entities": {"persons": [{"name": "greg clark", "sentiment": "none"}, {"name": "clark", "sentiment": "none"}, {"name": "carlos ghosn", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "north", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "brexit cabinet", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "jaguar land rover", "sentiment": "none"}, {"name": "airbus", "sentiment": "none"}, {"name": "jaguar landr", "sentiment": "none"}, {"name": "bmw", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}, {"name": "boiler shop", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get business updates directly to your inbox + Subscribe Thank you for subscribing!\nBusiness Secretary Greg Clark has used a speech on the eve of the crunch Brexit Cabinet meeting to issue a plea for a business-friendly relationship with the EU.\nMr Clark was speaking at the Northern Powerhouse Business Summit, part of the Great Exhibition of the North, just hours after the country’s largest car maker, Jaguar Land Rover, joined a chorus of businesses warning over the impact of Brexit.\nThe country’s biggest car-maker said a bad Brexit deal would cost the company more than £1.2bn in profit each year, adding that its UK investments would be “in jeopardy” if faced with the “wrong outcome”.\nIts warnings come after a similar concerns from Airbus and BMW, and just a few days after Nissan chairman Carlos Ghosn said the company had been left “in the dark” on Brexit and couldn’t make decisions on future investments for its massive plant in Sunderland.\nSpeaking in the Boiler Shop in Newcastle today, Mr Clark said: “To the investors and workers in our car industry, whether they are at Jaguar Landrover in the West Midlands or Nissan not far away in Sunderland, you are a big part of Britain’s success. We will listen to you with the seriousness and respect due to people who give to our country more than you take.\n“We are determined to make sure that you can continue to prosper and to invest in Britain. Read More Businesses need access to top talent after Brexit, Sage boss says\n“Just take the North East’s contribution, a region that is based on trade and always has been. From cars to chemicals, local jobs and livelihoods rely on supply chains that cover the continent.\n“We have more than 120,000 men and women who work in manufacturing here in the North East and almost half a million people working across the North. Those jobs in manufacturing are increasingly sophisticated and depend on the excellence of our design, the creative sector and the universities we have represented here to come together to form a cluster of excellence that is increasingly successful.\n“Services alone in the North East employ nearly a million people and nearly four million people across the North. So as we leave the European Union we need a comprehensive agreement that doesn’t involve tariffs or customs frictions for manufactured goods.”\nMr Clark’s comments came ahead of a crucial meeting of the Cabinet on Friday to finalise a white paper on Brexit.\nHe also used his speech to announce a £420m sector deal for the construction industry which aims to increase the use of technology in the building trade to produce homes quicker and more efficiently.\nHe said the deal would increase the number of apprenticeships in the construction sector and also aim to tackle the problem of late payment and supply chain bullying that are rife in the sector, making reference to some of the practices that came to light during the collapse of Carillion. Read More Businesses are 'running out of patience' with Government over Brexit\nHe said: “The construction industry is fundamental to growing our economy as we build to invest in our future. Major infrastructure projects like HS2 and the commitment to deliver 1.5m homes by 2022 mean that we need a construction sector that can drive innovation, delivering homes and infrastructure quicker.\n“As buildings account for around 30% of total emissions, we also want to ensure that we are at the global forefront in designing and building smart, energy efficient and affordable homes and buildings through the Clean Growth Grand Challenge, saving families money on their bills.\n“This Sector Deal is supported by the biggest Government investment in construction for at least a decade and will drive economic growth and create well-paid highly-skilled jobs in every part of the UK.”\nMr Clark followed Bank of England Governor Mark Carney, who had warned that Brexit would be harmful to people’s livelihoods in the short term at least, and that a trade war sparked by the US could also disrupt the global economy. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-05T17:06:00.000+03:00", "crawled": "2018-07-05T17:32:00.000+03:00", "highlightTitle": ""}