{"organizations": [], "uuid": "6239fefc6e6dee0f5d58356f160118b71fe14b51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13786842.ece/ALTERNATES/s1200/Childcare-cost.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nursery-schools-fear-theyll-forced-14866366", "country": "GB", "domain_rank": 21960, "title": "Nursery schools fear they'll be forced to close if they don't get Government funding", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-04T20:00:00.000+03:00", "replies_count": 0, "uuid": "6239fefc6e6dee0f5d58356f160118b71fe14b51"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nursery-schools-fear-theyll-forced-14866366", "ord_in_thread": 0, "title": "Nursery schools fear they'll be forced to close if they don't get Government funding", "locations": [], "entities": {"persons": [{"name": "shelagh morpeth", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "negative"}, {"name": "department for education", "sentiment": "none"}, {"name": "millfield community nursery", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Nursery schools fear they'll be forced to close if they don't get Government funding A Sunderland headteacher says she's been forced to do four jobs because the nursery can't afford staff Share A child with a carer (Image: PA) Share Get daily updates directly to your inbox + Subscribe\nHundreds of nursery schools could be forced to close because of funding cuts, headteachers warn.\nNursery heads from across the country came to Westminster to urge Education Ministers to give them more support.\nShelagh Morpeth, headteacher of Millfield Community Nursery in Sunderland, said: “If we don’t get that money then I can’t see that a lot of nursery schools would actually survive.”\nIt follows the introduction of a new funding system for nursery schools in 2017.\nHeadteachers warned that this did not provide enough money for them to stay open, and the Department for Education agreed to provide an extra £60m in “supplementary funding” for nursery schools across the country until 2019-20.\nBut there is no guarantee the supplementary funding will continue to be paid after 2020 - and nursery heads say they will be forced to shut their doors and turn children away if the cash dries up.\nMs Morpeth said: “We have had to cut back and cut back on staff.\n“So I now not only do the headteacher’s job, I have to do the job of a teacher too.\n“I’m also the special educational needs co-ordinator, and we also have a day-care where I am the day-care manager as well. That is because of budget cuts.”\nThe school also faced a series of cost increases, she said.\nThat included paying business rates, previously paid by the local council, wage increases and pension contribution increases.\nFunding for children with special needs had also been cut, she said.\n“Our budget is just being cut and cut and cut.”\nThe schools want the Government to confirm that the funding will continue when Chancellor Philip Hammond publishes his spending review in the Autumn.\nOnly 400 council-funded nursery schools now remain open in England, providing around 30,000 places for children. More than six out of ten are in deprived areas.\nChildren and Families Minister Nadhim Zahawi said: “Maintained nursery schools make a valuable contribution to improving the lives of some of our most disadvantaged children – that’s why we are providing £60m a year up until 2020. Read More Brexit will mean higher prices in the North East - and we will be harder hit than London\n“We also support low income families with access to high quality early years through our 15 hours free childcare for all three-and-four-year-olds, with 30 hours available for working families, in addition to the 15 hours a week for the most deprived two-year-olds, which almost 750,000 children are already benefiting from.\n“I regularly meet with Maintained Nursery School leaders and we continue to work closely together to better understand the value these nurseries offer, so I would urge councils not to make premature decisions on the future of these nurseries as this work continues.”\nBut some Conservative MPs have expressed concern about the future of nurseries.\nTory MP Robert Halfon, Chair of the Education Select Committee, told BBC Radio 4’s Today programme: “If the bean counters at the Treasury are looking at this they need to look at it in terms of cost benefit because if they don’t invest in maintained nurseries now it will store up huge problems later on.” Read More The crisis with local council funding and how the Government has no plan to help\nConservative MP Craig Tracey warned “maintained nursery schools need certainty as soon as possible, so they can plan their futures.”\nHe said that children with disabilities and medical needs would suffer most if money wasn’t found, and said one headteacher in his constituency had told him the school received an inclusion grant of £100 for pupils with high level special needs, but one-to-one support costs £160 a week. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-04T20:00:00.000+03:00", "crawled": "2018-07-04T22:58:14.017+03:00", "highlightTitle": ""}