{"organizations": [], "uuid": "01e06d2510009431641af89f2ee83fc5f2b9f44b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14920893.ece/ALTERNATES/s1200/0_Jonathan-Wallace.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-tyne-devolution-deal-branded-14920746", "country": "GB", "domain_rank": 21960, "title": "North of Tyne devolution deal branded a “bureaucratic, shambolic mess”", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-18T07:00:00.000+03:00", "replies_count": 0, "uuid": "01e06d2510009431641af89f2ee83fc5f2b9f44b"}, "author": "Daniel Holland", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-tyne-devolution-deal-branded-14920746", "ord_in_thread": 0, "title": "North of Tyne devolution deal branded a “bureaucratic, shambolic mess”", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "negative"}, {"name": "daniel holland", "sentiment": "none"}, {"name": "jonathan wallace", "sentiment": "none"}, {"name": "martin gannon", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "gateshead civic centre", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "gateshead council annual meeting", "sentiment": "none"}, {"name": "tyne combined authority", "sentiment": "none"}, {"name": "st james", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north of tyne combined authority", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North of Tyne devolution deal branded a “bureaucratic, shambolic mess” The upcoming formation of the North of the Tyne Combined Authority has been condemned Share Daniel Holland Local Democracy Reporter 05:00, 18 JUL 2018 Gateshead Council Annual Meeting at Gateshead Civic Centre, Jonathan Wallace, Lib Dem Leader (Image: Newcastle Chronicle) Share Get daily updates directly to your inbox + Subscribe\nThe North of Tyne devolution process has been labelled a “bureaucratic, shambolic mess”.\nCouncillors in Gateshead - the borough which led calls to abandon a region-wide devolution deal in 2016 - condemned the upcoming formation of the North of Tyne Combined Authority at a cabinet meeting on Tuesday morning.\nAs reluctant consent was granted to set up a new joint transport committee for the North East, council leader Martin Gannon said that the deal amounted to “complete dysfunction”. Read More Multi-million pound sports hub near St James' Park 'will inspire next generation of football stars'\nNewcastle, Northumberland and North Tyneside struck a £600m deal with the government last year to break away from the existing North East Combined Authority, but will still have to work with neighbouring councils on regional matters including the Tyne and Wear Metro.\nCoun Jonathan Wallace, Gateshead Lib Dem leader, said: “This is an illustration of the shambolic mess that the North East is now in with devolution.\n“It was meant to bring all of these things together and here we have a proposal to set up something that mirrors what we have already got.”\nHe likened the situation to the government’s Brexit negotiations and blamed the North East Labour councils for mismanaging the issue.\nCoun Wallace added: “I have said before that we should have been part of the settlement. We will spend years picking up the cost and creating new bodies to do the job that should be done through a combined authority.”\nCoun Gannon responded that the devolution offer from the government was not good enough. Read More Newcastle Council bosses give green light for city to become world leader in digital technology\nHe said: “You are right that what is coming through is completely and utterly dysfunctional. We have the North of Tyne, the South of Tyne, Tees Valley, a LEP, and this joint transport committee. That is at least five bodies - it is not devolution, it is complete dysfunction.”\nCoun Gannon also warned that there is an increasingly short window in which to set up the new combined authority in time for a scheduled May 2019 mayoral election.\nThe creation of the North of Tyne body must be approved by Parliament, which is soon to go on its summer recess, and will return in September before being again interrupted by party conference season.\nHowever, the North of Tyne authorities say that they expect the Parliamentary process to start before summer recess and conclude in the autumn, enabling elections to be held in 2019. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-18T07:00:00.000+03:00", "crawled": "2018-07-18T08:00:36.029+03:00", "highlightTitle": ""}