{"organizations": [], "uuid": "1b37c8f3c38ab6ebb1ed909930f942a8d12535a8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14867597.ece/ALTERNATES/s1200/President-Trump-Delivers-Remarks-At-Salute-To-Service-Dinner-In-West-Virginia.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/donald-trump-uk-tour-protests-14867435", "country": "GB", "domain_rank": 21960, "title": "Theresa May urged to take on Donald Trump when he visits the UK - with protests planned", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-05T07:00:00.000+03:00", "replies_count": 0, "uuid": "1b37c8f3c38ab6ebb1ed909930f942a8d12535a8"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/donald-trump-uk-tour-protests-14867435", "ord_in_thread": 0, "title": "Theresa May urged to take on Donald Trump when he visits the UK - with protests planned", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "queen", "sentiment": "none"}, {"name": "roberta blackman-woods", "sentiment": "none"}, {"name": "mr trump", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "scotland", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nTheresa May has been told to challenge Donald Trump - instead of inviting him for tea in Downing Street.\nThe US President is to visit the UK next week. He’s due to meet the Queen and the Prime Minister, and to play golf in Scotland.\nBut he’s also expected to be met by massive protests.\nCity of Durham MP Roberta Blackman-Woods told the Prime Minister that the UK should be telling Mr Trump to rethink his policies.\nSpeaking in the House of Commons , she said: “President Trump has recently locked up children in cages, instigated a ban on Muslims, stalled action on climate change and started trade wars, and he is now threatening women’s reproductive rights. President Donald Trump (Image: Getty Images North America)\n“Should the Prime Minister not be challenging his divisive and damaging policies, instead of inviting him for tea and cakes at No. 10?”\nMrs May told her: “I have been very clear, and I have said in the House, for example, that the action taken against child migrants was not unacceptable and is not something we would do here in the UK.\n“We did not consider that acceptable.\n“She wants me to challenge the President of the United States. What better way to challenge the President of the United States than to sit down and talk to him?” Read More Brexit will mean higher prices in the North East - and we will be harder hit than London\nProtests are planned in the North East next week.\nOne is scheduled to take place in Newcastle on Thursday, July 12 at 5pm, while the other is planned at Durham Miners’ Gala on Saturday, July 14. Durham Miners Gala 2017 in Durham City Centre\nNationally, major ‘Stop Trump’ protest is to take place in central London on Friday, 13 July.\nProtesters will march down Oxford Circus and down Regent Street before holding a rally in Trafalgar Square from 5pm to 7pm. Read More Nursery schools fear they'll be forced to close if they don't get Government funding\nAlthough protests were planned as soon as the visit was suggested, opposition to Mr Trump may be particularly fierce after it emerged that children had been separated from their parents at detention centres for undocumented migrants in the US.\nThe high level of security required for the visit means London’s Metropolitan Police is to receive help from other forces.\nThe Home Office will pay for extra costs incurred by West Midlands Police, but cannot replace missing personnel. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-05T07:00:00.000+03:00", "crawled": "2018-07-05T10:25:20.004+03:00", "highlightTitle": ""}