{"organizations": [], "uuid": "1b427915cadb330a66ad399cac0fa9069a8cb3e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14830191.ece/ALTERNATES/s1200/Brexit.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/deal-could-expanded-battery-plant-14855550", "country": "GB", "domain_rank": 21960, "title": "Deal that could have expanded battery plant at Nissan Sunderland collapses", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-02T16:52:00.000+03:00", "replies_count": 0, "uuid": "1b427915cadb330a66ad399cac0fa9069a8cb3e5"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/deal-could-expanded-battery-plant-14855550", "ord_in_thread": 0, "title": "Deal that could have expanded battery plant at Nissan Sunderland collapses", "locations": [], "entities": {"persons": [], "locations": [{"name": "china", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "nissan sunderland", "sentiment": "negative"}, {"name": "gsr", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Deal that could have expanded battery plant at Nissan Sunderland collapses Chinese group GSR had been expected to buy the 300-job battery plant in a $1bn deal but Nissan has pulled out Share Workers at Nissan (Image: PA) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA $1bn deal that could have seen the growth of electric battery plant at Nissan’s Sunderland plant has collapsed at the last minute.\nThe Japanese carmaker had reached agreement to sell its rechargeable battery business to Chinese invesment group GSR capital in a deal last year that was said to be close to $1bn.\nGSR said it wanted to expand production facilities, including those at Sunderland, and open a new plant in China.\nBut with the sale expected to be completed at the end of June, it has now emerged that Nissan pulled the plug on the transaction, following a number of delays and other setbacks.\nThe deal would have seen around 300 employees, plus staff at a similar plant in the US and development teams in Japan, transferring to the new owners. The Nissan factory in Sunderland (Image: Unknown)\nThe immediate future of those staff has not been made clear, though it seems likely Nissan will look for alternative buyers in what is a lucrative and growing area of the automotive business.\nA Nissan spokesman said: “The transaction was not completed on June 29.\n“Nissan is committed to transparent communications with our valued employees, suppliers and partners, and running our battery business at the highest level. We will continue to evaluate our battery business strategy in pursuit of optimal products and business structure.”\nThe battery unit at Sunderland was first set up in 2007, three years ahead of the first electric Leaf being produced at the plant. Read More Nissan has been left 'in the dark' on Brexit and warns of slow decline\nWhen the proposed deal was first announced, Nissan said the sale of the Automotive Energy Supply Corporation (AESC) subsidiary would allow it to concentrate on production of electric vehicles while GSR drove forward the battery business. Nissan chief executive Hiroto Saikawa described the deal as a “a win-win” for AESC and Nissan.\nReports on the deal’s collapse have cited complications around the ownership of AESC and a lack of funding from the Chinese firm. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-02T16:52:00.000+03:00", "crawled": "2018-07-02T20:34:57.036+03:00", "highlightTitle": ""}