{"organizations": [], "uuid": "46b657135665c57f7a92e0ce9773c94a5149b9c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/incoming/article1746152.ece/ALTERNATES/s1200/35485136.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/exeter-university-professor-urging-farmers-1745992", "country": "US", "title": "Why this Exeter University professor is urging farmers to adapt to shopper's changing eating habits", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-04T12:24:00.000+03:00", "replies_count": 0, "uuid": "46b657135665c57f7a92e0ce9773c94a5149b9c0"}, "author": "Athwenna Irons", "url": "https://www.devonlive.com/news/devon-news/exeter-university-professor-urging-farmers-1745992", "ord_in_thread": 0, "title": "Why this Exeter University professor is urging farmers to adapt to shopper's changing eating habits", "locations": [], "entities": {"persons": [{"name": "matt cardy", "sentiment": "none"}, {"name": "michael winter obe", "sentiment": "none"}, {"name": "michael winter", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "exeter university", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why this Exeter University professor is urging farmers to adapt to shopper's changing eating habits University of Exeter rural policy expert, Professor Michael Winter, will launch his new report in London today Share With the agricultural industry facing an uncertain future post-Brexit, a leading rural policy expert is urging farmers to be \"proactive\" in creating a new food culture (Image: Matt Cardy / Getty Images) Share Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email Get daily updates pushed directly to you Subscribe to notifications See our privacy notice\nBritish farmers could find business opportunities and help promote better public health if they adapted to recent radical changes in diet – such as the growth in veganism – a top rural expert has said.\nAgricultural practice and policy should take account of new trends in the way people cook and eat, according to a new report being launched today (July 4) by Professor Michael Winter OBE, from the University of Exeter.\nThis health-orientated food culture could allow farmers to increase production of pulses, cereals, fruit and vegetables in the UK, suggests Professor Winter, at a time when many people are now consuming too many refined carbohydrates, added sugars, fats and ultra-processed foods. Professor Michael Winter OBE, Professor of Land Economy and Society in the Centre for Rural Policy Research at the University of Exeter\nHe explained: “Farmers should be proactive, helping to create a new food culture which nourishes and sustains health and wellbeing, building further on UK farmers’ proven ability to produce safe, nutritious and affordable food in response to market demand. As demand changes so UK farmers need to respond with confidence to the concerns and opportunities in our changing society.”\nSpeaking to the Western Morning News ahead of today’s Nuffield Farming Lecture in Westminster, at which Professor Winter will deliver the 66-page report, titled Changing Food Cultures: Challenges and Opportunities for UK Agriculture, he said the farming industry should not be arguing about veganism.\n“I think everybody needs to calm down,” he said. “We have a very diverse population with diverse dietary requirements. At the end of the day we all need to eat and as diets change, I think opportunities present themselves. Read More Dangerous hornets make a live nest inside farmer's tractor\n“Veganism remains a minority position but it is growing. It is indicative of a much wider set of concerns about ‘meat’ that find expression in vegetarianism and more widely either in reduced or ‘guilty’ meat consumption.”\nHe added: “It is, of course, impossible to say how far this trend will go. But is the appropriate response of farming to mount a vigorous advertising campaign to encourage more meat eating and so put itself at odds with dietary recommendations? I don’t think so. But nor do I consider the farming industry should sit back and fatalistically accept a declining market position.\n“The meat sector is one example of where the industry needs to understand and adapt to change. Legitimate health concerns over the consumption of meat, especially red meat, will not go away.” Farmers will need support through the Brexit process and as new agricultural policies emerge\nProfessor Winter’s report also suggests the need for more to be done to ensure the UK has “nutritional security” as well as food security, and this should be seen as a public good in the reform of the Common Agricultural Policy (CAP) and how agricultural subsidies are delivered to farmers.\nThere is a need for stronger and shorter food supply chains focussed on the nutritional qualities of food, he said, and quality assurance schemes should be deepened to include nutritional quality at the core.\n“Human health should take centre stage when society is making policy decisions about food and agriculture,” said Professor Winter. “I’m optimistic that this shift will take place, but of course farmers will need support through Brexit as new government policies emerge designed to ensure a strong, sustainable, competitive and food health-orientated industry.” Read More Organic farm near Plymouth is growing vegetables from fish poop\nThe report details how, in the UK people are now drinking less whole milk, and more semi-skimmed milk. There is been a decline in the consumption of fresh fruit and vegetables. People are eating meat as part of ready meals and convenience products. People spend less time preparing food and eating at home.\nProfessor Winter notes there is significant scope for further development within the UK’s fresh produce sector, and expand production of a range of soft fruit, apples, pears and plums, nuts and vegetables.\nThe report adds that Britain imports around £2.3 billion worth of fresh vegetables, but only exports goods worth £109million. In the case of fresh fruit the respective figures are £3.6 billion and £113million. Professor Winter believes there is an opportunity for British farmers to expand production of a range of soft fruit, apples, pears and plums (Image: Richard Austin)\n“Here in the South West we used to produce a lot more horticultural products, such as apples in areas like the Tamar Valley,” said Professor Winter. “I think we can move back towards a more mixed farming regime. Also in the South West, other than grass if there’s one thing we do grow well it is trees and with improvements in plant breeding, I think we could definitely produce more fruit and nuts.”\nBut Professor Winter said any reforms would need to take into account the challenges to agriculture caused by Britain’s exit from the European Union. “My focus on food and health does not mean that I am anything other than deeply concerned about the challenges facing farming, particularly lowland livestock farming, as we face Brexit,” he said.\n“The challenges facing UK agriculture are uneven productivity and its dependence on CAP payments. Any ask of UK farmers to respond to food cultural shifts and to the health agenda requires a proper appreciation of the industry and the difficulties it faces. Merely to heap yet more ‘demands’ on a beleaguered sector without such an understanding is inappropriate and unhelpful.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-04T12:24:00.000+03:00", "crawled": "2018-07-04T13:25:19.000+03:00", "highlightTitle": ""}