{"organizations": [], "uuid": "101c378aa4248d3a58c888f48a1746d8560ce37e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14863375.ece/ALTERNATES/s1200/Jordan-Pickford-celebrates-following-Englands-victory.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jordan-pickford-hailed-north-east-14863323", "country": "GB", "domain_rank": 21960, "title": "Jordan Pickford hailed a North East hero after historic World Cup penalty save", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-04T11:27:00.000+03:00", "replies_count": 0, "uuid": "101c378aa4248d3a58c888f48a1746d8560ce37e"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jordan-pickford-hailed-north-east-14863323", "ord_in_thread": 0, "title": "Jordan Pickford hailed a North East hero after historic World Cup penalty save", "locations": [], "entities": {"persons": [{"name": "jordan pickford", "sentiment": "negative"}, {"name": "eric dier", "sentiment": "none"}, {"name": "david ospina", "sentiment": "none"}, {"name": "jordan henderson", "sentiment": "none"}, {"name": "carlos bacca", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "colombia", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "sunderland afc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Jordan Pickford hailed a North East hero after historic World Cup penalty save The Sunderland-born goalkeeper was crucial in England's win over Colombia, sparing the blushes of another Mackem in the process Share Click to play Tap to play The video will start in 8 Cancel Play now Get Sunderland AFC updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nIn the end, it was two Mackems who shaped England’s course to World Cup penalty glory.\nWhen ex-Sunderland man Jordan Henderson saw his penalty saved by Colombia’s goalkeeper David Ospina, it looked for all the world as if the nation’s shootout misery would continue.\nBut it was another former black cat who sent the country into delirium and paved the way for a famous victory: Jordan Pickford.\nThe Washington-born 24-year-old, who lived and played on Wearside until last year, pulled off an incredible save to give England a chance to wrap the game up.\nDiving early and re-adjusting in the air, he managed to get a strong hand to Carlos Bacca’s effort, allowing Eric Dier to calmly put away the decisive spot kick. MOSCOW, RUSSIA - JULY 03: Jordan Pickford of England celebrates following his sides victory in the 2018 FIFA World Cup Russia Round of 16 match between Colombia and England at Spartak Stadium on July 3, 2018 in Moscow, Russia. (Photo by Dan Mullan/Getty Images)\nOn a night which could have been remembered for sheer misery for Henderson, it was another product of Sunderland AFC’s academy who got things back on track.\nSpeaking after the match, he conceded his fellow Mackem had pulled him out of a hole and his intervention proved crucial for England. Read More Jordan Pickford's PE teacher speaks of pride as goalkeeper sets to star for England at World Cup\nFor Pickford, it’s another step on his meteoric rise from Sunderland’s second string keeper to England number one and Premier League regular.\nIt was also a redemptive moment and ended some of the criticism he’s received for his performances at this tournament, including some claims he was at fault for Belgium’s winner in the final group (scored, ironically, by another former Sunderland player).\nThis morning, there’s little doubt among England fans that the country owes a debt to Pickford for his shootout heroics.\nThe Telegraph’s headline says he has become “a giant among English goalkeepers” while the Times calls him “absolutely magnificent”.\nFormer England goalkeepers took to Twitter to praise him too.\nDavid Seaman posted: “Welcome to the club #jordanpickford #penalty #pens WHAT A SAVE!!! COME ON ENGLAND!!!” Jordan Pickford during the 2018 FIFA World Cup Russia Round of 16 match between Colombia and England (Getty)\nPeter Shilton, who holds the record for most England appearances, said: “Brilliant Jordan Pickford, what a great result it’s about time we won a shootout!\n“Eat your heart out all the Pickford doubters.”\nSocial media was inundated with praise for the keeper, who seconds before Colombia equalised had pulled off an amazing save which went strangely unnoticed in the context of the game’s frantic final minutes.\nBBC host Jeremy Vine quipped: “If Jordan Pickford’s left hand touched Brexit, it would be sorted.”\nInterviewed after the match, Pickford told reporters: “I have got power and agility. I don’t care if I’m not the biggest keeper because it’s about being there in the moment and making the save, and I was.\n“It is all about the set position and I got a hand to it. I did all my research.\n“We knew we had this game, even if it had to go to penalties, we knew we were capable of winning.”\nThe months of talk about who should be England’s number one goalkeeper seem a long, long time ago now. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-04T11:27:00.000+03:00", "crawled": "2018-07-04T13:24:15.012+03:00", "highlightTitle": ""}