{"organizations": [], "uuid": "e39a1fe51e6bca4863711a8c8511caa2e04d6dae", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1753495.ece/ALTERNATES/s1200/28435293.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/east-midlands-chamber-warns-brexit-1753456", "country": "GB", "domain_rank": 48128, "title": "East Midlands Chamber warns Brexit \"could be\" hitting Leicestershire business confidence - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.001, "site_type": "news", "published": "2018-07-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "e39a1fe51e6bca4863711a8c8511caa2e04d6dae"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/east-midlands-chamber-warns-brexit-1753456", "ord_in_thread": 0, "title": "East Midlands Chamber warns Brexit \"could be\" hitting Leicestershire business confidence - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "mark carney", "sentiment": "none"}], "locations": [{"name": "leicestershire live east midlands chamber", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "east midlands chamber", "sentiment": "none"}, {"name": "grove park", "sentiment": "none"}, {"name": "enderby", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "topps tiles", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}, {"name": "bank of england mark carney", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "East Midlands Chamber warns Brexit \"could be\" hitting Leicestershire business confidence Quarterly Chamber survey suggests businesses cutting back on investing - though Bank of England governor more upbeat Share Governor of the Bank of England Mark Carney feeling upbeat Share Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nUncertainty over Brexit could be responsible for a drop in business confidence, according to the latest quarterly Chamber of Commerce survey.\nAfter a strong start to 2018, the region’s businesses said they were feeling less positive in the second three months of the year, according to research.\nEast Midlands Chamber said while the shift was marked, it was too early to say if it is significant or the beginning of a trend.\nOnly this month, Topps Tiles in Grove Park, Enderby , reported a drop in sales in the last three months as shoppers continue to cut down on their spending.\nHowever, it comes at the same time that Bank of England governor Mark Carney said he was seeing more – not less – confidence in the UK economy as a whole.\nIn a speech in Newcastle, Mr Carney said: “Overall, recent domestic data suggest the economy is evolving largely in line with the May Inflation Report projections, which see demand growing at rates slightly above those of supply and domestic cost pressures building.” Scott Knowles, chief executive of East Midlands Chamber\nHe said new data had given him “greater confidence” that weak growth in the first three months of the year “was largely due to the weather”.\nHe also said household spending and sentiment had “bounced back strongly”.\nOne aspect of the Chamber’s second Quarterly Economic Survey of the year was a drop in the investment intentions of businesses, particularly in manufacturing.\nA spokesman said: “The reason for the decline, however, is not clear. It is thought it could reflect increasing uncertainty over Brexit.\n“Where investment continues, there are mixed messages about whether it is defensive – with firms seeking to safeguard against future developments – or offensive, such as investing in overseas facilities to negate any potential negative impact of border delays and tariffs that could result from the UK leaving the EU.”\nThe Chamber said its survey suggested business confidence in future turnover and profitability was at its lowest for a year – although still “strongly positive”.\nHaving said that, firms were more bullish about their own prospects than those of the wider economy – suggesting an “optimism bias”.\nThe survey suggested inflationary pressures have softened following highs last year, with fewer businesses anticipating increases in their own prices in the next three months. Read More Expert team will help businesses deal with Brexit\nThis could be because the effect of the falling value of sterling against other currencies appears to have run its course.\nThe same number of businesses – around two-thirds – continued to take on staff, with 60 per cent struggling to find the right people.\nScott Knowles, chief executive of the East Midlands Chamber , said: “This survey has shown a fall in the State of the Economy Index but it is too early to say whether it is significant among previous fluctuations or indicative of a trend.\n“The East Midlands continues to outperform other parts of the country, demonstrating good levels of resilience despite uncertainties. Read More\n“To what extent being a strong player in a weak economy can be deemed positive is open to interpretation. Read More Topps Tiles sales down as shoppers rein in spending\n“From a business perspective, there seems to be a very real risk that we are sleepwalking into Brexit when we should be grabbing the bull by the horns to make sure the future needs of business – the creators of jobs and wealth – are being heeded.\n“Businesses cannot afford to sit back and let Brexit happen to them.” Like us on Facebook ", "external_links": [], "published": "2018-07-06T03:00:00.000+03:00", "crawled": "2018-07-06T08:23:35.004+03:00", "highlightTitle": ""}