{"organizations": [], "uuid": "13a61c69b64800faf754f3262f97300fedb31a96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1285876.ece/ALTERNATES/s1200/Storm-damage-at-Dawlish-damage-to-the-railway-tracks-and-road-at-Riviera-Terrace-and-Sea-lawn-Terrace-Dawlish-2014.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/public-spending-slammed-scandal-devon-1768540", "country": "GB", "title": "Public spending slammed as a 'scandal' by Devon business boss", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-10T15:32:00.000+03:00", "replies_count": 0, "uuid": "13a61c69b64800faf754f3262f97300fedb31a96"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/public-spending-slammed-scandal-devon-1768540", "ord_in_thread": 0, "title": "Public spending slammed as a 'scandal' by Devon business boss", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "tim jones", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "news public", "sentiment": "none"}, {"name": "scape group", "sentiment": "none"}, {"name": "cornwall business council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Public spending slammed as a 'scandal' by Devon business boss The region is fourth from the bottom for investment, shows new research from Scape Group, the public sector procurement specialist Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe South West is among the worst off regions in the UK for spending on public buildings, road and rail.\nThe region is fourth from the bottom for investment, shows new research from Scape Group, the public sector procurement specialist.\nIt reveals that over the past twenty years, the region has had £18.20billion, about £3,315 per person, way behind London and the North East, which comes out top of the table. Read More The 50 biggest businesses in Devon - revealed\nTim Jones, chairman of the Devon and Cornwall Business Council, said: \"This is a public scandal that we are trying to run with our hands tied behind our backs.\n\"How, with such small change, are we able to develop our economy and make an adequate contribution to UK Plc?\"\nHowever, infrastructure spending has increased over the decades from £0.93 billion in 1997 to £1.10 billion in 2017\nWatch Ben Bradshaw at the Exeter Chamber lunch Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nThe figure is based on construction output on infrastructure, which measures the value of construction activity on public and private infrastructure projects. Tim Jones, Chairman of Devon and Cornwall Business Council\nTim Jones, chairman of the Devon and Cornwall Business Council, said: \"This is a public scandal that we are trying to run with our hands tied behind our backs.\n\"How, with such small change, are we able to develop our economy and make an adequate contribution to UK Plc?\" Three big Devon public projects happening in Devon\nOceansgate Marine Hub, Plymouth\nValue: Phase 1 £7.8million\nCompletion: Phase 1 delivered by April 2018\nWork on two rows of industrial units and a three-story office block began in January 2017.\nThe area, once the heart of Devonport, had been destroyed and was then turned into the post-war South Yard naval site. It will become offices, labs and light industrial units.\nThe Enterprise Zone marine hub is expected to give Plymouth’s economy a mighty shot in the arm, providing world class facilities for marine manufacturing and engineering companies.\nWith two more phases to follow the project has already attracted so many firms the overall scheme could be completed within five years creating thousands of jobs.\nRailway resilience project, Dawlish\nValue: £15million\nCompletion date: Ongoing investigation work\nNetwork Rail has a programme of improvements to protect the line between Exeter and Newton Abbot to improve resilience over the next century.\nAnd although the investigations are being paid for by the Department of Transport, no funding has been secured for the actual ‘spade in the ground’ work and it will have to go through public consultation and the planning process.\nUltimately, Network Rail is investigating a preferred option to push the line further out to sea and to stabilise the base of the cliffs. The go-ahead depends on public consultation and government funding.\nNorth Devon Link Road improvements\nValue: £93million\nCompletion: Yet to be confirmed\nTransport Secretary Chris Grayling has approved a series of works to the North Devon Link Road to better connect the area to the rest of the country.\nMore than £83million of government funding has been confirmed to pay for upgrades on the A361 between South Molton and Bideford.\nThe extra £10 million for the project will come from Devon County Highways.\nThe plans include widening three sections of the A361 between Barnstaple and South Molton, with two lanes of travel in one direction and a single lane in the opposite direction. Upgrades to a number of junctions and improved connections will also provide \"a much needed boost to North Devon as a place to do business\".\nThe report comes after Labour MP Ben Bradshaw told business leaders in Exeter that empty promises on rail investment in Dawlish was a threat to Exeter and Devon.\nHe said: “We have had very little compared with London and the North and we keep banging on about it but we still don’t have a promise of a meaningful solution to the Dawlish railway problem.\n“We get a pretty bad deal when it comes to regional development funding and if you look at infrastructure, railways are a classic example.” In 2016, Chris Grayling Secretary of State visited cliffs and seawall near to smugglers lane, Dawlish, Director Route Asset Management (Western) at Network Rail Mike Gallop (left) Chris Grayling, and MP Sarah Wollaston. (Image: Andy Styles)\nTransport secretary Chris Grayling said in May that work to protect the Westcountry main railway line at Dawlish is “the most important infrastructure project in the country”.\nAnd yet, four years and four months after the only main line west of Exeter was severed for weeks in the February 2014 storm, the Government is still only at the stage of drawing up a feasibility study to deliver on its promise to solve the problem.\nThe South West receives £212 a head annually in railways funding, compared to £1,943 in London. £93million has been pledged: An image from the outline business case for improving the North Devon Link Road (Image: Devon County Council)\nNew data reveals that despite record investment in infrastructure, the construction supply chain has not seen an equivalent increase in activity.\nScape’s Essential Infrastructure report reveals that UK construction output on infrastructure, which measures the value of construction activity on public and private infrastructure projects, has increased by just £6.4bn or £70 per person in real terms between 1997 and 2017. Read More Ten multi-million pound projects that are transforming Devon and Cornwall\nThe report analysed publicly available Office for National Statistics (ONS) and Northern Ireland Statistics and Research Agency (NISRA) construction output data, adjusted for inflation, over the past two decades. Construction output is a key measure of UK Gross Domestic Product (GDP) and shows the value of work being undertaken by construction companies.\nLondon has seen the most construction output on infrastructure projects across the UK in the past two decades (£54.14bn). However when analysing the data relative to the population of each region, the North East is the most active region relative to its size. Per person in 2017 the North East experienced 40% more construction output on infrastructure projects than London, whilst the North West saw 27% more – suggesting that these regions are catching up with the capital and ending the traditional North-South divide.\nIn London infrastructure output spiked from 2010, closely aligned to investment around the Olympic Games and Crossrail. Output has since dropped down to pre-2010 levels, whilst other regions are experiencing increased per capita output.\nMark Robinson, Scape Group Chief Executive, said: “This data clearly illustrates that the north-south divide in England, starts to disappear when construction output is calculated per person. To encourage the increased delivery of infrastructure in areas where output has been low in recent years we need to continue to drive forward the devolution agenda. The metro mayors have a vital role to play but at the same time we need to encourage local authorities to work together to deliver infrastructure that meets their common ambitions and aspirations. We recently passed the 10 month countdown on Brexit negotiations and it is more vital than ever that Great Britain is able to demonstrate its economic strength, reverse the negative swing in Foreign Direct Investment and prove that, we have an infrastructure plan in place to keep UK Plc in business.” Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-10T15:32:00.000+03:00", "crawled": "2018-07-10T15:49:28.010+03:00", "highlightTitle": ""}