{"organizations": [], "uuid": "83e937472126a0fe1c824ec8ada0bb290f60dd06", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14943917.ece/ALTERNATES/s1200/0_Untitled-design-1.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/chi-onwurahs-petition-demanding-mike-14946003", "country": "GB", "domain_rank": 21960, "title": "Chi Onwurah's petition demanding Mike Ashley stops 'exploiting' Newcastle United goes to Commons", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-24T16:02:00.000+03:00", "replies_count": 0, "uuid": "83e937472126a0fe1c824ec8ada0bb290f60dd06"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/chi-onwurahs-petition-demanding-mike-14946003", "ord_in_thread": 0, "title": "Chi Onwurah's petition demanding Mike Ashley stops 'exploiting' Newcastle United goes to Commons", "locations": [], "entities": {"persons": [{"name": "commons chi onwurah", "sentiment": "negative"}, {"name": "mike ashley", "sentiment": "negative"}, {"name": "chi onwurah", "sentiment": "negative"}, {"name": "onwurah", "sentiment": "none"}, {"name": "rafa", "sentiment": "none"}, {"name": "rafa benitez", "sentiment": "none"}], "locations": [], "organizations": [{"name": "newcastle united", "sentiment": "negative"}, {"name": "house of commons", "sentiment": "none"}, {"name": "nufc", "sentiment": "none"}, {"name": "newcastle united fc thank", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "magpies", "sentiment": "none"}, {"name": "newcastle united fc", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Chi Onwurah's petition demanding Mike Ashley stops 'exploiting' Newcastle United goes to Commons The Newcastle MP presents petition after Magpies fans warn 'if Rafa goes we go' Share Click to play Tap to play The video will start in 8 Cancel Play now Get Newcastle United FC updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA petition demanding Newcastle United owner Mike Ashley stops “exploiting” the club has been presented to the House of Commons.\nNewcastle Central MP Chi Onwurah officially delivered the petition, which demands action to ensure the billionaire club owner supports the team and fans.\nIt follows the creation of a separate online petition by NUFC fans, in which they warn: “If Rafa Goes We Go.”\nThe fans say that they’ve “had enough” of Newcastle United owner Mike Ashley, who is also the founder and majority owner of retail giant Sports Direct, and won’t spend any money at either Sports Direct or Newcastle United FC until manager Rafa Benitez signs a long-term deal, or Mike Ashley sells the club.\nMs Onwurah said: “A petition needs to have a certain wording in order to be presented to Parliament. That meant I couldn’t bring the Rafa petition directly to Parliament, so I put together a petition of my own to ensure that the issue was raised in the House of Commons. Chi Onwurah (Image: Newcastle Chronicle)\n“It’s a way of bringing the concerns of fans directly to Parliament.”\nHer petition accuses Mr Ashley of failing to provide the investment in players, training facilities and community engagement that Newcastle United needs. Read More Fans claim to be blocked on Twitter by Sports Direct for backing #IfRafaGoesWeGo\nIt states: “Football is an integral part of Newcastle upon Tyne’s social, economic and cultural wellbeing... fans of Newcastle United are heavily invested both financially and emotionally in the success of the team.\n“The current manager Rafa Benitez needs the support of both fans and the club’s owner... this support should include investment in players, training facilities and community engagement.” Mike Ashley (Image: PA)\nMs Onwurah, a Magpies fan, said: “This is to give a voice to the many constituents who have contacted me about this.\n“Many of my constituents are heavily invested in the club and they want a voice to speak to their concerns and fears about the current ownership, and the need to invest in the club. Read More Mick Quinn airs his frustration at Newcastle's lack of transfer activity\n“And I also want to put pressure on the club’s management, and on Mike Ashley, to make it clear that these concerns will continue to be raised to be raised publicly, if we don’t get the support for Rafa that the fans want.”\nIn the past week, a fresh fans’ movement against Mr Ashley’s regime has gathered pace. Newcastle United manager Rafa Benitez before his side's friendly against St Patrick's Athletic (Image: ©INPHO/Bryan Keane)\n“If Rafa Goes We Go” sprung up on­­line amid uncertainty surrounding the manager’s position at St James’ Park , with contract talks seemingly up in the air. Fans backing the movement are pledging to boycott games if the club fails to hold on to what many believe to be its prized asset.\nMs Onwurah has been a long-standing critic of Mr Ashley. Read More Theresa May's deal 'may not give us the Brexit we voted for'\nIn 2013, she took the decision to boycott games at St James’ Park after Newcastle United struck a sponsorship deal with payday loan firm Wonga.\nThe boycott lasted four years and only ended after the club cut its ties with the controversial finance company.\nMr Ashley put the club up for sale last year, but a proposed deal with businesswoman Amanda Staveley and PCP Capital Partners fell through.\nThe “If Rafa Goes We Go” petition can be found at: https://www.activism.com/en_GB/petition/if-rafa-goes-we-go-nufc-fans/197321 Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}", "https://www.activism.com/en_GB/petition/if-rafa-goes-we-go-nufc-fans/197321"], "published": "2018-07-24T16:02:00.000+03:00", "crawled": "2018-07-24T16:39:44.009+03:00", "highlightTitle": ""}