{"organizations": [], "uuid": "851cef59cd89afac84daf7111d9575154593e140", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14860524.ece/ALTERNATES/s1200/NHS-staffing-reports.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/health/nhs-trainees-love-health-service-14859982", "country": "GB", "domain_rank": 21960, "title": "NHS trainees on why they love the health service and what the future holds", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-03T16:38:00.000+03:00", "replies_count": 0, "uuid": "851cef59cd89afac84daf7111d9575154593e140"}, "author": "Simon Meechan", "url": "https://www.chroniclelive.co.uk/news/health/nhs-trainees-love-health-service-14859982", "ord_in_thread": 0, "title": "NHS trainees on why they love the health service and what the future holds", "locations": [], "entities": {"persons": [{"name": "kate snowd", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "news nhs", "sentiment": "positive"}, {"name": "nhs", "sentiment": "positive"}, {"name": "sunderland university", "sentiment": "none"}, {"name": "university of sunderland", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News NHS trainees on why they love the health service and what the future holds The NHS turns 70 on Wednesday, so we spoke to Sunderland University trained nurses, students and staff about challenges facing the health service Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing!\nThursday marks 70 years since the NHS launched and stated providing free healthcare to millions of Britons.\nWe’ve been brought into this world and cared for in by legions of highly trained doctors, nurses and staff since the NHS’s birth in 1948.\nSince then, the NHS has changed a lot, and is certainly going through challenges at the moment. On Saturday, staff marched through London to demand more funding for the health service. The Government has promised to inject a further £20bn every year into the NHS , but sceptics say that money won’t be enough.\nSo what does the future hold?\nWe spoke to University of Sunderland students, an NHS leader and academic about what’s next for the state's health service. Kate Snowdon: Trainee Paramedic at University of Sunderland University of Sunderland trainee paramedic Kate Snowdon What originally made you want to be part of the NHS?\nI liked the idea of working out in the community and going to different places. Previously I worked in pubs and restaurants, so I knew I enjoyed working in a fast-paced environment and with the public. I also wanted a job that made me feel like I was contributing to something bigger than myself. What is your earliest memory of needing/using the NHS?\nI think my earliest memory of using the NHS would be visiting the dentist as a young child. I didn’t like going very much as I was quite nervous but the prospect of getting a sticker and a lolly for my time seemed like a solid investment. Read More Nearly every NHS GP surgery in England is short of a family doctor, warns top medic What makes you most proud when it comes to the NHS?\nI think the nature of our work promotes a very tight knit community which is evident in the way that front line staff supports each other. We attend to a lot of routine issues, transfers and rewarding emergencies with positive outcomes. But there are times when we face challenging situations involving violence, deteriorating patients and traumatic events. We are professionals and I am sure we all endeavour to act as such but equally we are simply human. There will always be jobs that are upsetting, frightening or stressful. Our colleagues are the first to help us deal with these emotions and I see it at work daily. We support, comfort and praise one another. It occurs from all the healthcare professions not just between ambulance workers. I think it reminds us that we are not alone in our profession but part of a larger team. This makes me proud to be part of the NHS. What is the most rewarding thing about being part of the NHS?\nFor me I think the most rewarding thing about being part of the NHS is seeing the difference I have made to someone else. Most of the time this comes from small acts of consideration and not great heroics. Simple things like ringing relatives for the patient to inform them of the situation, helping a patient to pack a bag, checking that the property is locked up and the telly is switched off can really help to reduce a patient’s anxiety. One patient I attended to was worried about leaving her cats alone while she went to hospital. Her neighbour was a close friend, so we arranged for the neighbour to check in with the cats every few hours and make sure they were fed. The patient was so grateful and happy. It was only a small gesture but it dramatically improved that patient’s experience, the change in her attitude was evident as she joked and laughed the whole way to hospital. What is the most frustrating thing about being part of the NHS?\nI find it particularly difficult when patients have experienced long delays in receiving an ambulance. A lot of the time I am unaware of the delay until I arrive on scene and I am met with frustration and anger from the patient or their relatives. I can completely empathise with their frustrations and feel powerless to change that for them. It is an extremely complex situation and can be caused by a number of factors which are beyond my control. The only thing I can do is focus on the task at hand and provide the best service I can. Read More Paramedics will be issued body cameras to help protect against violent patients Where do you hope the NHS will be in 10 years’ time?\nI would really like the NHS to be adopted as a role model across the world for the delivery of government run health services free at the point of use. But within the UK, I hope that the NHS will be better funded to cope with the expanding needs of an ageing population and advances in technology. I think that due to the changes in demographic I hope there will be more services available in the community and that people will be able to access care that is currently hospital based, in their own homes. I think that technological advances will be integrated to care. I hope that automation of routine tasks will mean that staff have more time to provide personalised and individual patient care. Do you think the NHS will still be here in another 70 years?\nYes, there will always be a need for a co-ordinated, national healthcare organisation. The NHS is a cornerstone of British society and is close to the hearts of the majority of people. It is difficult to predict how the NHS will adapt to future challenges especially due to the exponential changes we have seen since its creation. I think it will change and develop but it will still be here. If you could do another job anywhere in the NHS – what would it be, and why?\nI honestly don’t think I would rather do another role but my own. I love my job and feel privileged to work for the ambulance service. Naturally I have good and bad days but I wouldn’t want to do anything else. Ken Bremner: Chief Executive of City Hospitals Sunderland Foundation Trust and University of Sunderland Honorary Graduate (Image: DAVID JAMES WOOD PHOTOGRAPHER 2017 davidjameswoodphotographer@yahoo.com +447903225674) What originally made you want to be part of the NHS?\nIt was a commitment to public service. What is your earliest memory of needing/using the NHS?\nI think it was having my tonsils removed, aged seven, at Glasgow Royal Infirmary. What makes you most proud when it comes to the NHS?\nFantastic service, free to all and delivered by committed and highly skilled staff. Read More What is the most rewarding thing about being part of the NHS?\nImproving people’s health What is the most frustrating thing about being part of the NHS?\nNegative headlines about the very small number of things that don’t go as planned. Where do you hope the NHS will be in 10 years time?\nStill here, still free at the point of care but a better balance between hospitals and community care. Do you think the NHS will still be here in another 70 years?\nYes! If you could do another job anywhere in the NHS – what would it be, and why?\nNothing beats this one – but if I had to choose then NHS Chief Executive because it can influence the lives of millions of people, patients and staff. Cassie Hicks: Student nurse at University of Sunderland University of Sunderland student nurse Cassie Hicks What originally made you want to be part of the NHS?\nSeeing the care both my granddads have received and seeing how much pressure and stress the NHS is under, I thought I could help. I’m a people person and love to know what’s going on, so I knew I could make a good contribution What is your earliest memory of needing/using the NHS?\nBeing in hospital myself in a children’s ward, being sent home before having to go onto an adult ward. This was scary and all the staff were amazing. From then on, I had to use the NHS for follow up appointments until I was better. What makes you most proud when it comes to the NHS?\nHow every member of staff regardless of shortages still puts patients at the heart of healthcare and still ensures every patient gets the care they need and deserve. What is the most rewarding thing about being part of the NHS?\nGiving care to the patients and seeing them get better or even just giving them good news. When someone is in hospital they are at their most vulnerable and to see them get better just makes you smile. What is the most frustrating thing about being part of the NHS?\nThere aren’t enough staff within the NHS to deal with the casualties which come in, it’s frustrating when you have to border patients out of the ward to get others in. I believe every patient is equal. Where do you hope the NHS will be in 10 years time?\nI hope the NHS is still here in 10 years time and that more funding is put into it to ensure patients are still at the heart of the system, as well as staff stress levels being lowered. Do you think the NHS will still be here in another 70 years?\nI would hope the NHS will still be here in 70 years but if we don’t get funding and more nurses and doctors within the trusts then there is a high chance it may not be. This could cause so many problems for patients who use the services regularly. If you could do another job anywhere in the NHS - what would it be, and why?\nI wouldn’t choose another job in the NHS, I would stay as a nurse. I believe nursing is the first port of call for a patient’s care. Dr Yitka Graham, Senior Lecturer in Health Services and NHS Engagement, at the University of Sunderland What originally made you want to get involved in working with the NHS?\nI have always been interested in health, having worked alongside the NHS for most of my career. I worked for many years in pharmaceuticals before moving into academia, and it was this experience that made me want to continue to work with, and in the NHS as an academic researcher. What is your earliest memory of needing/using the NHS?\nWhen I first moved to the UK, I needed to register with a GP, and the staff at the surgery I chose were so helpful in getting me settled in. Read More NHS boss says health service is planning for all possible Brexit scenarios What makes you most proud when it comes to the NHS?\nI am proud that the NHS is free at the point of access, and strives to provide a high standard of care under very difficult circumstances. What is the most rewarding thing about being involved with the NHS?\nWorking collaboratively with my NHS colleagues to identify, carry out and implement research that makes a positive difference to patient care and supports staff. What is the most frustrating thing about being involved with the NHS?\nMy response is probably what the majority of my NHS colleagues would say, in that lack of resources. But to put a positive spin on it, it is these lack of resources that often bring about fantastic research questions, so we can work together to find realistic solutions to these. Where do you hope the NHS will be in 10 years time?\nI hope that many of the current difficulties will be resolved, with positive solutions to many of the existing difficulties implemented and sustained for both patient and staff benefit. Do you think the NHS will still be here in another 70 years?\nI strongly hope so and I think many of my NHS colleagues feel the same. If you could do a job anywhere in the NHS – what would it be, and why?\nI would do exactly the job I do now. The role I have within the NHS is constantly evolving in response to what is needed which makes it very interesting, and I work with some fantastic people who are a constant source of inspiration and support. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-03T16:38:00.000+03:00", "crawled": "2018-07-03T17:42:56.008+03:00", "highlightTitle": ""}