{"organizations": [], "uuid": "e3e2dae79426fc00c93ab0548890831bf6398f41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14944741.ece/ALTERNATES/s1200/0_Theresa-May-Brings-Cabinet-To-The-North-East.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-deal-not-give-14944599", "country": "GB", "domain_rank": 21960, "title": "Theresa May's deal may not give us the Brexit we voted for, warns Anne-Marie Trevelyan", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-24T11:35:00.000+03:00", "replies_count": 0, "uuid": "e3e2dae79426fc00c93ab0548890831bf6398f41"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-deal-not-give-14944599", "ord_in_thread": 0, "title": "Theresa May's deal may not give us the Brexit we voted for, warns Anne-Marie Trevelyan", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "anne-marie trevelyan", "sentiment": "negative"}, {"name": "mrs trevelyan", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}], "organizations": [{"name": "armstrong wo", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Prime Minister Theresa May answers questions during a Q&A session with employees at the Armstrong Works engineering facility (Image: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nTheresa May’s proposed Brexit deal might not give the British public what they voted for in the EU referendum, according to a Tory MP.\nAnne-Marie Trevelyan, Conservative MP for Berwick-upon-Tweed , is the latest Tory to criticise the deal agreed by the Cabinet at the Prime Minister’s country house, called Chequers.\nShe said: “I have some concerns as to whether this first offer to the EU can actually achieve what the British electorate voted for.”\nMrs Trevelyan also admitted that the Government had been slow to set out its plans for Brexit , leading to employers becoming nervous.\nShe said: “There has been a lack of focus on some of these areas of preparation from some quarters, and this has, quite understandably, made the business community nervous as to whether all the right systems would be in place in time for the 29 March 2019 deadline.”\nAnd she said the Government was right to prepare for the possibility of leaving the EU on March 29 next year without a trade deal.\nThis would mean trading with the EU on the basis of rules set out by the World Trade Organisation (WTO), which apply when countries have no specific agreement about how to trade. Read More Labour councillors 'uniting' over plans to stop them choosing council leaders\nMrs Trevelyan said: “I was very pleased to hear the Prime Minister confirm in her Chequers communique ... that she understands that being prepared for any outcome is vital.\n“She stated very clearly that preparedness must be stepped up immediately so that would safely take the WTO route if necessary.\n“Being genuinely prepared for a WTO outcome is the sign of a leader planning ahead. Having an insurance policy to fall back on, just in case a fuller deal is not ready, is absolutely imperative.” Conservative MP for Berwick Anne-Marie Trevelyan (Image: Newcastle Chronicle)\nThe MP campaigned to leave the European Union and sat om the board of Vote Leave, the official leave campaign in the 2016 referendum.\nShe is a Parliamentary Private Secretary to Gavin Williamson, the Defence Secretary.\nIn a lengthy article published on her website, she said that the Government’s current proposals would only be the start of the process of negotiating a deal.\nBut she stressed that it would still be possible to trade with the EU without one.\nShe said: “I believe that the present white paper is only the start of the process of coming to a final deal which can respect the UK’s red lines and the EU’s four pillars, and find a new mutually beneficial direction whilst the UK looks out once again to a global trading perspective.\n“Whatever the final deal looks like, there must be reciprocity and a fair and positive relationship framework for the new post-Brexit world we will be trading in.\n“And if no deal can be achieved which works for everyone before we leave, then the PM will have made certain that the UK is prepared to leave in March 2019 on WTO terms.\n“No doubt if that were to be the outcome, the discussions for a free trade deal with the EU post-Brexit would continue.\n“It is worth remembering that a trade deal is note necessary for trade to take place. Trading is between a willing buyer and seller – and international rules underwrite that.” Read More Department for Transport consider cutting rail services to Northumberland\nDavid Davis, the former Brexit Secretary, and Boris Johnson, the former Foreign Secretary, both resigned from the Cabinet in protest against the Chequers deal.\nAnd Dominic Raab, the new Brexit Secretary, has suggested he was still trying to persuade members of the Cabinet to back it.\nHe said: “I want to make sure we can persuade everyone - grassroots, voters, parliamentary party and ministers, including in the Cabinet - that we’ve got the best deal and the best plan to get the best deal.”\nBut he insisted a deal with the EU can be reached by October, when he spoke on BBC1’s The Andrew Marr Show.\nMr Raab is to return to Brussels for more Brexit talks on Thursday. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-24T11:35:00.000+03:00", "crawled": "2018-07-24T15:36:45.013+03:00", "highlightTitle": ""}