{"organizations": [], "uuid": "34788275a9a79f591195e893f4143215809f01df", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14869824.ece/ALTERNATES/s1200/CFR_NJL_050718carney_01.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/economy-poised-between-bumpy-smooth-14869690", "country": "GB", "domain_rank": 21960, "title": "Economy poised between 'bumpy and smooth paths' warns Bank of England governor Mark Carney", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-05T14:57:00.000+03:00", "replies_count": 0, "uuid": "34788275a9a79f591195e893f4143215809f01df"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/economy-poised-between-bumpy-smooth-14869690", "ord_in_thread": 0, "title": "Economy poised between 'bumpy and smooth paths' warns Bank of England governor Mark Carney", "locations": [], "entities": {"persons": [{"name": "mark carney mark carn", "sentiment": "negative"}, {"name": "mark carney", "sentiment": "negative"}, {"name": "thomas", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "u.k.", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "bank of england", "sentiment": "negative"}, {"name": "northern powerhouse business summit", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Economy poised between 'bumpy and smooth paths' warns Bank of England governor Mark Carney Mark Carney was speaking in Newcastle at the second day of the three-day Northern Powerhouse Business Summit Share Mark Carney at the Northern Powerhouse Business Summit in Newcastle's Boiler Shop (Image: Thomas Jackson/TyneSight Photographic) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing!\nBank of England governor Mark Carney has used a speech in Newcastle to warn that the economy is poised between ‘bumpy’ and ‘smooth’ paths.\nSpeaking at the Northern Powerhouse Business Summit, part of the Great Exhibition of the North, he warned that a potential global trade war sparked by the US could be hugely damaging while Brexit would hit the U.K. economy in the short term at least.\nBut he said that a ‘smooth path’, which would see current good economic conditions continuing, was most likely.\nIn those circumstances, he said, interest rates were likely to rise this year, albeit gradually and by small amounts.\nAfter referencing the strengths of the North East’s automotive and offshore energy sectors, he stressed the importance of maintaining global supply chains after Brexit.\nHe said the North East economy had performed well in recent years, closing the gap on the rest of the country in wages and employment. Mark Carney, Governor of Bank of England, addresses the Northern Powerhouse Business Summit Boiler Shop on July 5, 2018 in Newcastle (Image: Getty Images Europe)\nBut he said more needed to be done to ensure prosperity was shared by everyone, especially in places like the North East.\nHe said: “The way that gets solved is partly through a strong UK economy but also with the types of issues being addressed here: skills, thinking about what happens next and the right global linkages.” Read More Businesses are 'running out of patience' with Government over Brexit\nMr Carney also said a Three Lions win at the World Cup would represent an “unalloyed, unadulterated absolute good” for the UK economy, while joking that he will start wearing waistcoats like England football boss Gareth Southgate.\nMr Carney, who was wearing a Three Lions lapel badge, was asked by a delegate about the economic impact of an England win.\nHe said: “It would be an unalloyed, unadulterated absolute good. Everything would be good.”\nMr Carney praised the England team’s work ethic, humility and its innovation, adding: “This is a pleasure to watch right now, so we are all behind them.”\nWhen the event host said “In Gareth we trust”, Mr Carney replied: “I will get my waistcoat this afternoon.” Read More Businesses need access to top talent after Brexit, Sage boss says\nHis comments come on day two of the Great Exhibition of the North, the three-day business summit which kicked off at Newcastle’s Boiler Shop in Newcastle on Wednesday, July 5.\nDay one saw Sage CEO Stephen Kelly describe how the region’s businesses need access to top talent if they are to meet the aims of the Northern Powerhouse. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-05T14:57:00.000+03:00", "crawled": "2018-07-05T17:14:06.004+03:00", "highlightTitle": ""}