{"organizations": [], "uuid": "ba319ebc0d0bce964c044068cd7f8428e8e16861", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1831777.ece/ALTERNATES/s1200/1_AWP_040718_Rosie_Smith__1jpg.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/bank-england-agent-rosie-smith-1831733", "country": "GB", "domain_rank": 48128, "title": "Bank England Agent Rosie Smith is on a mission to find out how economy is doing", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-30T07:00:00.000+03:00", "replies_count": 0, "uuid": "ba319ebc0d0bce964c044068cd7f8428e8e16861"}, "author": "leicestermercury", "url": "https://www.leicestermercury.co.uk/news/business/bank-england-agent-rosie-smith-1831733", "ord_in_thread": 0, "title": "Bank England Agent Rosie Smith is on a mission to find out how economy is doing", "locations": [], "entities": {"persons": [{"name": "rosie smith", "sentiment": "negative"}, {"name": "rosie", "sentiment": "none"}, {"name": "richard tresidder", "sentiment": "none"}, {"name": "angela ward", "sentiment": "none"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}], "organizations": [{"name": "bank england", "sentiment": "negative"}, {"name": "bank", "sentiment": "none"}, {"name": "bank’s monetary police committee", "sentiment": "none"}, {"name": "bank of england", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Bank England Agent Rosie Smith is on a mission to find out how economy is doing Three or four times a year, the East Midlands representative attends the Bank committee that determines base rates Share Rosie Smith is the new East Midlands agent of The Bank of England (Image: Angela Ward) Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe Bank of England’s new agent for the East Midlands is Rosie Smith. She talks to business reporter Richard Tresidder.\nRosie Smith feels she is back on home territory. She is the new East Midlands agent for the Bank of England, a region where she was deputy until eight years ago and where she met her husband. It is also where she lives.\nHer job is to talk to businesses and other organisations and gather market intelligence about the regional economy, so that she can brief her London head office about what is going on on a local level.\nThree or four times a year, she will attend the Bank’s Monetary Police Committee which monitors the state of the nation’s economy, notably inflation, and determines base rate.\nRosie has replaced Alistair Cunningham who recently retired after eight years in the East Midlands job.\nShe has been in the post now for less than two months.\nOriginally from Kent, she joined the Bank in 1986.\nShe has continued to live in a small Leicestershire village ever since, even while working in Newcastle and London – all the while taking a casual economist’s interest in her local economy. Governor of the Bank of England Mark Carney has been feeling upbeat\nFor two years, Rosie worked for the Bank’s Prudential Regulation Authority, a financial services regulatory body, supervising banks and building societies.\nThis was followed by two years involved with strategic staff management.\nLiving away from home during the week while pursuing a career as a working mother – she has two sons – was hard, she said.\nBut she has welcomed seeing the regeneration that has taken place in the region’s main cities.\nShe said: “Living closer to Leicester, I see it moving ahead quite quickly on the back of Richard III and Leicester City’s success. It is suddenly on the map.\n“Nottingham has its castle and Robin Hood, its history there.”\nMindful of its use of public money, the Bank of England’s East Midlands office recently moved to the University of Nottingham’s Jubilee campus.\nRosie said: “I did my MBA at the university business school between 1999 and 2002.\n“When I graduated, it was one building and a library. Now the campus is a site of innovative buildings and ideas – a community.”\nRosie said listening to some of the region’s fledgling firms was like “touching the future”.\nShe said: “It is fantastic to be part of that.”\nSo what does the job of agent entail?\n“It is about understanding the economy of the East Midlands so when our policymakers in London decide what to do with interest rates and financial policy, they are doing it in as fully informed a way as they can. Rosie Smith (Image: Angela Ward)\n“Data will tell you one thing. Looking at the past, we can work out if there are any patterns to understand the economy.\n“You can use data to forecast but we add in information from the people who make the economy happen. For example, businesses tell us about their own level of optimism, perhaps that they are delaying the construction of a new warehouse until they feel more confident.\n“Two years later, when you look at the data, it shows up as a drop in investment spend. The Bank hears about it a long time before it happens.”\nIntelligence gathered by Rosie and the other agents across the country will give a sense of whether the economy is on the up, flattening out, or on the way down.\nShe said: “We talk to the policy makers regularly face to face. We are the conduit for information.\n“There are always current issues we are looking into such as understanding uncertainty and what is driving it. We look at productivity and inflationary pressures because the Bank has a target for inflation.”\nDrivers of productivity are complicated, she said, but simply, if the economy is to grow, productivity has to increase.\nOver 20 years, she says the role of an agent has changed – it is not just about finding out facts but about probing behind them.\nThe financial crash of 2008/9 changed the way the Bank looked at things, she said. “We no longer just talk to businesses but have expanded our umbrella to embrace voluntary organisations, charities, schools, those who work with a wide range of people in the economy so we understand what is going on in the whole economy.\n“Universities will provide information on innovation, exports and the ideas they have which filter down into the economy. It is absolutely fascinating.” Alistair Cunningham recently retired after eight years in the East Midlands job\nEducation remains key to progress, she said, and must stay ahead of the economy and teach children what they need for their futures.\n“It has always been difficult to get that right, though. We want our children to learn about the things they can apply in their careers. What do those things look like? What the next thing is teaches us a lot. Read More East Midlands Chamber warns Brexit \"could be\" hitting Leicestershire business confidence\n“People are talking about artificial intelligence and robotics. It will be very exciting over the next few years to see what happens.”\nOn his first visit to the region five years ago, the Bank’s Governor Mark Carney described the East Midlands as the bellwether of the nation’s economy. Read More Massive World Cup boost for Leicester pubs, restaurants and shops\nRosie said: “It has an incredibly diverse economy. In Lincolnshire, it’s farming and seaside towns, in Derbyshire it is heavy engineering and Notts is culture, innovation and healthcare.”\nAs the interview ends, Rosie’s attention turns to other matters. The Governor is visiting the region at the invitation of Notts MP John Mann. She is naturally anxious that her boss is fully briefed. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}"], "published": "2018-07-30T07:00:00.000+03:00", "crawled": "2018-07-30T09:16:25.006+03:00", "highlightTitle": ""}