{"organizations": [], "uuid": "71b3dea963147fd824bd7d100c47c3626d056c5c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14898236.ece/ALTERNATES/s1200/JS155247807.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14898217", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Battle for Sky heats up as Comcast increases bid to £26bn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-12T10:15:00.000+03:00", "replies_count": 0, "uuid": "71b3dea963147fd824bd7d100c47c3626d056c5c"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14898217", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Battle for Sky heats up as Comcast increases bid to £26bn", "locations": [], "entities": {"persons": [{"name": "hakan enver", "sentiment": "none"}, {"name": "morgan mckinley", "sentiment": "none"}, {"name": "enver", "sentiment": "none"}], "locations": [{"name": "london", "sentiment": "none"}], "organizations": [{"name": "comcast", "sentiment": "negative"}, {"name": "coreena ford city", "sentiment": "negative"}, {"name": "morgan mckinley financial services", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford City job openings down amid Brexit uncertainty\nLondon’s financial services industry suffered a 29% drop in job openings in the year to June as Brexit uncertainty continues to dampen hiring in the capital.\nA report by Morgan McKinley shows the number of jobs available last month dropped by nearly a third year-on-year, while those seeking jobs tumbled 35%. The figures were slightly more promising on a month-on-month basis, with the amount of jobs available up 4%, but the report warned over celebrating too soon. “No-one should uncork any champagne bottles just yet,” Hakan Enver, the managing director of Morgan McKinley Financial Services, said. “Businesses still have a lot of pressing questions about their post-Brexit future. “But with talks of a deal finally ramping up, optimism is slowly beginning to return.” Month-on-month, the number of professionals on the job hunt increased 29% last month, marking the first job-seeker spike outside January in two-and-a-half years. Mr Enver said it signalled a rebound in “extraordinary confidence in London’s financial services jobs market”. (Image: PA) Coreena Ford B&M toasts solid start to the year\nB&M has hailed a solid start to its financial year, despite battling against “sluggish” market conditions on the UK high street.\nThe group’s revenue grew by 21.3% for the period between April 1 and June 30, rising from £656.3m to £796.3m.\nB&M’s revenues rose from £598.4m to £648.3m for the quarter, representing UK like-for-like sales growth of 1.6%.\nThe value chain said it had opened four new B&M stores during the quarter.\nIt is aiming to expand its estate by 50 stores by the end of the year.\nSales in Heron Foods, the convenience chain it bought in August 2017, came to £86.1m.\nThe group is aiming to open between 15 and 20 Heron stores in the year.\nB&M chief executive Simon Arora said the business had performed strongly despite a “sluggish market environment”. A B&M store (Image: PA) 8.45 Coreena Ford Gateshead firm that teaches lawyers around the world to speak legal English launches 350th centre\nA Birtley-based firm that teaches lawyers around the world to use English legal terms has opened its 350th centre .\nTOLES Legal runs development programmes for foreign lawyers, teaching them the required standard of legal English needed to work in the industry.\nThe use of standardised legal English is needed by many employers, including international commercial law firms, in-house legal teams, and translators.\nTOLES – which stands for Test of Legal English Skills – is headquartered on Durham Road, in Birtley, County Durham, but operates test centres around the world.\nThe company has expanded rapidly and has now opened its 350th centre in Florence, Italy.\nJane Gelder, who runs the TOLES Florence centre, says: “TOLES gives lawyers enormous potential in terms of work prospects. In Europe there are so many lawyers looking for work. In Tuscany alone, there are approximately 100,000 lawyers and in Florence the ratio is one lawyer every 195 inhabitants.\n“In this competitive environment, the ones with a good grasp of the English language and who are confident in legal English will have a better opportunity to secure clients with international commercial enterprises.” Catherine Mason, director of TOLES 8.40 Coreena Ford Deloitte warns breaking up Big Four auditors will harm City's reputation\nDeloitte has warned that a break-up of the Big Four accountancy firms in the wake of Carillion’s collapse could harm Britain’s standing as a global financial centre at a time when the City is already battling Brexit pressures.\nThe professional services giant has written to the heads of a joint parliamentary committee after MPs raised serious competition concerns in the UK auditing industry during its inquiry into Carillion’s demise.\nWhile Deloitte acknowledged concerns about the dominance of the so-called Big Four - which includes its rivals KPMG, PwC and EY - it said the UK’s reputation may suffer if firms are forced to split.\n“The Committees, and other commentators, have suggested that the break up of the largest professional services firms should be examined as a means of increasing competition and ensuring audit quality,” Deloitte said.\n“We do not believe that this is a viable solution to either matter and would be concerned that it would damage both audit quality and the UK’s position as an attractive capital market.”\nDeloitte added that “ongoing support” for the audit profession was “vital” in underpinning confidence in the UK “and the role that we all hope this market will continue to play in the economy as we prepare to leave the European Union”.\nPwC also wrote to the committees, saying it was “clear” that a break-up of the large firms would impact audit quality and that barriers to entry to the “complex market” should be broken down to support competition.\n“These barriers include increased auditor liability, greater regulatory scrutiny and the need for significant investment,” it said.\nThe comments were part of correspondence with the Business, Energy and Industrial Strategy and Work and Pensions Committees, which were released as part of a raft of responses to an inquiry into what went wrong at Carillion. The London skyline Coreena Ford Newcastle's Flynn's to reopen as Charts live music venue\nNewcastle Quayside bar Flynn’s is poised to reopen this weekend under a new name as the city’s latest live music venue.\nA significant sum has been pumped into the popular venue, set between the Tyne and Millennium bridges, resulting in a complete transformation.\nThe Grade II listed building at 63 Quayside will re-open on Friday as Charts, a stylish live music venue and art gallery selling food, ales, cocktails, wines and spirits with views across the River Tyne.\nArtwork displayed on its walls will be available to buy and it will host live jazz and blues sessions. The leisure operators behind Charts say the opening heralds a bright new future for the building, which has been in the planning for at least two years.\nFor the new operators, Pub Culture, this is another project transforming a prominent historic building into a vibrant cultural venue and follows the success it has had in Sunderland with the Fire Station, the Dun Cow and the Peacock.\nOperations director Joe Smith said: “We have invested significantly and believe we are creating a unique venue for Newcastle’s famous Quayside. Charts will be family-friendly during the day, offering an exciting food menu and stunning views across the river.” Charts on Newcastle Quayside near to the Crown Court (Image: Newcastle Chronicle) 8.30 Coreena Ford ASOS posts soaring sales\nOnline fashion firm Asos has racked up another double-digit jump in sales, but warned that its full-year growth will be at the “lower end” of market expectations.\nThe online fashion retailer said its group revenues grew by 22% to £823.9m in the four months to June 30.\nUK retail sales were up 23% from £234.6m to £288m, while sales in the EU rose 31% to £257.4m. In the US, sales increased 15%, from £94.4m to £108.1m. Asos expects its profit before tax to be in line with consensus forecasts for the year.\nChief executive Nick Beighton said:\nI am pleased with the way the business has traded over the last four months and we are on track with our plans for the year.\nWe delivered good sales growth, particularly in the UK, better-than-planned gross margin alongside significant progress on our infrastructure investments.\nThe trading update comes after Asos announced that Adam Crozier, the former boss of ITV and Royal Mail, would become its chairman. He is also chairman at Whitbread, the firm behind Costa Coffee and Premier Inn.\nMr Crozier will succeed Brian McBride when he steps down on November 29 after six years heading the board. An ASOS dress yesterday", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14898217;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-07-12T10:15:00.000+03:00", "crawled": "2018-07-12T16:31:46.025+03:00", "highlightTitle": ""}