{"organizations": [], "uuid": "6fbf94feed3986878d5645531d4f295a4e61c090", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1521675.ece/ALTERNATES/s1200/Sir-Peter-Soulsby.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/leicester-news/leicester-mayor-peter-soulsby-calls-1841692", "country": "GB", "domain_rank": 48128, "title": "Leicester Mayor Peter Soulsby calls for People's Vote second referendum on Brexit - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.002, "site_type": "news", "published": "2018-07-31T03:00:00.000+03:00", "replies_count": 0, "uuid": "6fbf94feed3986878d5645531d4f295a4e61c090"}, "author": "Dan Martin", "url": "https://www.leicestermercury.co.uk/news/leicester-news/leicester-mayor-peter-soulsby-calls-1841692", "ord_in_thread": 0, "title": "Leicester Mayor Peter Soulsby calls for People's Vote second referendum on Brexit - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "labo", "sentiment": "negative"}, {"name": "peter soulsby", "sentiment": "negative"}, {"name": "brexiteers", "sentiment": "none"}, {"name": "peter", "sentiment": "none"}, {"name": "alex hannam", "sentiment": "none"}], "locations": [{"name": "brexit - leicestershire live leicester", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leicester Mayor Peter Soulsby calls for People's Vote second referendum on Brexit But it is not Labour policy and Brexiteers have accused him of being anti-democratic Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nSir Peter Soulsby has joined the calls for a second referendum on Brexit.\nLeicester’s mayor, one of Labour’s most powerful politicians outside London, says the British people ought to have a say on the terms by which the UK quits the European Union.\nSir Peter, who supports Britain remaining in the EU, has been accused of being anti-democratic by Brexiteers but he says people ought to have a voice in such a crucial issue for the country. Read More Sir Peter Soulsby (Image: Alex Hannam)\nHe said: “When we had the referendum it was a simple question, stay or leave.\n“By a narrow margin (51.9 per cent to 48.1 per cent) there was a vote to leave.\n“Many people said they could take that result on the basis that we might expect an orderly exit from the European Union.\n“What we are seeing now is the reality of Brexit and that it is likely that we are headed for a disorderly exit from the EU. poll loading Would another vote be good for democracy or an insult to it? 500+ VOTES SO FAR Bad - the people have spoken Good - we can change our minds\n“The worst scenario is that we will crash out of the European Union and that will have a catastrophic impact on our economy in a way very few voters envisaged in 2016 when the first referendum was held.\n“That will have an effect on every person in Leicester, and the wider country and that is why their voice should be heard and they should have a genuine say on what Brexit looks like.” Read More Why India still loves doing business\nCampaigners for a second referendum say people should be able to decide whether to leave the EU on the terms of a deal the Government makes or remain a member.\nA second referendum is not Labour Party policy and some members say those calling for one are undermining leader Jeremy Corbyn.\nSir Peter said: “It is not Labour policy but I hope it can be made Labour policy.\n“The leadership has not ruled it out and I do feel we should debate it.”\nSir Peter says he will take a motion to Leicester City Council’ s next meeting in October calling for a ‘People’s Vote’ following the lead of other authorities such as Swansea and Liverpool councils. Brexiteer Andrew Bridgen responds\nArdent Brexiteer and North West Leicestershire Tory MP Andrew Bridgen said: “This is just a piece of political opportunism by Sir Peter Soulsby .\n“Is he up for re-election soon?\n“Oh yes, so he is.\n“We have already had a people’s vote and the people voted leave. I’m extremely disappointed to hear people calling for a second referendum when we haven’t implemented the will of the first.\n“People voted to leave so we leave. Staying in the EU would be like remaining in an abusive relationship.” Andrew Bridgen\nMr Bridgen arranged an emergency meeting in his constituency last week to ask members what they thought of prime minister Theresa May’s Chequers proposals for leaving the EU.\nThey involve 'continued harmonisation; with the EU in trade, a combined EU/UK customs territory and 'joint jurisdiction' of courts. Read More\nHe said: “North West Leicestershire members do not like it because it is not a Brexit.\n“Overwhelmingly – more than 90 per cent – they are against it.\n“They want the PM to ditch Chequers. It will be untenable it that doesn’t happen.\n“Since she announced it we have dropped five or six per cent in the polls.” Like us on Facebook ", "external_links": [], "published": "2018-07-31T03:00:00.000+03:00", "crawled": "2018-07-31T15:32:25.006+03:00", "highlightTitle": ""}