{"organizations": [], "uuid": "8b16c33754e00e89584af67d898ed550925d6604", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.birminghammail.co.uk/incoming/article14931826.ece/ALTERNATES/s1200/4_Theresamay.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-may-ill-give-north-14938550", "country": "GB", "domain_rank": 21960, "title": "Theresa May: I'll give the North East the investment, the freedom and the good Brexit deal it needs", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-23T07:00:00.000+03:00", "replies_count": 0, "uuid": "8b16c33754e00e89584af67d898ed550925d6604"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-may-ill-give-north-14938550", "ord_in_thread": 0, "title": "Theresa May: I'll give the North East the investment, the freedom and the good Brexit deal it needs", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "tyne", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}], "organizations": [{"name": "cabinet", "sentiment": "none"}, {"name": "northern powerhouse", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Could not subscribe, try again later Invalid Email\nPrime Minister Theresa May is due in Newcastle on Monday with her Cabinet.\nShe is coming to the North East for a special meeting alongside the Great Exhibition of the North.\nAnd the Prime Minister has written these words exclusively for Chronicle Live ahead of the visit. Read More Labour councillors 'uniting' over plans to stop them choosing council leaders\nToday, I’m bringing the Cabinet to the heart of Tyne and Wear and the heart of the Northern Powerhouse. And we’re coming here with a very simple message: this Government believes in the North East, and this Government is backing the North East.\nIt’s no coincidence that Newcastle and Gateshead were chosen to host the Great Exhibition of the North. This part of the world has long embodied the spirit of innovation and creativity that makes this country so successful.\nMaking sure this historic region has the skills, infrastructure and investment it needs to turn that natural flair into jobs, growth and prosperity in the years to come is, quite rightly, at the heart of the Journal’s Invest in the North East campaign.\nAnd, as our Modern Industrial Strategy makes clear, it’s also a priority for this Government.\nThe strategy is all about government working with businesses to make sure the country has the skills and infrastructure it needs to tackle the grand challenges of the 21st century – making the most of artificial intelligence and data, supporting our ageing society, promoting clean growth and embracing the future of mobility.\nThe North East is already at the cutting edge in some of these areas – for example, experts at Newcastle’s National Innovation Centre for Ageing are doing world-leading research.\nBut with the pace of change in technology and our economy, we cannot afford to rest on our laurels.\nIf this is to be a country where the prosperity generated by these new opportunities is genuinely shared – where people in Stockton, South Shields and Sedgefield feel the benefits of growth every bit as much as those in London, the South East and the rest of the UK – we have to make a serious investment in jobs, skills and infrastructure right across the nation. Prime Minister Theresa May (Image: Clodagh Kilcoyne/PA Wire)\nAnd, here in the North East, that’s exactly what the Government is doing.\nWe’re putting money into infrastructure on which all businesses rely.\nThanks to a £337 million grant, the Metro’s fleet of 40-year-old trains are being completely replaced with state-of-the-art rolling stock fit for the 21st century. The procurement process is already under way and the new trains should be on the tracks of Tyne and Wear as soon as 2021.\nAnd, today, I’m delighted to announce that we’ll be investing up to £780 million to improve the East Coast Mainline, raising capacity and cutting journey times. The upgrades, taking place over the next two years, will allow brand-new Intercity Express trains to run, providing more spacious, more comfortable and more frequent services and making the North East better connected than ever.\nWe’re putting money into the kind of cutting-edge companies that are creating jobs of the future – including an extra £100 million to help innovators and commercial companies work together at the Centre for Process Innovation and on offshore renewable energy projects across the region.\nAnd, because nobody knows the needs of Newcastle, North Tyneside and Northumberland better than the people who live and work here, I can confirm that we’re investing £600 million in jobs, skills and infrastructure under the North of the Tyne Devolution Deal.\nThe details were agreed by local councils earlier this year and we are now going to lay the legislation that will make it a reality.\nThe deal is about more than just money – it’s about putting power in the hands of local people. Next year, people in Newcastle, North Tyneside and Northumberland will go to the polls to choose their first-ever directly-elected mayor. A champion for the region, he or she will have wide-ranging powers on issues that really matter to the people of the North East, including planning, housing, and adult education. Read More Virgin East Coast boss says the failed franchise improved services\nIn the Tees Valley, Ben Houchen has already shown what an incredible difference an elected mayor can make, from fighting for the Tees Valley on the national and international stage to driving forward the first mayoral development corporation outside London. Whoever wins next year’s election North of the Tyne, I look forward to seeing similar success.\nI’m also determined to make sure the Brexit deal we reach with the European Union is one that delivers for the North East – taking back control of our money, laws and borders while safeguarding the manufacturing industry on which so many jobs in this region depend.\nJust look at your world-leading automotive industry and its supply chain. Components and raw materials flow into Sunderland from suppliers across the North East, Europe and around the world and, every year, hundreds of thousands of top-quality cars roll off the production line and head in the opposite direction.\nTo allow this success to continue, we want an agreement with the EU that allows parts and materials to come into the UK and finished products to leave for European markets without being held up at customs or hit with import and export taxes.\nUnder our proposed plans for Brexit – agreed at Chequers and published earlier this month – that’s exactly what the UK will get. And when I negotiate the final agreement with Brussels you can be sure that I’ll be putting the needs of Journal readers like you front and centre.\nYou deserve no less. The people of Newcastle, Gateshead and the wider North East have never needed to be told that they make an incredible contribution to British life.\nThis, after all, is the region that gave the world everything from the electric lightbulb to the passenger railway; indeed, at one time, a quarter of the world’s ships were marked “Made in Wallsend”.\nWhile the North East should always be proud of its past, I believe it has an equally bright future.\nBecause the people of this region do not want for innovation, drive and ambition. And, as Prime Minister, I’m determined to give you the investment, the freedom, and the Brexit deal you need to turn that into long-term success. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-23T07:00:00.000+03:00", "crawled": "2018-07-23T11:57:27.070+03:00", "highlightTitle": ""}