{"organizations": [], "uuid": "35065fed29a4ed5768406b430034fa67ad3340b2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14850107.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/legal-battles-big-property-news-14850034", "country": "GB", "domain_rank": 21960, "title": "Legal battles, big property news and calls for another election: This week in North East politics", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-01T07:00:00.000+03:00", "replies_count": 0, "uuid": "35065fed29a4ed5768406b430034fa67ad3340b2"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/legal-battles-big-property-news-14850034", "ord_in_thread": 0, "title": "Legal battles, big property news and calls for another election: This week in North East politics", "locations": [], "entities": {"persons": [], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "killingworth road", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nNeed to catch up on what’s been going on in the world of local politics in the North East this week?\nCouncils will soon wind down for the summer but it’s been another busy seven days across the region.\nFrom legal battles to eye-catching property developments being approved, here are the biggest stories you might have missed this week. The rising cost of Killingworth Road works delay The continued delayed opening of Killingworth Road in Newcastle (Image: Newcastle Chronicle)\nThe long-delayed reconstruction of one of Newcastle’s key commuter routes is expected to come in more than half a million pounds over budget.\nCurrent council projections put the cost of the Killingworth Road project at just over £14m, after it was revealed last week that the road will be shut until 2019.\nThe original estimate for the scheme was £13.5m, but severe delays to gasworks underneath the road have sent costs spiralling. Living at Her Majesty’s pleasure in Gateshead Former Felling Police station (Image: Google)\nIt used to be that the only people staying overnight at Felling Police Station were those who had been nicked.\nBut that could soon change as plans have been revealed to convert the Victorian building into an aparthotel.\nPlans have been submitted to Gateshead Council to convert the station, which was used a youth offenders’ institute by Northumbria Police, into a 19-room hotel. Council bosses want a fresh election Newcastle City Council leader Nick Forbes\nCouncil chiefs have called for an immediate General Election amid warnings that the North East cannot afford the cost of Brexit.\nCalls have been made for a new Government to step in because of what Newcastle City Council leader Nick Forbes labelled a ‘cack-handed’ approach to Brexit negotiations.\nCoun Forbes told Wednesday night’s council meeting that a new Government is needed to deliver a better deal for Newcastle, as Nissan bosses cast fresh doubt over the future of its Sunderland factory after being left “in the dark” over Brexit. Newcastle council bosses on the look out for drug and abuse issues Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nGangs taking over vulnerable people’s homes to use them as drug-dealing bases and children being used to traffic substances.\nThose are some of the problems identified by safeguarding bosses, who say they now have their “eyes open” to gang and drug problems across Newcastle.\nThe teams tasked with protecting the city’s most vulnerable people say they have become “more savvy” about noticing exploitation in communities in the wake of Operation Sanctuary. More student accommodation for Newcastle The newly-approved Technopole development in Newcastle (Image: Adderstone Group)\nDesigns for a £40m student housing project quickly won the backing of councillors on Friday.\nPlans to demolish the empty Technopole office block at Newcastle’s Kings Manor Business Park and build two new tower blocks in its place were approved without any debate at a meeting of Newcastle City Council’s planning committee.\nThe scheme, led by property developer the Adderstone Group and iQ Student Accommodation (iQ), will house 535 students across 162 apartments, following similar developments at Clough House and Manor View House on the same business park. Development firm issues legal proceedings against Northumberland council County Hall, Morpeth (Image: ALN_03/02/2015_NPMH-countyhall4P)\nThe development company behind the controversial Dissington Garden Village project has issued legal proceedings against Northumberland County Council.\nLugano was granted permission to build 2,000 homes north of Ponteland under the council’s previous Labour administration.\nBut when the Conservatives took control of the local authority in May last year, the county’s planning framework was scrapped - a move which put the Dissington project under review.\nAll parties named by Lugano deny any wrongdoing.", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-01T07:00:00.000+03:00", "crawled": "2018-07-01T12:40:00.009+03:00", "highlightTitle": ""}