{"organizations": [], "uuid": "81723483867f7ae6c75c28c838404a66e8a1d50e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article459274.ece/ALTERNATES/s1200/Ben-Bradshaw-2PNG.png", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/news-opinion/running-out-time-solve-britains-1798922", "country": "GB", "title": "We are running out of time to solve Britain’s self-inflicted Brexit crisis", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-18T15:18:00.000+03:00", "replies_count": 0, "uuid": "81723483867f7ae6c75c28c838404a66e8a1d50e"}, "author": "Ben Bradshaw", "url": "https://www.devonlive.com/news/news-opinion/running-out-time-solve-britains-1798922", "ord_in_thread": 0, "title": "We are running out of time to solve Britain’s self-inflicted Brexit crisis", "locations": [], "entities": {"persons": [{"name": "ben bradshaw", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "jonathan brady/pa wire", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "customs union", "sentiment": "none"}, {"name": "conservative", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "tory cabinet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "\nBEN BRADSHAW IS THE LABOUR MP FOR EXETER AND HAS BEEN SINCE 1997\nThe Express and Echo’s on-line version – Devon Live – helpfully reminded me this week of the column I wrote exactly a year ago on Brexit.\nIn it, I wrote that I’d always thought there was a good chance Brexit wouldn’t happen “once the British people were faced with a terrible negotiation and an even worse deal”.\nThe general election in which Mrs May had just lost her majority had brought those circumstances forward, with a Tory Cabinet at war with itself and Conservative politicians trading insults. “Only now,” I wrote “are we having the debate about what Brexit actually means and the different types of Brexit that we didn’t during the Referendum campaign.” Prime Minister Theresa May (Image: Jonathan Brady/PA Wire)\n“Mrs May”, I went on, “had lost her majority for her extreme hard Brexit – outside the Customs Union and Single Market. But, as soon as she retreats from this and adopts a more sensible, softer Brexit, the Conservative Party will descend into civil war.” Read More The six biggest threats to our economy and jobs\nWell that’s what happened this week.\nHaving corralled her Cabinet at Chequers, deprived of their mobile phones and ministerial cars, she finally, after two wasted years since the Referendum, got them signed up to her long awaited Brexit “White Paper.” But after two days, that White Paper, which was supposed to form the basis of our negotiations with the rest of the EU, lay in shreds. Undermined by the resignations of the Brexit Secretary, David Davis, and the Foreign Secretary, Boris Johnson and then filleted by hard right Tory MPs in Parliament. Boris Johnson\nSo, a year on, what I predicted has happened and we are no nearer to a solution to Britain’s self-inflicted Brexit crisis. But now it’s more serious, because we are running out of time. Read More Failing Dawlish rail line 'is a threat' to Exeter\nThe irony in all of this is that if Mrs May a year ago had faced reality and the parliamentary arithmetic and announced she was going for a Norway-type solution, she would probably have got it through Parliament and the EU. But she caved in to her hard Brexiteer right then, and she caved into them again this week by allowing them to demolish her White Paper.\nShe is being destroyed by the same people who destroyed David Cameron and John Major before her. People who are quite open about that fact that they are prepared to put their ideology and dogma before the interests of their constituents and the country. Read More\nA year ago I also highlighted the danger of talks getting nowhere or breaking down and Britain falling off a cliff. That danger is now significantly greater. Ben Bradshaw MP\nI would like to think Parliament, in such circumstances, would intervene to stop such a catastrophe. But that would require more than the current 12 or so Conservative MPs to discover their spines and act in the national interest. Read More Tory MPs will do anything to avoid an election because they don’t want a Labour Government\nWe are facing a period of unprecedented peace-time danger for our country. Another General Election, or, more likely, a People’s Vote on a Brexit deal might offer ways out of this mess. But, given the uncertainty, I am not going to predict where we’ll be in a year’s time. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-18T15:18:00.000+03:00", "crawled": "2018-07-18T15:34:39.029+03:00", "highlightTitle": ""}