{"organizations": [], "uuid": "d7e940e9e4f308db7f92b78c625bb1f55247ca58", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article316104.ece/ALTERNATES/s1200/Ben-BradshawJPG.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/news-opinion/brexit-wont-happen-here-1790935", "country": "US", "title": "Brexit won’t happen, and here is why", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-16T16:16:00.000+03:00", "replies_count": 0, "uuid": "d7e940e9e4f308db7f92b78c625bb1f55247ca58"}, "author": "Ben Bradshaw", "url": "https://www.devonlive.com/news/news-opinion/brexit-wont-happen-here-1790935", "ord_in_thread": 0, "title": "Brexit won’t happen, and here is why", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Brexit won’t happen, and here is why THIS IS WHAT BEN BRADSHAW, THE LABOUR MP FOR EXETER, SAID ABOUT BREXIT IN HIS COLUMN SENT TO DEVONLIVE.COM, EXACTLY 12 MONTHS AGO Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\n“I’m going to make a bold prediction. Brexit won’t happen. There. I’ve said it.\n“It’s what a lot of people are thinking and many hoping, but not saying, for fear of appearing “undemocratic”.\n“Let me explain my reasoning for this prediction. Read More\n“I’ve always thought there was a good chance Brexit wouldn’t happen once the British people were faced with a terrible negotiation and an even worse deal. But the general election and its aftermath have brought that moment forward. Ben Bradshaw, Exeter MP\n“Only now are we having the debate about what Brexit actually means and the different types of Brexit that we didn’t during the Referendum campaign and haven’t since because an imperious Prime Minister closed down all discussion with her meaningless mantra ‘Brexit means Brexit’.\n“That Prime Minister has now lost her majority and with it her authority. The level and tone of public squabbling among her Ministers is unprecedented. Read More Failing Dawlish rail line 'is a threat' to Exeter\n“This week Michael Gove’s ex advisor and head of the Leave campaign described the Brexit Secretary, David Davis, as ‘thick as mince, lazy as a toad and vain as Narcissus’. European Commission negotiator Michel Barnier (left) at 10 Downing Street for talks with Secretary of State for Exiting the European Union David Davis\n“Soft Brexiter Cabinet Ministers hit back at Gove and Boris Johnson calling them ‘testosterone-fuelled donkeys’ and ‘safe seat kids’ who should ‘go back to being the juvenile scribblers they were before they entered politics’.\n“This might be entertaining were it not so serious for the country. With a Cabinet at war with itself, how can it be expected to negotiate itself out of a paper bag, let alone conduct the most complicated, challenging, important talks this country has ever embarked on?\n“What these Cabinet rows have exposed is the basic incompatibility of the Leave campaign’s two main groups. One want to reduce immigration, whatever the cost to our economy and the other want an ultra-free-market free trade Britain and aren’t bothered about immigration. Read More A strong case to legalise cannabis and take crime off the streets\n“Mrs May has no parliamentary majority for her extreme hard Brexit – outside the Customs Union and the Single Market.\n“But as soon as she retreats from this and adopts a more sensible, softer Brexit, the Conservative Party will descend into civil war and, in all probability, split.\n“The greatest danger is that the UK Government, riven with divisions, is incapable of negotiating anything, talks break down and we fall off the cliff edge. I can’t see that happening without Parliament intervening to stop what would be the worst of all possible outcomes. And what then? Exeter MP Ben Bradshaw\n“No hard Brexit, no soft Brexit, no chaotic cliff edge Brexit. And all the time the practical impact of Brexit hitting the public in lower living standards, less investment, more austerity and fewer jobs. Public opinion is already changing. Most now want to stay in the Single Market and Customs Union and most want a say on any final deal. Read More Tory MPs will do anything to avoid an election because they don’t want a Labour Government\n“The illusion of a pain-free Brexit that would stop free movement and payments to the EU while maintaining free trade is being shattered.\n“If the British people are renowned for one thing – it’s their common sense. I can’t see them tolerating a course of action that will result in their own significant impoverishment.”\nOriginally published on July 16, 2017. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-16T16:16:00.000+03:00", "crawled": "2018-07-16T17:10:18.025+03:00", "highlightTitle": ""}