{"organizations": [], "uuid": "fc0cc7e74b77a780d2bb857b54acb84f30c41da6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14920511.ece/ALTERNATES/s1200/0_The-Prime-Minister-Pledges-To-Boost-The-Aerospace-Industry-Amid-Brexit-Fears.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/mps-condemn-theresa-mays-attempt-14919910", "country": "GB", "domain_rank": 21960, "title": "MPs condemn Theresa May's attempt to send them on holiday early", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-17T18:00:00.000+03:00", "replies_count": 0, "uuid": "fc0cc7e74b77a780d2bb857b54acb84f30c41da6"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/mps-condemn-theresa-mays-attempt-14919910", "ord_in_thread": 0, "title": "MPs condemn Theresa May's attempt to send them on holiday early", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "chi onwurah", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "newcastle central labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MPs condemn Theresa May's attempt to send them on holiday early Government may be forced to make a u-turn on proposal to begin summer recess this week Share British Prime Minister Theresa May (Image: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe\nMPs have slammed Theresa May’s plan to give them an early holiday.\nThe Government tabled a motion that would mean the House of Commons shuts down for its long summer break on Thursday - even though it had been due to sit until Tuesday of next week,\nNo official reason has been given. There is speculation at Westminster that Mrs May believes the early break would give Tory MPs less time to plot against her.\nBut the proposal has been attacked by North East MPs, who said it was ridiculous to send MPs home when crucial decisions about Brexit still had to be taken. Read More Virgin East Coast boss says the failed franchise improved services\nNewcastle Central Labour MP Chi Onwurah said on Twitter: “I have constituents who can’t plan when they’re going to see their kids because of zero hours contracts and now they’re going to see MPs voting ourselves off on holiday five days early?”\nShe added: “Yes, I know most MPs work during recess - I do - but there’s a job to be done here in Parliament and with so many in economically precarious jobs we shouldn’t be closing down so Theresa may can feel comfortable in hers.”\nWansbeck MP Ian Lavery said: “This is political arrogance at its absolute worst. PM May packing her troops off on holiday almost a week early to avoid any further embarrassments.”\nAnd South Shields MP Emma Lewell-Buck said it was a sign of the “truly desperate state our politics is in”.\nWhenever it breaks up, the Commons is due to begin sitting again on September 4, but just for one week.\nIt then closes on September 13, giving MPs time to attend their party conferences. They return to Westminster on October 9.\nA Commons motion entered by Leader of the House Andrea Leadsom on Monday night says that “this House at its rising on Thursday 19 July 2018 do adjourn until Tuesday 4 September 2018”, without allowing a debate by MPs. Labour MP for Newcastle Central, Chi Onwurah (Image: Newcastle Chronicle)\nBut it’s possible the Government could abandon the plan.\nAsked whether the Government intended to press ahead with a vote on bringing the recess date forward, Mrs May’s official spokesperson said: “The Government came forward with this proposal following discussions with other parties. We are considering all of the representations which have been received.”\nHe added: “It is a non-sitting Friday this week and there is no substantive Government business next week.”\nAn early recess might not stop a potentially stinging resignation statement from Boris Johnson.\nThe ex-foreign secretary used a Monday Daily Telegraph column to ominously say: “I will resist - for now - the temptation to bang on about Brexit”.\nNicholas Soames and Nick Boles were among Conservative MPs who also indicated on social media that they would oppose the move to finish early. Read More Leave campaign 'cheated' to win EU referendum - now North East MP wants Brexit to be scrapped\nLabour shadow chancellor John McDonnell said such a vote, listed for Tuesday evening, showed the Government was in “chaos”.\nHe tweeted: “Government’s plan to close Parliament on Thursday and send MPs home early for summer is because Theresa May is fearful of Tory MPs hanging around plotting against her. It shows what chaos this Government is in.\n“Let me make it clear that I will be voting against breaking up early.”\nHis colleague, Labour’s Paula Sherriff, said she had “important meetings” scheduled for next week and would vote against the move.\nShe tweeted: “Govt are running scared and using silly tactics to avoid plotting by their own MPs.”\nLabour MP Mary Creagh also threw her weight behind a no vote, saying “this is no time for a holiday”, while SNP MP Dr Philippa Whitford accused Mrs May of wanting an early recess “because she is running scared”. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-17T18:00:00.000+03:00", "crawled": "2018-07-18T08:00:36.016+03:00", "highlightTitle": ""}