{"organizations": [], "uuid": "ef3cce201a3f4709e1ece4dbfdb2eb8428d89ba1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14876495.ece/ALTERNATES/s1200/Sue-Balfour-runs-Katy-Sue-Designs-in-South-Shields.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/south-shields-cake-decorators-aim-14876343", "country": "GB", "domain_rank": 21960, "title": "South Shields cake decorators aim to strike sweet deals in US to grow sales", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-08T10:00:00.000+03:00", "replies_count": 0, "uuid": "ef3cce201a3f4709e1ece4dbfdb2eb8428d89ba1"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/south-shields-cake-decorators-aim-14876343", "ord_in_thread": 0, "title": "South Shields cake decorators aim to strike sweet deals in US to grow sales", "locations": [], "entities": {"persons": [{"name": "balfour", "sentiment": "none"}, {"name": "sue balfour", "sentiment": "none"}, {"name": "doreen", "sentiment": "none"}, {"name": "doreen thompson", "sentiment": "none"}], "locations": [{"name": "south shields", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "orlando", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}], "organizations": [{"name": "new york cake show", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "South Shields cake decorators aim to strike sweet deals in US to grow sales Katy Sue Designs designs and manufactures cake moulds and decorations Share Click to play Tap to play The video will start in 8 Cancel Play now Get\nAn entrepreneur who helps bakers perfect their cakes has taken her range of decorating products across the Atlantic in an effort to grow her business in the US.\nSue Balfour, co-founder of Katy Sue Designs, designs and manufactures craft and cake decorating products, tools, and a range of food-safe silicone cake moulds.\nThe South Shields company originally launched in 1993 when Ms Balfour and her mother Doreen began creating miniature porcelain dolls for collectors. The business grew and expanded into papercraft products and baking mould.\nNow Ms Balfour is attempting to crack the US market after recently attending the New York Cake Show and America’s Cake Show, in Orlando.\nMs Balfour said: “My mother, Doreen Thompson, and I, were ready for a new challenge when we founded Katy Sue Designs. We were ready to turn our creative talents to the paper craft and bakery market, and we are excited to see its potential. Read More Young Newcastle entrepreneur ditches City jobs to launch business which hires dresses\n“In late 2012, we designed and manufactured our very own range of food safe silicone moulds for decorating markets. This has been so exciting as it has allowed our creative team to return to our roots in sculpting and mould making.\n“Our products are sold around the world, but our immediate focus is on increasing exports to the US, where we have had tremendous success at trade shows. We have dedicated UK and US websites to cater for these markets, allowing Katy Sue Designs to reach clients across the pond.”\nKaty Sue Designs now exports to more than 40 countries around the world. Its team of 12 has an ambitious growth strategy to expand the business in both the bakery and papercraft markets. It has also developed a series of YouTube video tutorials to explain how to use the company’s products. Sue Balfour runs Katy Sue Designs in South Shields\nThe visit to the US is expected to create strong returns for the company.\nMs Balfour added: “We are revising our past sales strategy to take a more digital approach to reach international markets, and we are developing lots of products to support content to drive that forward.\n“It was fantastic to attend two such important trade shows. Our biggest export market is the USA, and we expect to increase sales by around 80% there over the next 12 months – I know this is ambitious, but we have big plans for the future, and our increasing digital presence is helping us to realise these plans.” Read More Business Secretary makes plea for business-friendly Brexit\nThe trip to the US was made possible after the company received support from the European Regional Development Fund, which was administered by the Department for International Trade.\nInternational trade director Julie Underwood said: “Katy Sue Designs is a brilliant exporter, and is enjoying great success in the US market especially. We are pleased to be able to support their digital output, as well as supporting their attendance at new trade shows.\n“They are a North East business with a great deal of passion and creative flare – it’s wonderful to work with a group of people that have ambitious growth plans and the drive to succeed. We’re excited to see what the future holds for Katy Sue.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-08T10:00:00.000+03:00", "crawled": "2018-07-08T14:16:43.002+03:00", "highlightTitle": ""}