{"organizations": [], "uuid": "03adc579647d1dc7e6f6b85bf3e0c2e333046e8b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1834282.ece/ALTERNATES/s1200/0_Keira-main.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/one-year-after-three-children-1832846", "country": "GB", "title": "One year after three children and a mother were killed on a notorious Devon road, what has changed in the past 12 months?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-29T02:00:00.000+03:00", "replies_count": 0, "uuid": "03adc579647d1dc7e6f6b85bf3e0c2e333046e8b"}, "author": "Joel Cooper", "url": "https://www.devonlive.com/news/devon-news/one-year-after-three-children-1832846", "ord_in_thread": 0, "title": "One year after three children and a mother were killed on a notorious Devon road, what has changed in the past 12 months?", "locations": [], "entities": {"persons": [{"name": "vauxhall vectra loanna", "sentiment": "none"}, {"name": "bradley", "sentiment": "none"}, {"name": "keira share click", "sentiment": "none"}, {"name": "loanna", "sentiment": "none"}, {"name": "loanna ball", "sentiment": "none"}, {"name": "keira", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "loanna ball the road", "sentiment": "none"}, {"name": "north devon link road", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News One year after three children and a mother were killed on a notorious Devon road, what has changed in the past 12 months? At 11.30am on Sunday, July 30, Loanna Ball was driving along the A361 North Devon Link Road with her seven-year-old son Bradley and her nine-year-old daughter Keira Share Click to play Tap to play The video will start in 8 Cancel Play now Thank you for subscribing!\nThis time last year, a series of tragic events were about to change the lives of several families beyond anything they could have imagined.\nAt 11.30am on Sunday, July 30, Loanna Ball was driving along the A361 North Devon Link Road with her seven-year-old son Bradley and her nine-year-old daughter Keira.\nFor reasons as yet unknown, the Vauxhall Vectra Loanna was driving collided with a Ford Ranger 4x4 towing a cattle trailer. Keira and her mum, Loanna Ball\nThe road was closed hours as emergency services fought to save the family, all of whom had sustained injuries in the crash.\nLoanna was airlifted to Bristol's Southmead Hospital while Keira and Bradley were taken to Bristol Children's Hospital.\nSadly, Keira died from her injuries. Read More Man fighting for his life in hospital after crash which killed two of his friends\nThe day after their collision, another family were travelling on the North Devon Link Road - just metres away from where Loanna had crashed - when tragedy struck again.\nJane Baker-Lockett, 43, and her 12-year-old twins James and Amy Gaskin had been travelling in their Kia Sportage, just behind Jane's husband and her 14-year-old son, who were in a separate car.\nJane's husband witnessed the moment her car collided with an M&S lorry travelling in the opposite direction. The scene of the crash which killed mother Jane Baker-Lockett, 43, and her children, 12-year-old twins James and Amy Gaskin in July 2017\nJane, James and Amy were all killed.\nThe road was closed for nine hours while officers from the Exeter Serious Collision Investigation Unit examined the scene.\nOver the years, the North Devon Link Road has become synonymous with crashes, dangerous driving and, sadly, several fatal collisions. Read More Watch as driver illegally overtakes on notorious road - moments after passing a police car\nSince the tragic events of this time last year, a further three people have been killed on the road.\nOn Monday, June 18 this year, the death count hit 30 when 21-year-old Jordan Clarke from Bideford died after his VW Polo crossed the road into the path of a Fiat Scudo van heading in the opposite direction. A 'very painful' year\nJoe Ball, the father of Keira, said the past 12 months had been very painful for him and his family.\nHowever, there are several positives that he and Loanna take from the situation.\nKeira's organs, which Joe opted to have donated, have saved the lives of four other people - including 10-year-old Max Johnson who received her heart.\nJoe said: “My daughter gave her heart to Max. A gentleman in his 30s on the waiting list for two-and-a-half years got one kidney. Keira Ball's father Joe holds a stethoscope to the chest of Max Johnson to hear his daughter's heart beat for the first time since her death (Image: Daily Mirror)\n“A lady in her 50s got her other kidney, she had been waiting nine-and-a-half years. Her pancreas and liver went to another little boy.\n“She helped to save four lives. I watched as the ambulances left the hospital with her organs, she was in the operating theatre for nine hours, and it was hard sitting there knowing it was Keira. She lives on, and that gives us great comfort now. Read More The shocking moment a car ploughs into a group of cyclists\nEarlier this year, Joe, Loanna and their family got to hear Keira's heart beating inside Max's chest for the first time since that tragic morning.\nJoe and Loanna have also set up a charity called InspiredByKeira to help the families of children who have died through their hard times. Keira's mum and dad, Loanna and Joe Ball\nLoanna said: \"We promote organ donation, but any money we raise goes to families who have been in a similar situation to us in the hope of easing their pain and remembering the one they have lost.\n\"We have already helped some families, both local and elsewhere in the UK, by purchasing memory gifts for them.\n\"But we can also help by contributing to travel and accommodation costs for those families having to make long trips to hospitals. We just want to make their lives easier.\" So, what has happened since last year?\nThe single biggest talking point around the North Devon Link Road has been the announcement that £93 million will be spent to improve the road. Chris Grayling MP\nOn Thursday, May 17, transport secretary Chris Grayling approved a series of works to the North Devon Link Road to better connect the area to the rest of the country.\nMore than £83 million of government funding has been confirmed to pay for upgrades on the A361 between South Molton and Bideford, with a further £10 million coming from Devon County Council's Highways department.\nThe plans include widening three sections of the A361 between Barnstaple and South Molton, with two lanes of travel in one direction and a single lane in the opposite direction. Read More North Devon Link Road £93m improvements get unanimous Devon County backing\nA press statement from the Department for Transport (DfT) said the extra lane will \"help provide safer overtaking opportunities and make average journeys on the route more reliable\".\nUpgrades to a number of junctions and improved connections will also provide \"a much needed boost to North Devon as a place to do business\".\nNorth Devon MP Peter Heaton-Jones said the announcement marked a \"landmark day\" for the region. North Devon MP Peter Heaton-Jones, Devon County Councillor Andrea Davis and the North Devon Link Road\nHe said: \"Put simply, it's brilliant news. It's the biggest investment in our area by any government for many years.\n\"The North Devon Link Road has had no significant improvements since it was first built 30 years ago. It is no longer fit for purpose, with long delays and a high accident rate.\n\"It's holding back job creation and stifling economic investment in North Devon. Since first being elected in 2015, I've made it my top priority to get something done.\"\nIt is understood the work will start in 2021, three years from now. But is the road itself the problem?\nWhile many people believe the design of the road is dangerous, Sgt Ollie Tayler, lead investigator with the Devon roads policing department, disagrees. Sgt Oliver Richard Tayler of Devon and Cornwall Roads Policing Team\nSpeaking after the tragic fatal crashes in July last year, he said: \"Roads are not inherently dangerous, they only become so when you put drivers on them – people’s decisions make them dangerous.\n\"If there are limited overtaking lanes, drivers must exercise patience – does it really matter if you end up reaching your destination five minutes later?\n“The engineering of the road is not the answer, education is the answer. No one forces you to speed or use a mobile phone while driving, they are your decisions and they are avoidable. Read More\n“People need to learn not to take these chances. It puts themselves and other motorists at risk and the consequences far outweigh the benefits.”\nKeira's father Joe Ball agrees.\nHe said: \"I drive the North Devon Link Road almost every day and I think it is completely safe.\n\"But there are some absolute hooligans who drive on it.\n\"I think the worst are the commuters who drive on it regularly and think they know better than everyone else.\n\"I also see some of the worst driving very early in the morning - between 5.30am and 6.30am - when they know there are no police around.\n\"It is all down to the drivers and no matter how much money you throw at it, there will still be idiots out there.\" poll loading Is the A361 North Devon Link Road dangerous? 0+ VOTES SO FAR Yes, it's badly designed and leaves drivers frustrated and willing to take unnecessary risks No, how can a road be dangerous? It is the people who drive on it that are dangerous We Need It Now\nLast year, shortly after the two fatal crashes, DevonLive launched its \"We Need It Now\" campaign to lobby for funding for improvements to the Link Road. Click to play Tap to play The video will start in 8 Cancel Play now\nSpeaking last year, DevonLive.com editor Patrick Phelvin said: “We don’t yet know what caused these recent tragic accidents but we do know that the proposed improvements have been a very long time coming and they will make the road safer.\n“With Brexit and plenty of other demands for public money there are concerns that the project will slip, as attention is focused elsewhere.\n\"We want to remind central Government of the importance of this project and ensure it is completed in a timely manner.” Read More North Devon Link Road reopens after horror crash which left two in hospital What about the immediate future?\nWell, your guess is as good as ours. Until the £93 million improvement scheme starts, it's hard to see how anything will really change in the near future. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nAlmost every week Devon Live is sent dash cam video footage of people taking unnecessary risks on the North Devon Link Road.\nNo matter how much we publicise the issue and campaign for change, it seems there are still drivers out there willing to take risks.\nAll we can do - that's us and you out there - is keep reiterating the message that no matter how much of a hurry you are in, we must remain patient.\nAs the saying goes, it is better to arrive somewhere late than not at all. Time Line Fatal crashes on A361 link road since 2000 FATAL: 18/06/2018\nJordan Clarke, 21, a tattooist from Bideford, was killed in a serious collision near Ash Mill on the North Devon Devon Link Road.\nPolice, ambulance and fire crews all attended the scene.\nA Devon and Cornwall Police spokesperson said: “For reasons as yet unknown, a Volkswagen Polo heading towards Tiverton, crossed the carriageway into the path of a Fiat Scudo van heading in the opposite direction and both vehicles collided.\n“A man was extracted from one of the vehicles but was pronounced deceased at the scene.\" FATAL: 11/05/2018\nA 27-year-old man from Barnstaple lost his life after a crash on the A361 North Devon Link Road.\nPolice were called to the A361 at Stoodleigh, near Tiverton, around 3.15am on Friday, May 11 to reports of a crash between a car and a lorry.\nA police spokesman said: \"His next of kin have been informed. The lorry driver was uninjured.\" FATAL: 07/08/2017\nAn elderly man from Winkleigh died in January 2018 following injuries sustained in a serious collision on the A361 in August 2017.\nEmergency services were called on August 7, 2017, to a collision between a Vauxhall Zafira and a Scania tipper lorry at North Molton junction near South Molton.\nJohn Pope, 82, the driver of the Vauxhall Zafira, sustained life-threatening chest and head injuries and was taken to North Devon District Hospital. Mr Pope died on January 10 in Worcestershire as a result of the injuries caused in the collision. FATAL: 31/07/17\nA mother and two children died following a head-on crash between a car and a lorry on Monday, July 31.\nThe crash occurred at around 8.25am when the woman was driving her two children towards Barnstaple, between Aller Cross and Landkey.\nThe mother and one of her children died at the scene and the other child was taken by helicopter to hospital but died shortly afterwards.\nIt is believed the woman and her family were on holiday in Devon and the woman's husband witnessed the crash take place from a vehicle in front. FATAL: 30/07/17\nA nine-year-old girl died after a two-vehicle collision on the A361 link road near the West Buckland junction on Sunday, July 30.\nA Vauxhall Vectra car travelling towards Barnstaple was involved in a collision with a Ford Ranger 4x4 towing a trailer travelling in the opposite direction.\nA charity auction was organised to raise money for the family of nine-year-old Keira Ball who tragically died from her injuries. FATAL: 04/07/15\nFaye Marie Evans was killed by a man driving dangerously on the A361 link road on July 4, 2015.\nJacob Thomas appeared in court accused of causing her death by dangerous driving and two drug offences. He initially pleaded not guilty, but was later found guilty and jailed for five years.\nThomas lost control of his Peugeot on the A361 North Devon Link Road near South Molton and hit a Kia travelling in the opposite direction.\nVictim Faye Marie Evans, from Manchester, suffered serious injuries and died in hospital 36 days later on August 9.\nMore than a dozen members of her family travelled to Exeter Crown Court where the case was listed for a three-day trial until Thomas changed his plea.\nThomas admitted causing death by dangerous driving and possession of cannabis with intent to supply. FATAL: 14/06/14\nAn elderly holidaymaker drove head first into oncoming traffic at more than 60mph, killing herself and another driver on the A361 link road.\nMavis Gallant, 73, from Billericay in Essex, drove into retired police staff member Marion Leach, 63, from Exeter, on June 14, two-and-a-half miles north of South Molton.\nMiss Leach, who served with Devon and Cornwall Police for 25 years, died instantly from extensive injuries, including to the neck and a fracture of the spine.\nMs Gallant suffered head and chest injuries and was treated for a heart attack at the scene.\nShe was airlifted to Derriford Hospital, Plymouth, where she suffered a second heart attack and died at 1.35pm. FATAL: January 2013\nSteven Tolly, a 48-year-old road worker, was killed by a delivery driver who crashed his van through cones and signs.\nAnthony Tompkins admitted killing Mr Tolly when he veered across a coned off area and hit a group of men as they were fixing potholes.\nMr Tolly was one of a crew repairing damage to the dual carriageway section of the A361 link road near Tiverton in January 2013 when he suffered fatal injuries.\nAnother driver had seen Tompkins’ white van being driven erratically shortly before the crash and police found he had an eBay app open on his phone, which was mounted on the dashboard.\nHis van was travelling at around 55mph when it veered for no apparent reason into the coned-off area and hit a large cauldron full of hot tar where Mr Tolly and two other men were working.\nOne of the others jumped clear, another suffered less serious injuries but Mr Tolly took the worst of the impact and died six days later at Derriford Hospital in Plymouth. FATAL: 21/06/10\nTwo holidaymakers visiting the Westcountry were killed in a car crash which left two young children injured.\nFour people, including two seven-year-old boys, were taken to hospital following the two-car smash on the North Devon link road.\nA man and a woman died in the collision involving a silver Vauxhall Corsa and a silver Renault Scenic on the A361 link road at Moortown Cross.\nThe male driver of the Corsa was a Chinese national while his female passenger was from the Philippines. Both lived in Hong Kong, say police.\nPolice said the holidaymakers were travelling towards Barnstaple just before 4.20pm on Monday when the car crashed with a Scenic travelling the other way. FATAL 02/01/10\nStephen and Melanie Potter died on January 2 after their car skidded on ice on the A361 North Devon Link Road.\nSteve and Mel, from South Molton, were killed in the crash near Rackenford Moor just after 8am. It is thought their Vauxhall Corsa skidded on ice into the path of a lorry. The lorry driver was uninjured. No other vehicles were involved. FATAL: 10/03/08\nA young child died after an accident on the A361 North Devon Link Road. Ashton Lee Rothwell from Barnstaple suffered fatal injuries in the crash.\nThe 22-month-old had been taken to the Royal Devon and Exeter Hospital after the accident, which involved several vehicles.\nPolice said initially only one car, a blue Vauxhall Corsa, was involved in the crash on the A361 near Gornhay Cross.\nThe driver was taken to hospital with minor injuries for a check-up. But while police were dealing with debris, which was strewn across both carriageways, a further collision involving three cars occurred on the motorway-bound carriageway. Ashton was travelling in a yellow Peugeot 306. The other cars involved were a blue Ford Mondeo and a blue Land Rover.\nA woman involved in the second collision was taken to hospital with a broken leg. FATAL: 16/07/07\nFour people died in a horrific crash on the A361 North Devon Link Road.\nThe three men and a teenage girl all came from South Molton. They were named by police as Michela Rebecca Jones, 17, brothers Michael and Matthew Gratton, aged 20 and 22 respectively, and Darren Body, aged 34. Michela died as a result of her injuries at Derriford Hospital, Plymouth. She had originally been taken to North Devon District Hospital with life threatening injuries.\nTwo of the other victims had been declared dead at the scene of the accident, which happened on Monday night around 8pm on the Portmore Straight between Barnstaple and Landkey. The other man died from his injuries in North Devon District Hospital. The four who died were all travelling in a red Renault 5 car heading towards South Molton. It is believed the car went out of control and collided with a silver Vauxhall Astra Estate before breaking into pieces.\nThe driver of the Vauxhall was a 65-year-old Barnstaple man. He has not been named and is believed to have suffered minor physical injuries and shock.\nFirefighters used hydraulic cutting equipment to cut the victims from the vehicles. FATAL: 02/04/07\nA 31-year-old Plymouth man was arrested and released on police bail after this three-vehicle accident on the A361 when two men died.\nThe driver of an Iveco box van, Andrew Booth, was arrested on suspicion of causing death by dangerous driving. The two men who died were believed to be a 25-year-old from Dorset and a 25-year-old from Somerset.\nBooth was behind the wheel of a 6.5 tonne delivery van and had been on duty for eight hours when the fatal accident happened. He careered across double white lines on the North Devon link road at Bishops Nympton and smashed into a Renault car. Surfers Christopher Andrews, 25, and Daniel Bates, also 25, were killed instantly.\nBooth was convicted and jailed for 28 months. FATAL: 14/08/06\nJayne Moss, 43, from Bristol, died when her blue Ford Ka collided with a white camper van near the Bolham roundabout.\nThe accident happened just after 11am, and police officers believed the Ka had been driven down the A38, crossing the M5 at junction 27 before entering the North Devon Link Road. They were particularly keen to speak to anyone who may have been concerned as to how the Ka was being driven, and issued an urgent appeal for witnesses. FATAL: 29/03/06\nA MAN who died in a fatal car crash on the North Devon link road near Tiverton was identified as a Willand pensioner.\nKenneth Martin, who was in his 80s, died after his silver Vauxhall Astra collided with a white Ford Transit van on the northbound lane of the A361 just before Gornhay Cross. The driver of the van was treated in hospital for shock and a minor leg injury.\nPolice press officer Sgt Alan Mobbs said on Friday that the police were investigating the possibility that Mr Martin had suffered a heart attack just before the crash, which occurred at 10.30am. FATAL: 15/08/04\nA four-vehicle crash on the A361 link road at South Molton resulted in two deaths.\nA 16-year-old passenger and a 39-year-old driver in a Renault Clio were reported dead by police after the crash at New Town Cross.\nFour other people were reported to have received serious injuries in the accident. The accident involved an Audi, the Renault Clio, a Peugeot 405 and a VW. FATAL: 09/04/04\nA woman was killed in a three-car crash on the North Devon link road. Five other people were taken by two Devon Air Ambulance helicopters to the Royal Devon and Exeter Hospital.\nThe crash happened half a mile from the Stonelands Cross junction. The 26-year-old woman from Melksham, Dorset, was travelling in a light blue Peugeot 206 towards Tiverton when her car was in collision with a dark blue Audi coming in the opposite direction.\nA silver Vauxhall Cavalier was also struck in the crash, causing it to veer off the road into a ditch. The impact strewed wreckage over a 50-metre area.\nAt the time of the crash, which happened at the height of the Easter bank holiday rush, the North Devon Journal reported: \"Since 1999, 160 people have been seriously injured in crashes on the road. Friday's crash brought the total killed to five.\" FATAL: November 2002\n18-year-old Elizabeth Tucker died after her Volkswagen Polo was in a three-vehicle accident near Barnstaple.\nHer father, Stuart, made an emotional appeal to the authorities to take steps to avoid future tragedies on the A361 and backed calls to see the route fully dualled.\nMr Tucker, a beef and dairy farmer from Landkey, near Barnstaple, said: \"It's too late for us. We have lost our sunshine. We are still devastated and our lives are no longer in colour – it's all just black and white.\n\"I'm slightly doubtful about any effect this 'pressure' will have, but if it stops one family going through what we have been through, it must be a good thing.\"\nDespite calls for the A361 to be fully dualled when it was completed in the mid-1980s, the Government at the time said that it would be too expensive, and that use of the road didn't justify the cost.\" FATAL: January 2000\nTwo people died in a crash on the North Devon Link Road on the outskirts of Tiverton.\nTwo cars were involved in a head-on collision near to the junction at Moortown Cross, six miles west of Tiverton, at 3.10pm.\nThe drivers of a red Vauxhall Cavalier and a blue Mazda 626 died.\nPolice later arrested a man in Tiverton and he was helping police with their inquiries. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://mab.data.tm-awx.com/rhs&quot;,&quot;lazyLoadHTML&quot;:&quot;true&quot;,&quot;modularCss&quot;:&quot;true&quot;,&quot;mvtTests.enabled&quot;:&quot;true&quot;,&quot;pushNotifications&quot;:&quot;{\\&quot;selector\\&quot;:\\&quot;.teaser,.skinny-signup\\&quot;}&quot;,&quot;mvtTests&quot;:&quot;"], "published": "2018-07-29T02:00:00.000+03:00", "crawled": "2018-07-29T02:24:49.008+03:00", "highlightTitle": ""}