{"organizations": [], "uuid": "04a07b6f3fa683380974dcc8cc32af96f711c0ee", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/whats-on/article1295765.ece/ALTERNATES/s1200/Marklabbett_PA.jpg", "site_section": "http://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/devons-beast-take-usa-international-1739839", "country": "US", "title": "Devon's Beast to take on USA in international quiz contest", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-02T17:49:00.000+03:00", "replies_count": 0, "uuid": "04a07b6f3fa683380974dcc8cc32af96f711c0ee"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/devons-beast-take-usa-international-1739839", "ord_in_thread": 0, "title": "Devon's Beast to take on USA in international quiz contest", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "mark labbett", "sentiment": "none"}, {"name": "neil shaw", "sentiment": "none"}, {"name": "ken jennings", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "digital", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon's Beast to take on USA in international quiz contest \"Prepare to be spanked and humiliated so thoroughly that you'll think you're back at boarding school\" Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 15:49, 2 JUL 2018 Click to play Tap to play The video will start in 8 Cancel Play now\nITV’s Mark Labbett, also known as The Beast and best known for appearing in the hit game show The Chase, is leading a British team to take on the best of America in the ultimate trivia challenge showdown.\nThe Tiverton man will lead a team trying to win a challenge in pub quiz app, FleetWit.\nTaking place on Wednesday 4th July - America’s Independence Day - the Americans will pit their wits against the best of Britain in the ultimate battle to determine which side of the pond are the true kings and queens of trivia.\nThe Beast will be joined by a collective of bright minds that includes past Mastermind winners. They will take on a US team led by Jeopardy! champion Ken Jennings who is backed by other top quiz and trivia buffs.\nThe special challenge will see both teams go head-to-head in one live “race” attempting to answer tough general knowledge questions.\nA cash prize is at stake as well as pride, with a total of $1,776 up for grabs - representing the year the US declared its independence from Britain. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nThe public will then have a chance to challenge the winning team afterwards, taking them on in versus mode.\nDevon's Mark Labbett said: “After 242 years Great Britain is reluctantly prepared to accept the Declaration of Independence but we will never accept that Americans are smarter than us (all those Nobel Prizes don’t count).\n\"I have challenged the good folk of FleetWit to produce five of their finest trivia brains to take on the UK in the Ryder cup of internet trivia! Read More Ex-maths teacher raised in Tiverton and now TV star Mark Labbett being rumoured for Strictly Come Dancing\n\"The British Empire will strike back with the finest bar trivia geeks on the planet and we will take on your superstars on neutral ground: Superbowls, Academy Awards, Friends, The Simpsons, World Wars 1&2, WWE....To misquote that great Philosopher Dwayne Johnson: you bring the asses and we’ll bring the whupping!\"\nKen Jennings added: “On behalf of American quizzers everywhere, we gladly accept this Fourth of July FleetWit challenge from our fellow empire-in-decline, Great Britain! Americans have long been accustomed to victory over our cousins from that rainy little island across the Atlantic, from the American Revolution to the War of 1812 to every ‘Most Annoying Tourists’ poll ever conducted.\n\"As that great American Charlie Sheen once said: ‘WINNING!’ Hashtag tiger blood.\n\"Prepare to be so surprised that your monocles fall off your red-cheeked little faces and splash into your tea and/or microwaved Tesco chicken tikkas! Prepare to be spanked and humiliated so thoroughly that you'll think you're back at boarding school! Two nations will enter the trivia arena this July 4...but only one will 'Brexit' in disgrace.” Read More Why The Chase's Mark Labbett is called The Beast\nFleetWit recently launched in the UK with a collaboration with Channel 4’s Countdown co-host, Rachel Riley. Since the launch, players have been able to challenge Rachel to a race in a particular theme which will continue in August.\nRewarding players for their knowledge, FleetWit provides cash prizes to players testing their skills at trivia questions, puzzles, brain games and more.\nAvailable 24 hours a day, trivia obsessives can log in and compete live against friends, family or other players.\nKnown as “races” within the app, FleetWit players can choose a game type and category ranging from General Trivia, Movies, Literature, History, Geography, Sports, Puzzles, Genius, Food and Drink, Music, Science and TV - testing their skills using intelligence and speed.\nTo find out more visit https://www.fleetwit.com and download the app in your app store. Like us on Facebook", "external_links": ["https://www.fleetwit.com/", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-02T17:49:00.000+03:00", "crawled": "2018-07-02T18:16:58.025+03:00", "highlightTitle": ""}