{"organizations": [], "uuid": "ea8198a5e0bc9a4690d8846a22b0f2dcd29a94ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14022391.ece/ALTERNATES/s1200/John-McDonnell-interview.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/shadow-chancellor-john-mcdonnell-explains-14906482", "country": "GB", "domain_rank": 21960, "title": "Shadow Chancellor John McDonnell explains what the Durham Miner's Gala means to him", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-13T20:13:00.000+03:00", "replies_count": 0, "uuid": "ea8198a5e0bc9a4690d8846a22b0f2dcd29a94ed"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/shadow-chancellor-john-mcdonnell-explains-14906482", "ord_in_thread": 0, "title": "Shadow Chancellor John McDonnell explains what the Durham Miner's Gala means to him", "locations": [], "entities": {"persons": [{"name": "john mcdonnell", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "corbyn", "sentiment": "none"}, {"name": "mcdonnell", "sentiment": "none"}], "locations": [{"name": "north", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}], "organizations": [{"name": "durham miner", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "durham miners’ gala", "sentiment": "none"}, {"name": "durham miners association", "sentiment": "none"}, {"name": "chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shadow Chancellor John McDonnell explains what the Durham Miner's Gala means to him Labour's Shadow Chancellor says he wants every Labour MP to feel welcome at the Big Meeting Share Shadow chancellor John McDonnell (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nLabour Shadow Chancellor John McDonnell says Labour will use the Durham Miners’ Gala to present its plans to invest in the North and to help create good jobs.\nHe hailed the Big Meeting as “celebration of the history of our movement” but said it had also taken on a new role as a chance to look at what Labour and trade unions would achieve in the future.\nSpeaking to the Chronicle as he travelled to Durham, Mr McDonnell also encouraged Labour MPs who have criticised Jeremy Corbyn in the past to attend the Gala - as long as they gave “support for the campaign to get a Labour government”.\nIn recent years, the Gala’s organisers have told Mr Corbyn’s critics that they are not welcome.\nAnd in May this year, Durham Miners Association general secretary Alan Cummings told the Morning Star newspaper that five North East MPs who called for a second referendum on Brexit “will not be invited”.\nSome commentators see the referendum call as a coded attack on Mr Corbyn, who has said the result of the 2016 Brexit vote must be respected.\nBut Mr McDonnell said the party could now come together around the policies of Labour’s 2017 General Election manifesto. Read More The Government wants to revive shipbuilding - so why is it offering contracts overseas?\nHe said: “I want everybody to be participating in this celebration. And also, more importantly, I want everybody participating in the planning that we are doing now to secure a Labour government, and when we go into government.\n“So I’m hoping all those MPs who may have been critical in the past of me and Jeremy and some of the policies we have been pursing, we demonstrated in last year’s general election just how popular those policies were. They all stood on that manifesto that we published, and all of them have an increased majority.\n“So yes, I would welcome them participating, I would welcome them coming along to the Gala itself, but doing it on the basis of support for the policies, support for the campaign to get a Labour government.”\nThe Shadow Chancellor will not be attending the Gala itself, where Mr Corbyn will be speaking. But he took part in a events in Durham the day before the Big Meeting.\nHe said: “One of the events is specifically looking at what a Labour government would do when it comes to power to tackle the economic problems, particularly in the North.\n“We’re talking about what Labour’s plans will be for the economy, how do we restore jobs - well paid and high skilled - and how do we ensure we tackle the imbalance of investment that’s gone on, in terms of the North in particular.” Read More East Coast Main Line needs 'immediate investment' before it's too late\nA Labour government would restore trade union rights, ending the restrictions introduced by Conservative governments, he said.\nAnd the Gala had taken on a new role as a place to talk about the future of the labour movement and the country under a Labour government.\n“Jeremy Corbyn will be talking about what we do once we get into government. The investment we will be putting into the North in particular, and also all around the country.\n“Jeremy will be talking about one of our key policies, making sure workers have trade rights from day one, exactly as [former Labour leader] John Smith promised back in the 1990s.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-13T20:13:00.000+03:00", "crawled": "2018-07-13T21:11:20.004+03:00", "highlightTitle": ""}