{"organizations": [], "uuid": "5930dd9f446fb5c9dfaa7d9ba2bfd28459f122be", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1173263.ece/ALTERNATES/s1200/The-Beachcomber-Cafe-TeignmouthJPG.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/popular-cafe-looking-new-tenants-1816497", "country": "GB", "title": "Popular cafe looking for new tenants to help it rise from the ashes", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-23T16:48:00.000+03:00", "replies_count": 0, "uuid": "5930dd9f446fb5c9dfaa7d9ba2bfd28459f122be"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/popular-cafe-looking-new-tenants-1816497", "ord_in_thread": 0, "title": "Popular cafe looking for new tenants to help it rise from the ashes", "locations": [], "entities": {"persons": [{"name": "tim martin", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "cllr tim golder", "sentiment": "none"}, {"name": "daniel clark", "sentiment": "none"}, {"name": "andy styles", "sentiment": "none"}], "locations": [{"name": "beachcomber cafe", "sentiment": "none"}, {"name": "teignmou", "sentiment": "none"}], "organizations": [{"name": "teignbridge district council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Popular cafe looking for new tenants to help it rise from the ashes The Beachcomber Cafe in Teignmouth has been shut since a huge fire in July 2017 Share Daniel Clark Local Democracy Reporter 14:48, 23 JUL 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nNew tenants for a fire-damaged seafront café in Teignmouth are being sought so it can rise from the ashes.\nThe Beachcomber Café in Teignmouth has been closed since the blaze in July 2017 when the fire destroyed the kitchen, takeaway and service areas of the much-loved Beachcomber on The Den .\nThe rest of the seafront building was left badly damaged by smoke and water. The Beachcomber Cafe in Teignmouth (Image: Andy Styles)\nThat now looks unlikely as, although the cafe will soon be ready to re-open , there is no one to run it at the moment. Read More Wetherspoons' boss Tim Martin on his favourite Exeter pubs, the best ‘spoons, students, Brexit and pink gin\nCllr Tim Golder, Teignbridge District Council’s executive portfolio holder for economy, skills and tourism, said: “This is an exciting business opportunity in a wonderful location in a very popular seaside town. \"Securing an operator to run a commercially viable, sustainable and vibrant business that delivers economic and social benefits for the community continues to form part of Teignbridge’s key business objectives.” Fire in the Beachcomber Cafe on Teignmouth seafront on July 25, 2017 (Image: Facebook/Teignmouth Fire Station)\nCllr Sylvia Russell, ward member for Teignmouth East and executive portfolio holder for health and wellbeing, added: \"The news that the building will rise from the ashes is very good news for Teignmouth and we all look forward to seeing this popular café back in business. I would also like to thank the outgoing tenants for maintaining the high standards and excellent reputation of The Beachcomber and wish them well in the future.\" Read More Devon fishermen say they are sure great white sharks are in our waters - and more will come\nPlanning permission for building upgrade works, for replacement windows and aluminium panels to the roof, at the café were unanimously approved by the council in March. The fire destroyed the kitchen, takeaway and service areas of the Beachcomber Cafe, and the rest of the seafront building was left badly damaged by smoke and water (Image: Facebook/Teignmouth Fire Station)\nA council spokesman added: “The works to renew the windows and external cladding to modernise and improve the property’s external appearance will begin shortly. It will mean the building remains closed but when it does open, it will have a much more modern and improved look and feel. Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-23T16:48:00.000+03:00", "crawled": "2018-07-23T16:57:06.007+03:00", "highlightTitle": ""}