{"organizations": [], "uuid": "f9acd5e9932179eebc81211b5d9dd4808875aa5b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1833060.ece/ALTERNATES/s1200/0_Hot-weather-warning.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/heatwave-drought-hurtling-increasingly-desperate-1833042", "country": "GB", "title": "Heatwave and drought are 'hurtling increasingly desperate farmers into crisis'", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-27T15:30:00.000+03:00", "replies_count": 0, "uuid": "f9acd5e9932179eebc81211b5d9dd4808875aa5b"}, "author": "Max Channon", "url": "https://www.devonlive.com/news/devon-news/heatwave-drought-hurtling-increasingly-desperate-1833042", "ord_in_thread": 0, "title": "Heatwave and drought are 'hurtling increasingly desperate farmers into crisis'", "locations": [], "entities": {"persons": [{"name": "lycetts", "sentiment": "none"}, {"name": "simon hay", "sentiment": "none"}], "locations": [], "organizations": [{"name": "rabi", "sentiment": "none"}, {"name": "met office", "sentiment": "none"}, {"name": "royal agricultural benevolent institution", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Heatwave and drought are 'hurtling increasingly desperate farmers into crisis' Crops stopped growing six weeks ago, animals have died in the heat and some farmers can't feed their herds Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nWith temperatures expected to break records today (Friday), a Devon-based agricultural expert has said farmers are 'hurtling towards a crisis point'.\nSheepdogs, lambs and calves have died in the heat, the situation has become so severe that some farmers have been unable to feed their livestock - and crops stopped growing six weeks ago.\nSimon Hay, of rural insurance specialists Lycetts , said the searing heat and a lack of rain in recent months is taking its toll on farmers, who are increasingly faced with animal welfare issues, crop failure concerns and wildfire risks.\nAnd farming charity Royal Agricultural Benevolent Institution (RABI) says it is bracing itself for a surge in calls for help.\nToday, July 27, has been dubbed 'Furnace Friday’, as the Met Office predicted it could be the hottest day in recorded history, surpassing August 2003’s 38.5C high.\nBut Simon highlighted the adverse impact the unabated heatwave is having on farmers, who are\nalready feeling the pressure, with some having to sell livestock they can’t feed.\nHe warned, if the hot weather continues as expected, farming businesses will have an uphill battle to\nrecover – and could be dealing with the effects of the hot and dry spell until early next year.\nExeter-based Simon said: \"Farmers are hurtling towards a crisis point. Read More\n\"We have not seen weather like this in decades and, although people up and down the country are\nenjoying a break from the gloomy British summertime, it is sinking in that such unrelenting hot\nweather can have dire consequences, evidenced by the current public health warnings.\n\"Farmers have been battling to survive during this heatwave, faced with drought conditions,\ntinderbox fields, and livestock they can’t feed – they are growing increasingly desperate with every\nday. Some farmers are struggling to feed their livestock\n\"Crop yields are down, at least 10 per cent, due to the dryness. Crops stopped growing six weeks\nago, resulting in food shortages for livestock and poor harvests.\n“There is no grass for cows to graze and farmers are being forced to use their winter stocks – which\nare already low – to keep them going. This paves the way for a very challenging six months ahead.\n“And the worst could be yet to come. Experts are warning that extreme heatwaves in the summer\ncould be the new norm, leaving agricultural businesses’ future hanging in the balance.”\nSimon said that farmers are feeling the effects of the hot weather in other ways too. Read More\nHe recounted cases where sheepdogs, lambs and calves have died in extreme heat, and wildfires\nhave been making headlines up and down the country.\n“The sad reality is that farmers, particularly smaller operations, are having to deal with all these risk\nfactors on their own. It is hard for them to juggle the responsibilities of keeping their animals and\nfields healthy in such sustained, adverse weather,” said Hay.\n“They can certainly take steps, such as ensuring there is enough shade and water available for their\nlivestock, ensuring hay stacks are kept out of direct sunlight, away from glass or mirrors, entrances\nto fields are easily accessible for fire engines and making fire departments aware of sources of water\non their land in case of an emergency.\n“Many farmers are also using water dowsers when harvesting, as combine harvesters are more\nprone to catching fire in this heat. Read More\n“But members of the public can do their bit too, particularly when it comes to enjoying sunny days\nout in the countryside.\n“Fields are like tinder in this weather, so ensure that cigarettes are discarded of properly, refrain\nfrom lighting disposal BBQs, unless in designated areas, and don’t leave any glass behind, which\ncould spark a fire.\n\"Anyone who sees a fire should contact the fire authorities right away. Even something as\ninnocuous as a bit of smouldering can quickly escalate and cause extensive damage.”\nMalcolm Thomas, chairman of farming charity RABI , said: “As things stand, I’d envisage a busy autumn / winter for RABI, with many livestock farmers already forced to feed winter rations to their stock. Having to buy more feed will quickly drive up overheads. Read More What your car says about you (BMW haters should look away now) “We’ve not seen weather like this in decades – and it’s worth remembering that it comes hot on the heels of a long cold winter and a particularly wet spring this year, which resulted in floods in many areas. “Farmers have been constantly forced to reassess and change plans for some time now. Many had to house cattle indoors much longer than usual in March and April, depleting valuable food stocks in the process.” From July 16-24, RABI received 31 calls / referrals for help. Speaking from the Royal Welsh Show, Malcolm Thomas said: “Those figures are exceptionally high for this time of year and although they are not all weather-related cases, our welfare team is very busy at present.\n\"The overwhelming feedback I’m getting from farmers at the Royal Welsh is that the fallout from this heatwave is already extremely serious for our industry, and it’s likely to get worse. A lot of people are affected and deeply concerned. “We usually find there’s a time lag between someone suffering hardship and contacting us for help, so we expect to receive even more calls in the coming weeks and months. “Drought-related issues will last long after the rains have come. A lot of farmers will be playing catch-up through the autumn and beyond.”\nRABI has been around since 1860 and is farming’s oldest and largest welfare charity. Last year, RABI gave out grants of close to £2 million to people of all ages in financial need. During difficult times RABI can help in various ways, such as contributing towards domestic bills or providing emergency grants. Support is tailored to suit individual need.\n“Reacting to what the elements throw at you is part of a farmer’s life and most in the sector accept that,” added Mr Thomas. “However, extreme weather, like we’ve seen recently, creates extreme challenges that make it impossible to plan for anything. There’s already tremendous uncertainty about the future of our industry due to Brexit and the implications a possible ‘no deal’ outcome would have on livelihoods. “Whatever lies ahead, however, RABI remains in a strong position to support those in financial need in the farming industry.” Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-27T15:30:00.000+03:00", "crawled": "2018-07-27T16:01:45.000+03:00", "highlightTitle": ""}