{"organizations": [], "uuid": "d8a36de7213161d257eb7705f29085bc490ed616", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14934250.ece/ALTERNATES/s1200/0_Anne-Marie-Trevelyan.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/vote-leave-questions-over-position-14932909", "country": "GB", "domain_rank": 21960, "title": "Vote Leave: Questions over position of MP who sat on board as campaign is referred to police", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-20T18:00:00.000+03:00", "replies_count": 0, "uuid": "d8a36de7213161d257eb7705f29085bc490ed616"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/vote-leave-questions-over-position-14932909", "ord_in_thread": 0, "title": "Vote Leave: Questions over position of MP who sat on board as campaign is referred to police", "locations": [], "entities": {"persons": [{"name": "julie elliot", "sentiment": "none"}, {"name": "rachael maskell", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "electoral commission", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "york central", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily Thank you for subscribing!\nA Northumberland MP is among those facing questions over her involvement in the Brexit campaign group which broke electoral law.\nBerwick MP Anne-Marie Trevelyan is a former board member of Vote Leave, which has been fined £61,000 and referred to police.\nThe Electoral Commission said the group exceeded its £7m spending limit by funnelling £675,315 through pro-Brexit youth group BeLeave - though the group branded the findings “wholly inaccurate”.\nThis week a number of Labour MPs, including Sunderland MP Julie Elliot, called for the referendum to be re-run as a result of “cheating”.\nAnd questions have been raised over the positions of politicians who were of key members of Vote Leave. Read More Leave campaign 'cheated' to win EU referendum - now North East MP wants Brexit to be scrapped\nLabour MP Rachael Maskell, who represents York Central, posted on Twitter: “This is so serious; a complete undermining of our democracy. Unless the Government acts on this corruption and cheating in the EU referendum, it is complicit.\n“The PM can start with suspending those in her Government who were on the Board of Vote Leave.”\nJon Trickett MP, Labour’s Shadow Cabinet Office Minister, said MPs who worked with Vote Leave must “fully cooperate with police” and added “the Government must take all necessary steps to restore public trust.”\nAccording to the Vote Leave website, Mrs Trevelyan sat on the board of the campaign and is listed as a now-resigned director on Companies House. It states she stepped down on June 30 2016, a week after the EU referendum .\nShe is not listed as a member of the campaign committee, which is described as the governing body which set the “campaign strategy”. This group included high-profile MPs such as Michael Gove and Boris Johnson.\nHowever, as a board member, Ms Trevelyan was involved in what Vote Leave’s website describes as the “overall governing body for the campaign”.\nDespite repeated attempts, Ms Trevelyan’s team has not responded to requests for comment. What was Vote Leave?\nVote Leave was the officially designated lead campaign for the Brexit side in the 2016 EU referendum.\nFronted by Conservative Boris Johnson, it was a cross-party campaign which also drew backing from Labour MPs like Kate Hoey and then UKIP MP Douglas Carswell.\nIt saw off competition from Nigel Farage-backed rival Leave.eu to secure \"lead campaign\" status, giving it access to £600,000 in public funds, a free mailshot, TV broadcasts and the right to spend up to £7m on the referendum battle.\nThe campaign's most high-profile weapon was a bright-red bus carrying the words \"We send the EU £350m a week. Let's fund our NHS instead\".\nVote Leave said: “The Electoral Commission’s report contains a number of false accusations and incorrect assertions that are wholly inaccurate and do not stand up to scrutiny.\n“It is astonishing that nobody from Vote Leave has been interviewed by the commission in the production of this report, nor indeed at any point in the past two years. “Yet the commission has interviewed the so-called ‘whistleblowers’ who have no knowledge of how Vote Leave operated and whose credibility has been seriously called into question. A Vote Leave placard during the EU referendum (Image: PA)\n“Vote Leave has provided evidence to the Electoral Commission proving there was no wrongdoing. And yet despite clear evidence of wrongdoing by the Remain campaign, the commission has chosen to ignore this and refused to launch an investigation.\n“All this suggests that the supposedly impartial commission is motivated by a political agenda rather than uncovering the facts.\n“The commission has failed to follow due process, and in doing so has based its conclusions on unfounded claims and conspiracy theories. Read More Developer demands £13m from Northumberland County Council as details of explosive legal claim emerge\n“We will consider the options available to us, but are confident that these findings will be overturned.”\nThe Electoral Commission denied accusations of political bias, insisting it had followed “due process” and had spent three months and made five attempts to interview Vote Leave representatives. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-20T18:00:00.000+03:00", "crawled": "2018-07-21T00:13:28.010+03:00", "highlightTitle": ""}