{"organizations": [], "uuid": "db96dc176fc8ddc8690bbd3f94864fcd3f58d91e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14885567.ece/ALTERNATES/s1200/Untitled-design.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-resigns-leaving-theresa-14886177", "country": "GB", "domain_rank": 21960, "title": "Boris Johnson resigns, leaving Theresa May's Brexit plans in chaos", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-09T18:19:00.000+03:00", "replies_count": 0, "uuid": "db96dc176fc8ddc8690bbd3f94864fcd3f58d91e"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/boris-johnson-resigns-leaving-theresa-14886177", "ord_in_thread": 0, "title": "Boris Johnson resigns, leaving Theresa May's Brexit plans in chaos", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "boris johnson", "sentiment": "negative"}, {"name": "boris jo", "sentiment": "negative"}, {"name": "david davis", "sentiment": "none"}, {"name": "boris", "sentiment": "none"}], "locations": [{"name": "downing street", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Boris Johnson resigns, leaving Theresa May's Brexit plans in chaos Former Foreign Secretary Boris Johnson has joined former Brexit Secretary David Davis in quitting the Government Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nForeign Secretary Boris Johnson has resigned from Theresa May’s government.\nIt’s the second huge blow to Prime Minister Theresa May, following the resignation on Sunday night of former Brexit Secretary David Davis.\nLast week, the Cabinet appeared to be united around a plan for Brexit, allowing talks with the EU to begin in earnest at last.\nBut that unity has now fallen apart, while Theresa May’s future as Conservative leader and Prime Minister appears uncertain.\nA Downing Street spokesman said: “This afternoon, the Prime Minister accepted the resignation of Boris Johnson as Foreign Secretary. His replacement will be announced shortly. The Prime Minister thanks Boris for his work.” Boris Johnson (left) and David Davis (right) (Image: PA)\nMr Johnson had been due to host a summit in London about forging closer links between European nations and the Western Balkans.\nBut it seemed he didn’t turn up.\nAs the day began, junior Brexit minister Steve Baker followed Mr Davis in resigning.\nThe Prime Minister replaced Mr Davis with former housing minister Dominic Raab.\nBut the former Brexit Secretary piled pressure on the Prime Minister as he warned the UK is giving “too much away, too easily” in talks with the EU and accused Mrs May of pursuing a “dangerous strategy”.\nMr Davis told BBC Radio 4’s Today: “It seems to me we are giving too much away too easily and that’s a dangerous strategy at this time.\n“Hopefully we will resist very strongly any attempt to get any further concessions from us on this, because I think this goes further than we should have gone already.” Read More What will Brexit mean for jobs in the North East? MPs are in Brussels to find out\nDescribing the plans as having a “number of weaknesses”, he explained that it would “not have been plausible” for him to be “front and centre in delivering” it.\nMr Davis insisted he was not trying to topple Mrs May, saying a leadership challenge would be the “wrong thing to do”.\nHowever, rumours began to circulate that Mr Johnson could join Mr Davis in quitting the Government.\nThe Government’s Brexit proposals were apparently endorsed by the Cabinet at a meeting at Chequers, the Prime Minister’s country house, on Friday. Key points in the Government’s proposed deal include:\n* The UK to leave the European Union on 29 March 2020, but an “implementation period” will continue until the end of 2020.\n* The UK and the EU to establish a free trade area for goods\n* The UK commits by treaty to ongoing harmonisation with EU rules on goods, covering only those necessary to provide for frictionless trade at the border.\n* The EU and UK would to together to create a “combined customs territory”. The UK would apply the British tariffs on goods intended for the UK, and the EU’s tariffs and trade policy for goods intended for the EU.\n* Freedom of movement will end, but there will be “a mobility framework so that UK and EU citizens can continue to travel to each other’s territories, and apply for study and work”.\nBut some supporters of Brexit argue that the planned deal will force the UK to continue obeying EU rules.\nNorth East Conservatives responded very differently to the proposals.\nHexham Conservative MP Guy Opperman gave full-bodied support to the deal - and to Theresa May.\nIn a series of Tweets before Mr Davis resigned, he said: “The detailed proposals for our post-Brexit relationship with the EU is a compromise which I support, and would hope that MP colleagues in all parties in Parliament can get behind as we continue our EU negotiation onwards.”\nAnd he said: “Whether you vote Conservatives - or oppose bitterly - I hope that you admire, as I do, the obstinate persistence, the sense of public duty and sheer grit of the Prime Minister Theresa May in 10 Downing Street as she does her best for Britain.” Read More Boris Johnson resignation LIVE: Foreign secretary resigns after Brexit fury with Theresa May\nHowever, Berwick-upon-Tweed Conservative Anne-Marie Trevelyan, a supporter of Brexit, appeared to criticise the plan, as she shared a comment by former Liberal Democrat leader Nick Clegg on her Twitter feed.\nMr Clegg said: “I hate to say this, but Brexiters would be right to reject PM’s plan. Dual EU/UK tariffs would create vast red tape, smugglers would boom, Parliament would be humiliated.”\nWhile battle rages within the Conservative Party, it remains to be seen whether the EU will accept the proposed deal or not. Read More\nMeanwhile Ian Lavery, MP for Wansbeck and the Labour Party Chair, responded to Mr Davis’ resignation by suggesting the Government could not carry on.\nHe said: “This is absolute chaos and Theresa May has no authority left.\n“The Prime Minister is in office but not in power. She cannot deliver Brexit and our country is at a complete standstill, while the Tories indulge in their leadership tussling.\n“We can’t go on like this. Britain needs a functioning Government.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-09T18:19:00.000+03:00", "crawled": "2018-07-09T20:57:13.015+03:00", "highlightTitle": ""}