{"organizations": [], "uuid": "e1724a035f840dd25fa61468248e19b31ca9f22b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14954305.ece/ALTERNATES/s1200/0_Japan-v-Cambodia-2018-FIFA-World-Cup-Qualifier-Round-2-Group-E.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/sport/football/transfer-news/yoshinori-muto-deal-still-take-14960314", "country": "GB", "domain_rank": 21960, "title": "Why the Yoshinori Muto deal may still take a while: Explaining the work permit rules", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-27T16:19:00.000+03:00", "replies_count": 0, "uuid": "e1724a035f840dd25fa61468248e19b31ca9f22b"}, "author": "Mark Douglas", "url": "https://www.chroniclelive.co.uk/sport/football/transfer-news/yoshinori-muto-deal-still-take-14960314", "ord_in_thread": 0, "title": "Why the Yoshinori Muto deal may still take a while: Explaining the work permit rules", "locations": [], "entities": {"persons": [{"name": "yoshinori muto", "sentiment": "negative"}, {"name": "deandre yedlin", "sentiment": "none"}, {"name": "fabian schar", "sentiment": "none"}, {"name": "mo diame", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "senegal", "sentiment": "none"}, {"name": "mainz", "sentiment": "none"}, {"name": "switzerland", "sentiment": "none"}], "organizations": [{"name": "invalid email newcastle united", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "getty images asiapac", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "premier league", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Could not subscribe, try again later Invalid Email\nNewcastle United are ready to complete a deal for Yoshinori Muto.\nHe's a full international so will need to have a work permit approved to sign for United or any other Premier League club.\nThe Muto deal has been agreed with his Bundesliga club Mainz but as the German side and Newcastle have been at pains to point out, there are still hurdles to overcome for the deal to be rubber stamped. The biggest one of those is whether he will be able to qualify for a work permit to play for United.\nIt’s not something that Newcastle have had to worry about too much before this summer. The last time they signed a player who hailed from outside the EU it was DeAndre Yedlin, who already had a work permit that was applied for in 2014 (and approved after an appeal). Yoshinori Muto (Image: Getty Images AsiaPac)\nAlthough Mo Diame represents Senegal he also has a French passport so was free to play for Newcastle under the European Union rules – while Fabian Schar qualifies because Switzerland has an agreement with EU countries for freedom of movement.\nFor Muto – and for any deal for Nandez – Newcastle would need to apply for Governing Body Endorsement, which is effectively the Premier League’s approval for an overseas player outside of the EU to join their club. This is part of an agreement with the Home Office, who operate a points based system to determine whether a player should be granted a work permit.\nTwo of their other signings this summer – Ki sung-Yueng and Kenedy – both already have the work permit Newcastle will be looking for with Muto. Ki’s based on his international record while Kenedy’s is a discretionary work permit based on his wages and the transfer fee Chelsea paid for him (taken as proof of his value in the absence of regular international football).\nThe rules are there to ensure that any player coming into the Premier League will add value to the league. It effectively prevents players who aren’t internationals and were born outside the EU from getting a work permit – although there are rules to get around that. What are the rules?\nIt’s quite complicated. The Premier League have two tiers of endorsement: guaranteed and discretionary.\nGuaranteed is there to make it easy for high calibre players from overseas to get quick work permits and it is based on players playing a set number of games for their country. If a country is in the top ten of the FIFA rankings, a player will only have to have played 30% of all matches in the previous two years to get a permit.\nIt’s 45% if they are between 11 and 20 right down to 75% if a country is between 31-50 in the FIFA rankings. There is no provision for rankings under 50 and Japan are currently 61st in the FIFA rankings but could still qualify because there is a line in the guidance that states: “The player’s National Association must be at or above 70th place in the official FIFA World Rankings when averaged over the two years preceding the date of the application.”\nWith Japan low in the rankings, Muto might struggle on these grounds. He has not played 75% of the recent games (indeed he’s only played six times across two years). Video Loading Click to play Tap to play The video will start in 8 Cancel Play now What does this mean for Muto?\nThe good news is because of where he’s been playing and the fact he’s an established international he should get a work permit. But it may take a bit longer if he does not qualify for guaranteed endorsement which it does not look like he will.\nHe could still get discretionary endorsement. The Premier League rules state: “If a player does not meet the automatic criteria set out, an applicant club can request that an Exceptions Panel consider the player’s experience and value in order to determine whether a Governing Body Endorsement should nevertheless be granted.”\nThis in effect is a three-man panel that consider the player’s experience and value. They will take into account the quality of the league they are transferring from – the Bundesliga is one of the designated ‘top leagues’ by the Premier League so that is a big tick – and the value of the player (both in terms of transfer fee paid and also the wages paid to him).\nThe Premier League designates an average fee and average wage across the entire division and will usually grant an endorsement if the player’s fee and wages are above that because they demonstrate the financial commitment a club has made to the player. With Muto a £9million buy for Newcastle and likely to be on a salary above the average across the top flight, they should have enough evidence to guarantee him a work permit.\nIt costs £500 for every application – and £5,000 for every panel, which has to be convened by the Premier League. What about Brexit?\nAlthough players from EU clubs are free to play in England, that won’t be the case next year.\nObviously it hasn’t come into force yet so there’s no impact at the moment but it will complicate matters and this is the last window where players from EU countries will be free to transfer in unlimited numbers.\nWith Britain set to leave the European Union in March next year, it will be interesting to see what provisions are in place for European transfers next summer and what impact it will have on Premier League clubs from the 2019/20 season.\nWith freedom of movement one of the government’s ‘red lines’, there will have to be some sort of agreement negotiated but like everything else to do with Brexit, we’re yet to receive any clarity.\nThe Government addressed this in a statement last year: “We recognize the importance of sport to the nation and within that the contribution that international talent makes. We are in discussions with key representatives from the sport sector, including the Premier League, regarding the challenges and opportunities that our EU exit brings.”\nBloomberg reported that the Premier League is “lobbying May’s government to allow an open system, where any club could sign 17 players of its choosing for its first team squad, which could have 25 players overall and thus would have at least eight homegrown players.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-27T16:19:00.000+03:00", "crawled": "2018-07-27T18:23:50.016+03:00", "highlightTitle": ""}