{"organizations": [], "uuid": "ed7eaa12e4df1161e0c5ad795b77a0df7002e8d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1776239.ece/ALTERNATES/s1200/Farmland.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/report-published-study-natural-capital-1776243", "country": "GB", "title": "Report published to study the natural capital of Exmoor National Park", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-12T02:34:00.000+03:00", "replies_count": 0, "uuid": "ed7eaa12e4df1161e0c5ad795b77a0df7002e8d2"}, "author": "Lewis Clarke", "url": "https://www.devonlive.com/news/devon-news/report-published-study-natural-capital-1776243", "ord_in_thread": 0, "title": "Report published to study the natural capital of Exmoor National Park", "locations": [], "entities": {"persons": [], "locations": [{"name": "exmoor national park", "sentiment": "none"}], "organizations": [{"name": "exmoor national park report", "sentiment": "none"}, {"name": "exmoor society", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Report published to study the natural capital of Exmoor National Park The report is titled Towards a Register of Exmoor’s Natural Capital Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe concept of natural capital lies at the heart of the Government’s recently published 25 Year Environment Plan.\nDefined as “the parts of the natural environment that produce value to people”, natural capital is set to play an increasingly influential role in how public policy develops, especially in special areas such as National Parks.\nThe Exmoor Society hast published the report of a commissioned study to investigate whether the natural capital approach can be used to include all the natural and cultural elements that make up Exmoor’s landscape. Titled Towards a Register of Exmoor’s Natural Capital , it prioritises those areas which need sustainable management by farmers and land managers and can be increased in extent and quality. The objective was to develop and pilot, in three areas, a practical toolkit for identifying the natural capital assets that deliver the full range of public benefits that can be provided by Exmoor. Read More\nThe study breaks new ground in four ways: It proposes a classification describing all elements of natural capital in a Register. It investigates and describes the relationship between natural capital and cultural considerations, a topic frequently neglected. It uses landscape character to ensure descriptions of natural capital are place-based and captures the distinctiveness and special qualities of landscape. It shows the importance of involving local knowledge and values to gain the commitment of the people who own, manage or use natural capital. This gives them a personal stake in the concept of natural capital.\n“Farming in a national park is about much more than conventional commodity production,” said Dr Keith Howe, vice-chairman of Exmoor Society.\n“In Exmoor, farmers also play a key role in creating, enhancing and maintaining its visual landscape so greatly enjoyed and valued by visitors and residents alike. In part, this landscape stems from extensive sheep and cattle livestock farming which uses the moorland, and partly from farmers in a role as stewards of the wider countryside.\n“Farmers also provide holiday and recreational facilities. They and their families are the also bedrock of a great deal of Exmoor’s social life and traditions. Other human dimensions include the tangible artefacts of its history and archaeology and intangibles such as the stories people tell about Exmoor, whether real or, like Lorna Doone, fictional. Cultural aspects are also part of what makes Exmoor a unique place of outstanding value.” Read More\nThe study makes significant suggestions for developing a natural capital register on Exmoor and testing its use in other areas. These cover the following topics: Need to improve understanding of natural capital and particularly the way that it supports cultural ecosystem services. Technical developments in database design and improving access to existing datasets will improve the usefulness of the register. Lack of information on some key assets, for example hedges and other landscape features, needs to be tackled by developing a robust standard methodology so that gaps in data can be filled. The register should be expanded so that it can be used to estimate the value of all the services provided by Exmoor, demonstrating the full worth of the National Park designation to the nation. Read More Swap city life for village life at this North Devon family house\nRachel Thomas, Chairman of Exmoor Society, added: “The study supports the post-Brexit agri-environmental report Exmoor’s Ambition . One of the principles of this is that future farm payments should be based on a register of natural capital on each holding. The work on the three pilot farms used in the Register should be an invaluable contribution.”\nThe origins of the study lie in the keynote address given to the Society’s 2017 Spring Conference by Professor Dieter Helm, chair of the government’s Natural Capital Committee. In response to a question about the use of natural capital in National Parks, he challenged Exmoor to investigate how the concept could be used in the context of the designation and its statutory purposes. The Trustees of the Exmoor Society responded to his challenge by commissioning this study.\nUpon receipt of the completed Register Prof Dieter Helm said: “This is an important first step! It is very gratifying to make a remark intended as a challenge and actually get it taken seriously and acted upon.”\nThe full report and technical appendix by Robert Deane and Anne Walker of Rural Focus Ltd can be viewed on The Exmoor Society’s website www.exmoorsociety.com Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-12T02:34:00.000+03:00", "crawled": "2018-07-12T03:02:58.000+03:00", "highlightTitle": ""}