{"organizations": [], "uuid": "2175afde55e9c8fd363d091b4b1203dd701d3207", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13584271.ece/ALTERNATES/s1200/Mixed-sex-ward-figures.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nhs-boss-says-health-service-14851434", "country": "GB", "domain_rank": 21960, "title": "NHS boss says health service is planning for all possible Brexit scenarios", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-01T15:00:00.000+03:00", "replies_count": 0, "uuid": "2175afde55e9c8fd363d091b4b1203dd701d3207"}, "author": "Agency Staff", "url": "https://www.chroniclelive.co.uk/news/north-east-news/nhs-boss-says-health-service-14851434", "ord_in_thread": 0, "title": "NHS boss says health service is planning for all possible Brexit scenarios", "locations": [], "entities": {"persons": [{"name": "simon stevens", "sentiment": "none"}, {"name": "stevens", "sentiment": "none"}, {"name": "andrew marr", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "nhs", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "invalid email nhs", "sentiment": "none"}, {"name": "bbc one", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News NHS boss says health service is planning for all possible Brexit scenarios There is 'significant planning' to prepare for the possibility of a no-deal Brexit, says NHS England CEO Simon Stevens Share A nurse on a ward at a hospital (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nNHS England chief executive Simon Stevens has revealed there is “significant planning” to ensure the health service is ready for a no-deal Brexit.\nMr Stevens said the NHS had been working with the Government to ensure the supply of medicines and equipment continues in “any Brexit scenario”.\nThe NHS boss told BBC One’s Andrew Marr Show that a no-deal Brexit was not “a desirable situation” but welcomed the preparations.\nLast October Mr Stevens told Parliament’s health select committee the service had not been asked by the Government to examine the potential impact of the UK leaving the EU without a trade deal in place.\nMr Stevens told the Andrew Marr Show: “There is immediate planning which the health department, with other parts of Government, are undertaking around securing medicine supply and equipment under different scenarios.\n“That will obviously crystallise when it’s clear later this autumn what the UK’s position will be.”\nHe added: “Nobody’s in any doubt whatsoever that top of the list in terms of ensuring continued supplies for all the things that we need in this country right at the top of the list has got to be those medical supplies.”\nMr Stevens also said that every hospital in England had been asked to “reach out” to EU nationals working for the service. Read More Paramedics will be issued body cameras to help protect against violent patients\nHe said: “Every hospital has now been written to asking them to reach out to their staff from the rest of the EU, providing that the Home Secretary has set a clear process by which people can apply to stay in this country which we hope they will do.”\nEarlier Mr Stevens was asked whether the extra £20 billion of funding announced for the NHS last month was enough.\nHe said it was a “significant improvement”, adding: “It represents a real step change in the money that will be going into the National Health Service over the next five years, compared with the last five or ten.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-01T15:00:00.000+03:00", "crawled": "2018-07-01T16:40:58.004+03:00", "highlightTitle": ""}