{"organizations": [], "uuid": "6595617e1ee91f3938d7cfc7c1b45f559bac5b30", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14194486.ece/ALTERNATES/s1200/FMP_SDR_30092015NSPCC2JPG.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/more-one-ten-privately-rented-14857183", "country": "GB", "domain_rank": 21960, "title": "More than one in ten privately-rented homes are unfit to live in", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-02T19:47:00.000+03:00", "replies_count": 0, "uuid": "6595617e1ee91f3938d7cfc7c1b45f559bac5b30"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/more-one-ten-privately-rented-14857183", "ord_in_thread": 0, "title": "More than one in ten privately-rented homes are unfit to live in", "locations": [], "entities": {"persons": [{"name": "john healey", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "labour’s shadow housing", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "ministry for housing", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "More than one in ten privately-rented homes are unfit to live in (Image: Handout) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nMore than one in ten privately-rented homes in the North East are unfit for people to live in.\nThe properties have what is known as a “category one hazard”, which can include damp and mould growth, a faulty gas boiler, fire risks or excessive cold in winter.\nFigures emerged as both major parties set out plans to help tenants secure better housing.\nThe statistics, published by Labour, are based on an analysis of the English Housing Survey, which is produced by the Ministry for Housing, Communities and Local Government.\nThere are 22,452 “unfit” private-rented homes in the North East, 11% of all the private-rented housing stock.\nJohn Healey, Labour’s Shadow Housing Secretary , said: “More people live in private rented housing now than at any time since the 1950s and hundreds of thousands of these homes are unfit to live in.”\nLabour has drawn up plans for what it calls “healthy homes zones”. Areas with particularly poor housing would be targeted for intensive intervention , including funding for the inspection of homes, additional powers requiring private landlords to be licensed and a tougher sanctions regime to drive bad landlords out of business.\nJonathan Ashworth, Labour’s Shadow Health Secretary, said poor housing damaged people’s health and this meant health policy was connected to housing police.\n“Housing related health problems are costing the NHS an estimated £1.4bn a year and poor housing can ruins people’s lives so for Labour in Government ... it will be a priority to combat housing related illness and ensure nobody’s poor home damages their health.” Read More Nine North East politicians call for referendum on Brexit deal after stark Nissan warning\nMeanwhile, the Government has announced a consultation giving tenants the right to a three-year tenancy agreement. This would provide them with more security and also make it easier for them to complain about poor conditions, according to James Brokenshire, the Secretary of State for Housing, Communities and Local Government.\nHe said: “I know this is particularly important for the growing number of families, vulnerable tenants and older people who rent and live with the uncertainty of suddenly being forced to move or fear eviction if they complain about problems with their home.\n“Which is why I’m announcing the launch of a consultation today on overcoming the barriers to longer tenancies in the private rented sector.\n“We’re proposing a new longer tenancy model, of a minimum of three years, with a six-month break clause to allow tenants and landlords to exit the agreement early if needed.”\nMr Brokenshire also said that the Government planned to crack down on unfair leasehold schemes. These typically involve new developments such as flats which are sold as leasehold properties with onerous conditions attached, such as ground rents which increase significantly over time. Read More The race to remain: Number of EU citizens applying to stay in North East after Brexit soars\nHe said: “Abusive practices in the leasehold market – unexpected costs that rise every year and bear no relation to services – can turn a homeowner’s dream into a nightmare.”\nAnd he announced: “Any new Government funding scheme will contain the condition that the money cannot support the unjustified use of leaseholds for new houses.\n“We want to build new homes yes, but not at any cost. This will bring real change and is an essential step to restoring pride and dignity to homeowners everywhere.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-02T19:47:00.000+03:00", "crawled": "2018-07-02T20:58:29.038+03:00", "highlightTitle": ""}