{"organizations": [], "uuid": "3c7e967a6492034f27ae114473fe47d75fa769f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14943629.ece/ALTERNATES/s1200/0_Cabinet-meeting-in-Gateshead.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-tyne-devolution-wont-approved-14943716", "country": "GB", "domain_rank": 21960, "title": "North of Tyne devolution won't be approved on schedule - but May 2019 election still 'on track'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-23T20:34:00.000+03:00", "replies_count": 0, "uuid": "3c7e967a6492034f27ae114473fe47d75fa769f1"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-tyne-devolution-wont-approved-14943716", "ord_in_thread": 0, "title": "North of Tyne devolution won't be approved on schedule - but May 2019 election still 'on track'", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "negative"}, {"name": "elizabeth ii bridge", "sentiment": "none"}, {"name": "parl", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}], "locations": [], "organizations": [{"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devolution latest\nThe North of Tyne leaders are now hopeful that the devolution deal will be debated and approved in Parliament before November in order for a May 2019 election to be able to go ahead.\nAsked if Parliament would be able to pass the necessary legislation before the summer recess, Mrs May said: “Well it won’t be, Parliament goes into recess tomorrow, so it’s not tabled for the next two days but we will bring it forward as soon as our parliamentary timetable allows us to.”\nThe deal is worth over £600m over 30 years and is expected to generate £1.1bn for the local economy, create 10,000 new jobs, and leverage £1.2bn in private sector investment. An aerial view of (from the top of Queen Elizabeth II Bridge) the bridges over the River Tyne (Image: PA)\nA spokesman for the North of Tyne said: “We were pleased to see Government confirm today that it will lay legislation in Parliament to formally conclude our historic devolution deal and transfer of unprecedented new powers to the North of Tyne.\n“We expect the order to be laid before the summer recess and to be debated when Parliament returns in the autumn. We remain on track to hold a mayoral election in May 2019.\n“Once the deal clears the Parliamentary process, we can progress with our plans to create new jobs and exciting opportunities for people across our region.”\nSpeaking to ChronicleLive, Andrea Leadsom, who, as Leader of the House, is responsible for organising the Government’s legislative business, was unable to shed further light on the precise timings of the devolution bill’s progress through Parliament. Read More Protesters make their voices heard outside Theresa May's cabinet meeting\nBut she denied Brexit was forcing other issues into the long grass, saying: “We’ve had a fundamental review of how we deal with secondary legislation so we’re far more on the front foot with planning and making sure it’s all absolutely ready to go and on time.”\nShe added: “I wouldn’t say that Brexit [is causing delays], although there is a lot of legislation that comes from that ... the actual amount of legislation isn’t significantly more than you would expect.”\nAsked if the North East could still be confident mayoral elections would happen in May 2019, Ms Leadsom said: “There is nothing in terms of the legislative pressing needs that would mean that won’t be the case.”\nShe added: ​“We’re not in a position where we’re crowded out and can’t fit anything else in.” Like us on Facebook", "external_links": [], "published": "2018-07-23T20:34:00.000+03:00", "crawled": "2018-07-24T02:22:07.006+03:00", "highlightTitle": ""}