{"organizations": [], "uuid": "f869e3f63125b39b1ae4ffcd50ec5e2e3171851f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14889812.ece/ALTERNATES/s1200/New-Government-Ministers-Meet-For-Cabinet.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-going-visit-newcastle-month-14897264", "country": "GB", "domain_rank": 21960, "title": "Theresa May is going to visit Newcastle this month", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-11T20:51:00.000+03:00", "replies_count": 0, "uuid": "f869e3f63125b39b1ae4ffcd50ec5e2e3171851f"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-going-visit-newcastle-month-14897264", "ord_in_thread": 0, "title": "Theresa May is going to visit Newcastle this month", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May is going to visit Newcastle this month Cabinet meetings are usually held in 10 Downing Street but the Prime Minister is bringing Ministers to Newcastle and Brexit will be on the agenda Share British Prime Minister Theresa May (Image: Getty Images Europe) Share Get daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nTheresa May is set to bring her Cabinet to Newcastle in July.\nCabinet meetings usually take place in 10 Downing Street, but one will be held in the North East on July 23 for the Great Exhibition of the North.\nIt will provide an opportunity for Mrs May and her most senior ministers to enjoy the celebration of the North of England’s pioneering spirit, taking place in Newcastle and Gateshead.\nThe Government is expected to make announcements about investment in the North to coincide with the visit and While in the North East, it is believed the cabinet will discuss local growth, skills and export strategy. Read More\nThe Cabinet meeting was arranged before last week’s summit at Chequers, where Ministers agreed on the Government’s approach to Brexit , and the resignations of Foreign Secretary Boris Johnson and Brexit Secretary David Davis.\nHowever, Brexit is likely to be high on the agenda.\nThe Government is to publish a White Paper setting out the proposed Brexit deal in more detail today, Thursday July 12.\nIt remains to be seen whether the EU will agree to the plans.\nAnd Mrs May is facing a battle with pro-Brexit Conservative MPs who are determined to force her into a u-turn over the some of the proposals.\nThey are angry at plans for the UK to continue to obey some EU rules after Brexit, as part of a proposed free trade zone for goods, and to create a “mobility framework”, which could mean EU citizens continue to be able to live and work in the UK.\nAnd they have begun to put pressure on the Prime Minister by tabling amendments to the Customs Bill, a key piece of Brexit legislation to be debated by the House of Commons next week.\nOne, signed by high-profile Brexiteer Jacob Rees-Mogg, former Tory leader Iain Duncan Smith and ex-cabinet minister Priti Patel, demands that the UK should scrap an offer to collect taxes and duties on behalf of the EU, unless the remaining 27 member states pledge to do the same for Britain.\nA second - backed by the Democratic Unionist Party, former cabinet minister Owen Paterson and Labour ’s Kate Hoey - would force the Government to commit itself in law not to allow a customs border down the Irish Sea.\nAnd others would require the UK to have a separate VAT regime from the EU and force the Prime Minister to table primary legislation if she wishes to keep Britain in the customs union.\nSenior Tory backbencher Sir Bernard Jenkin said: “These four amendments reflect existing Government policy, and we hope they will be welcomed by the Government.” Read More Who could replace Theresa May as Prime Minister? Here are the favourites\nSpeaking at the Nato summit in Brussels, Mrs May insisted that her Chequers deal delivered on the “red lines” which she set out in her Lancaster House speech last year.\n“It delivers on the vote that people gave on Brexit, it delivers the fact that we will have an end to free movement, we will have an end to the jurisdiction of the European Court of Justice in the UK, we won’t be sending vast contributions to the EU every year, we’ll be out of the Common Agricultural Policy, out of the Common Fisheries Policy,” she said.\n“We deliver that Brexit and we do it in a way that protects jobs and livelihoods and meets our commitment to Northern Ireland.”\nThe Prime Minister greets US President Donald Trump has he arrives in the UK on Thursday. On Friday he will visit a military base to witness a demonstration of the UK’s military capabilities and integrated UK-US military training.\nHe will then travel to Chequers for substantive bilateral talks with the Prime Minister on a range of foreign policy issues including Russia, trade, Brexit, and the Middle East. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-11T20:51:00.000+03:00", "crawled": "2018-07-12T05:09:03.000+03:00", "highlightTitle": ""}