{"organizations": [], "uuid": "e015aeb9eb6ded14238ab153e39240f9df8a5c04", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1802376.ece/ALTERNATES/s1200/0_shoet.png", "site_section": "http://www.westernmorningnews.co.uk/education-news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/dad-five-defends-wearing-offensive-1802343", "country": "GB", "title": "Dad-of-five defends wearing offensive T-shirt in shoe store after shopper left shocked", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-19T13:06:00.000+03:00", "replies_count": 0, "uuid": "e015aeb9eb6ded14238ab153e39240f9df8a5c04"}, "author": "Anita Merritt", "url": "https://www.devonlive.com/news/devon-news/dad-five-defends-wearing-offensive-1802343", "ord_in_thread": 0, "title": "Dad-of-five defends wearing offensive T-shirt in shoe store after shopper left shocked", "locations": [], "entities": {"persons": [{"name": "victoria anderson", "sentiment": "none"}, {"name": "clarks", "sentiment": "none"}, {"name": "brexit victoria", "sentiment": "none"}], "locations": [{"name": "tiverton", "sentiment": "none"}, {"name": "clarks", "sentiment": "none"}, {"name": "france", "sentiment": "none"}], "organizations": [{"name": "post office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Shock is caused by offensive T-shirt Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA shocked Tiverton shopper has told how she confronted a father-of-five who was wearing an offensive t-shirt with the word c*** on in the children’s department of a shoe shop.\nVictoria Anderson, 54, who lives near the town, was in Clarks on Tuesday afternoon when she noticed the words on his T-shirt. An offensive T-shirt\nHe was accompanied by a woman and a young child and, when confronted about his choice of clothing, he defended his actions by saying it was his right to display any message. Read More Day trip to France will cost an extra £5.50 and need a visit to Post Office after Brexit\nVictoria said: “Of all places, the children’s department of Clarks is somewhere you might feel quite safe to be with your child such as when buying your toddler their first pair of shoes.\n“The last thing I’d expect to see is a dad wearing a T-shirt which said in big letters on the front, ‘Someone might think the world of you but I don’t. I think you’re a c***’. The 'c' word was fully spelt out.\nSee what others are saying about the story in our comment section.\n“I went up the shop assistant to say I was going to challenge the man and said I would not be rude. She asked if I could do it outside but I wanted to address it in the shop.\n“I went up to him and said, ‘I’ve just been looking at your T-shirt and do you think it’s okay to be wearing it in the children’s department of Clarks?'\n“He said it was his right to display any message he likes. I was very calm and polite and said I agreed with that but some messages are not okay to be displayed in a place with children. What is the point in a message of hate? Clarks in Tiverton\n“When I told him I was a teacher he replied that he had five children and home-educated them. Afterwards I thought I should have asked the woman who he was with what she thought when she looks at him wearing that T-shirt?\n“He would have walked past many people in Tiverton and they could have been children who are learning to read and all ages who might be offended.\n“I’m not shocked by bad language as such but by the fact people buy these T-shirts in order to cause distress.\" Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-19T13:06:00.000+03:00", "crawled": "2018-07-19T14:02:15.152+03:00", "highlightTitle": ""}