{"organizations": [], "uuid": "29d5dca7f6e451046c2c85288b764c9d5af35efe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14866859.ece/ALTERNATES/s1200/GWR_-NJL_040718sagey_01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/businesses-need-access-top-talent-14866574", "country": "GB", "domain_rank": 21960, "title": "Businesses need access to top talent after Brexit, Sage boss says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-04T18:30:00.000+03:00", "replies_count": 0, "uuid": "29d5dca7f6e451046c2c85288b764c9d5af35efe"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/businesses-need-access-top-talent-14866574", "ord_in_thread": 0, "title": "Businesses need access to top talent after Brexit, Sage boss says", "locations": [], "entities": {"persons": [{"name": "stephen kelly", "sentiment": "neutral"}, {"name": "brexit", "sentiment": "neutral"}, {"name": "joh", "sentiment": "none"}, {"name": "elaine warburton", "sentiment": "none"}, {"name": "wayne hemingway", "sentiment": "none"}, {"name": "kelly", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "northern powerhouse", "sentiment": "none"}, {"name": "journal", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "boiler shop", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Businesses need access to top talent after Brexit, Sage boss says Stephen Kelly was speaking at the Northern Powerhouse Business Summit, part of the Great Exhibition of the North Share Sage chief executive Stephen Kelly at the Northern Powerhouse Business Summit in Newcastle (Image: Copyright unknown) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing!\nBusinesses in the North need access to the top talent if they are to meet the aims of the Northern Powerhouse, one of the region’s top bosses has said.\nSpeaking to The Journal before an appearance at the Northern Powerhouse Business Summit - part of the Great Exhibition of the North - Sage CEO Stephen Kelly also called for UK policians to focus issues like skills, education and productivity, and not simply on Brexit.\nThe three-day business summit kicked off at Newcastle’s Boiler Shop in Newcastle with a focus on innovation. As well as Mr Kelly, the event heard from QuantumDX chief executive Elaine Warburton, designer Wayne Hemingway and John Kampfner from the Creative Industries Federation.\nMr Kelly said that Sage’s UK staff, two-thirds of whom are based in Newcastle , contained people from 25 EU nations, and it was important for the company and the wider technology sector to retain that talent. The Northern Powerhouse Summit Day One (Image: newcastle chronicle)\nHe said: “The politicians in Whitehall and around the country need to focus on the domestic agenda. and that all starts with a very positive, optimistic vision for Britain and our role in the world. That’s all got to be predicated on innovation, growth and productivity.\n“This nation should be the most productive in the western world, it should have the best education system , it should be a talent magnet for the world’s best people - the computer scientists and the financial services people. It should be a digital nation that is way better than places - fantastic places - like South Korea.\n“Every technology business, and we’re no different, would always be worried about talent. If there’s one thing I worry about all the time it’s how do we attract and retain the best talent because our business is a human capital business. It’s about innovation and intellectual property and that’s all about talent. The Northern Powerhouse Summit Day One (Image: newcastle chronicle)\n“If you’d asked me that 10 years ago I would have said the same. But given what’s happened in terms of the whole discussion around Brexit, we absolutely have to really focus on talent and make sure we’re attracting and retaining the best people.”\nMr Kelly said many of the small businesses that make up Sage’s customer base were adopting a “keep calm and carry on” approach to the Brexit negotiations, but that “politically there was a lot to do to come up with a set of solutions that is workable”.\nHe also praised the devolution process in the North of Tyne and said Sage was looking to fill roles at its Newcastle base.\nThe business summit will continue tomorrow with a focus on “great opportunities” and speakers including Bank of England governor Mark Carney and Business Secretary Greg Clark.\nIt will end on Friday with a day themed around “great futures” where speakers will include Northern Powerhouse Minister Jake Berry, Greater Manchester mayor Andy Burnham and Newcastle City Council leader Nick Forbes. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-04T18:30:00.000+03:00", "crawled": "2018-07-04T19:10:06.004+03:00", "highlightTitle": ""}