{"organizations": [], "uuid": "22dd53c54f0e4fbb9292060e2b4d40b371da0cc4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1542786.ece/ALTERNATES/s1200/20mph.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/brexit-blamed-delay-20mph-speed-1817797", "country": "GB", "title": "Brexit blamed for delay in 20mph speed limit review", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-23T20:17:00.000+03:00", "replies_count": 0, "uuid": "22dd53c54f0e4fbb9292060e2b4d40b371da0cc4"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/brexit-blamed-delay-20mph-speed-1817797", "ord_in_thread": 0, "title": "Brexit blamed for delay in 20mph speed limit review", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "none"}, {"name": "cllr stuart hughes", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "department for transport", "sentiment": "none"}, {"name": "scrutiny task group", "sentiment": "none"}, {"name": "local authorities", "sentiment": "none"}, {"name": "devon county council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Brexit blamed for delay in 20mph speed limit review We have been waiting a while for this... Share Daniel Clark Local Democracy Reporter 18:17, 23 JUL 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email\nIf vehicles are speeding through your village, then Brexit could be to blame.\nBack in 2016, a Department for Transport report on the effectiveness of 20mph speed limits was started, and Devon County Council was waiting for that report to be published before its own policy review on speed limits was finalised.\nBut two years later, the Government report still has not been published.\nCllr Stuart Hughes, cabinet member for highway management, told last week’s full council meeting that he is frustrated at the length of time it has taken for the government to sort it out, adding: “It seems that Brexit has taken over everything.” New 20mph zones may be brought in for residential areas\nBut he added: “Officers are now reviewing our approach to speed limits via a Scrutiny Task Group and this review will look at the application of speed limits by other Local Authorities and the forthcoming Department for Transport report on 20mph speed limits, and I look forward to reading that report when it comes in.”\nCllr Hughes had been asked to report on the council’s plans to adopt 20mph zones around Devon’s schools by Cllr Alan Connett, but he said that there are no current proposals to adopt any new approach to 20mph limits at schools. Read More Plymouth to get new £12m crematorium at Saltram Park\nCllr Frank Biederman added that this delay in the report being published is just another sign of what is going on in Government as he brought this up two or three years ago.\nHe added: “It is not just around schools but also our villages. I think one of the number one things that most of us as councillors experience is complaints about the speed of traffic flying through our villages when trying to avoid pinch points, and rat running. Devon County councillor Stuart Hughes\n“We were told that there was a paper going through government but that seems to have gone nowhere, so we need to be pushing government on this. It is a real concern of residents about the speed of traffic and it would help us if there was some sort of policy on this to help us bring this in.\n“We already know that the police struggle as they don’t have the resources or the numbers to resources to enforce limits, so can we have another push to try and get a date for this report?”\nCllr Hughes said that he was awaiting the report and the Scrutiny Task Group’s report. Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-23T20:17:00.000+03:00", "crawled": "2018-07-23T20:32:55.000+03:00", "highlightTitle": ""}