{"organizations": [], "uuid": "f058335d2ec421c7c69cb1a5604903b717936a98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14940326.ece/ALTERNATES/s1200/0_KRR_NEC_230718police_01jpeg.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-newcastle-live-tory-cabinet-14938813", "country": "GB", "domain_rank": 21960, "title": "Theresa May in Newcastle LIVE: Tory cabinet visit Tyneside for Great Exhibition away day", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-23T09:00:00.000+03:00", "replies_count": 0, "uuid": "f058335d2ec421c7c69cb1a5604903b717936a98"}, "author": "Kathryn Riddell", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-newcastle-live-tory-cabinet-14938813", "ord_in_thread": 0, "title": "Theresa May in Newcastle LIVE: Tory cabinet visit Tyneside for Great Exhibition away day", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "kathryn riddell", "sentiment": "negative"}, {"name": "greg clark", "sentiment": "none"}], "locations": [{"name": "newcastle", "sentiment": "none"}, {"name": "tyneside", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "north", "sentiment": "none"}], "organizations": [{"name": "newcastlegateshead convention bureau", "sentiment": "none"}, {"name": "cabinet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Latest scene on Gateshead Quayside\nLots of security and press round the Sage - not much sign of anything else yet. Press and police outside the Sage Gateshead 11:06 KEY EVENT First ministers arrive at Sage\nOur reporter outside the Sage has captured the arrival of the first Ministers ahead of their Tyneside Cabinet meeting.\nIt is not known yet when the Prime Minister is set to get here. 10:44 Waiting for arrival\nWe’re still waiting for news of the Prime Minister’s arrival.\nThe police are in prime position near the Sage Gateshead where she is expected to head to first. Armed Police near The Sage in Gateshead (Image: Newcastle Chronicle) 10:21 'Investment needed in education'\nNorthern Powerhouse Partnership Director Henri Murison added:\nThe investment in transport, including the East Coast Mainline, is important, although it follows the North East being made to wait by Network Rail for improvements to secure the full benefits of the new Azuma trains on the route. In terms of innovation, the AMRC in Sheffield forms part of the High Value Manufacturing Catapult, and is playing an increasingly more important role to allow the North to lead the next Industrial Revolution.\nMy only surprise is that the Government has not yet announced more investment in tackling the gap in how children and young people from the least well-off homes perform here in the Northern Powerhouse. I think this is a missed opportunity, particularly given that the North East has many excellent primary schools, but displays a big drop in performance at secondary school level. As education should be funded with the same commitment as the NHS, the Education Secretary should be given the support from the Chancellor to make the significant investment needed. 10:14 Kathryn Riddell 'How much progress Government is making?'\nThe Partnership Director of the Northern Powerhouse has welcomed the Prime Minister’s commitment but has questioned how much progress has been made.\nHenri Murison said:\nThe renewed commitment of the Prime Minister to the Northern Powerhouse is to be welcomed; the question that remains is how much progress the Government is making and whether the scale of investment yet represents what will be required to truly the drive North’s ambitions.\nThe North of Tyne devolution deal is a vital step forward to unlock the potential of a major economic force in key capabilities like digital, health including ageing and energy, particularly in offshore renewables. It is so vital that a local industrial strategy is built on the deal because a focus on jobs and skills, stretching from Newcastle to the border with Scotland, needs to both influence why some children fall behind at secondary school as well as supporting business growth. I have no doubt that this deal will prove the case for why the Government should make further progress on devolution in the Northern Powerhouse, whether in Cheshire and Warrington or in Yorkshire where we need to see the Sheffield City Region up and running and a long-term settlement negotiated with the wider Yorkshire and the Humber area. 09:51 Armed police on the scene\nArmed police have been spotted near the Sage Gateshead ahead of the Cabinet visit.\nPolice officers have also been stationed on the Tyne Bridge as part of the security measures. (Image: Staff) Kathryn Riddell Police presence before Theresa May arrives\nTraffic is building on the way to Newcastle and a police presence has been seen on the Tyne Bridge as we await the Prime Minister’s arrival. 09:01 Kathryn Riddell Devolution deal to get under way\nA historic devolution deal that will unlock a £600 million investment fund for the North East will get under way today.\nPrime Minister Theresa May will announce on a visit to the region that the Government will lay legislation in Parliament to formally conclude the devolution deal and transfer unprecedented new powers from central Government to local people in the North of Tyne.\nThe deal is worth more than £600m over 30 years and is expected to generate £1.1 billion for the local economy, create 10,000 new jobs, and leverage £1.2bn in private sector investment. Leader of Newcastle City Council - Councillor Nick Forbes (Image: Newcastle Chronicle)\nThe three North of Tyne councils – Newcastle , North Tyneside , and Northumberland - expect to set up the new North of Tyne Combined Authority in October 2018. 08:38 'I'll give the North East investment, freedom and good Brexit deal'\nPrime Minister Theresa May is due in Newcastle on Monday with her Cabinet. British Prime Minister Theresa May (Image: REUTERS POOL)\nShe is coming to the North East for a special meeting alongside the Great Exhibition of the North.\nAnd the Prime Minister has written these words exclusively for Chronicle Live ahead of the visit.", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14938813;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-07-23T09:00:00.000+03:00", "crawled": "2018-07-23T11:57:03.105+03:00", "highlightTitle": ""}