{"organizations": [], "uuid": "e2a79188e4b98bff5588d44be7471d93a5cf510c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14825118.ece/ALTERNATES/s1200/0358_Manors_Technopole_View_02_02.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/rise-student-housing-many-blocks-14851009", "country": "GB", "domain_rank": 21960, "title": "The rise of student housing: Why so many blocks of flats are being built in Newcastle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-01T13:24:00.000+03:00", "replies_count": 0, "uuid": "e2a79188e4b98bff5588d44be7471d93a5cf510c"}, "author": "Daniel Holland", "url": "https://www.chroniclelive.co.uk/news/north-east-news/rise-student-housing-many-blocks-14851009", "ord_in_thread": 0, "title": "The rise of student housing: Why so many blocks of flats are being built in Newcastle", "locations": [], "entities": {"persons": [{"name": "jesmond", "sentiment": "none"}], "locations": [{"name": "northumbria", "sentiment": "none"}, {"name": "kings manor busin", "sentiment": "none"}], "organizations": [{"name": "newcastle click", "sentiment": "negative"}, {"name": "newcastle city council", "sentiment": "none"}, {"name": "invalid email newcastle", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily Thank you for subscribing!\nNewcastle’s student housing boom has changed the face of the city significantly in recent years - and it shows no sign of slowing down.\nThe city’s university population has grown rapidly in the past two decades - with the most recent figures putting the number of Newcastle and Northumbria students at 42,565 and rising, compared to just 25,271 in 2001.\nAnd while that massive expansion first saw a build-up of the traditional student neighbourhoods like Jesmond , purpose-built tower blocks are now popping up across the city to soak up the demand for accommodation.\nAn average of 550 bed spaces were built per year up until 2014, but that figure skyrocketed to 2,316 in 2016, with thousands more holding planning permission or under construction.\nJust last week, Newcastle City Council rubber-stamped plans for a £40m student housing project at the empty Technopole office block at Kings Manor Business Park, adding 535 beds to similar developments at nearby Clough House and Manor View House. The newly-approved Technopole development in Newcastle (Image: Adderstone Group)\nThe Newgate Court student development, on the site of the former Newgate Shopping Centre, will open in September, while other major accommodation blocks have been approved recently at locations such as the old Tyne Tees Television TV site, Sandyford House in Jesmond, and St James’ Boulevard.\nSo, why has there been such a dramatic shift towards purpose-built student tower blocks?\nFor one thing, they are extremely lucrative propositions for developers.\nStudent accommodation is exempt from business rates - unlike, for example, hotels - and there is a steady stream of thousands of potential new tenants flocking to the city every year.\nThe developments are also exempt for national regulations on room space standards, meaning developers can maximise the number of beds they can fit in.\nIndeed, planning committee members in both Newcastle and Gateshead have raised concerns about small room sizes in new non-student apartment developments in recent weeks - but pointed out that they would think differently if the flats were being marketed as university accommodation. Albert Place, which has been sold by Crosslane Developments (Image: Crosslane Developments)\nHowever, they also hold a number of benefits for students.\nThe idea of living in modern, secure, managed buildings in and around the attractions of the city centre is clearly an increasingly appealing proposition.\nThat is why developers are so keen to redevelop city centre buildings like Cuthbert House, off the Swan House roundabout, and overhaul older student buildings that have fallen out of fashion.\nThe outdated Liberty Court, in Elswick, is being completely reconfigured to bring it back into use, after its cluster flat layout fell victim to the rise of modern tower blocks.\nCouncil estimates have put the city’s available Purpose-Built Student Accommodation (PBSA) bed spaces post-2017 at 24,028, enough for 56% of the city’s student population.\nSuch blocks are often derided - whether by neighbours lamenting the noise nuisance almost inevitably brought on by having hundreds of students move in down the street, or those who fear they make it harder to develop a true ‘community’ feeling.\nHowever, council bosses say they work hard to ensure the right mix of accommodation for the city. Read More Newcastle student housing block is going to get a big revamp\nCoun Ged Bell, cabinet member for employment at Newcastle City Council, said: “Students make a valuable contribution to the city’s economy, vibrancy and character. As the student population in Newcastle has grown the demand for purpose built accommodation, near to the city’s two university campuses, has also increased.\n“We are seeking to ensure we have the right mix of accommodation in the right locations so that the young people who come to study in our city - many of whom stay and get jobs here after their studies - have decent and safe places to live.\n“While we recognise that students are a huge asset to our city, we also need to be mindful of the needs of all residents, and our aim therefore is to ensure that communities within the city are balanced.”\nIn January last year, the council approved a tougher new policy designed to put new PBSA under greater scrutiny, forcing developers to prove that they won’t lead to an over-concentration of such blocks “that would be harmful to that area’s vibrancy, environmental quality and residential amenity”.\nAnd while that hasn’t cooled developers’ interest in pressing ahead with new projects, it is hoped that it will protect the city should the student population start to fall in the future - something that cannot be ruled out amid uncertainty over the impact of Brexit and a decline post-2019 in the number of 18-year-olds nationally. Read More £40m plan to build hundreds of student flats in Newcastle city centre approved\nThe policy made it a requirement for developers to make properties easy to transform into homes for non-students, but in the meantime Newcastle continues to reap the economic rewards of having two attractive and growing universities.\nIt is estimated that the new Technopole development will add an extra £10m a year to the city’s economy, but planning consultant Lichfields said that the financial benefits of student housing are ‘often overlooked’.\nA Newcastle University spokesperson said: “Today Newcastle University educates almost 28,000 students across a wide range of disciplines of which 18,000 are studying for an undergraduate degree. International students comprise 27% of our total student population and represent more than 120 countries.\n“They bring significant diversity to our university community and boost the regional economy by £115m, supporting over 4,000 local FTE jobs.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-01T13:24:00.000+03:00", "crawled": "2018-07-01T13:43:48.002+03:00", "highlightTitle": ""}