{"organizations": [], "uuid": "6ebaf92f35b15ff36e3a68ecde8e139b9d135e20", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14888188.ece/ALTERNATES/s1200/Paper-Review.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-resignations-cabinet-reshuffle-how-14888024", "country": "GB", "domain_rank": 21960, "title": "Brexit resignations and cabinet reshuffle: How the papers covered Boris Johnson and David Davis quitting the Government", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-10T11:55:00.000+03:00", "replies_count": 0, "uuid": "6ebaf92f35b15ff36e3a68ecde8e139b9d135e20"}, "author": "Tom Eden", "url": "https://www.chroniclelive.co.uk/news/north-east-news/brexit-resignations-cabinet-reshuffle-how-14888024", "ord_in_thread": 0, "title": "Brexit resignations and cabinet reshuffle: How the papers covered Boris Johnson and David Davis quitting the Government", "locations": [], "entities": {"persons": [{"name": "boris johnson", "sentiment": "negative"}, {"name": "david davis", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "neutral"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "jeremy hunt", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mrs may", "sentiment": "none"}, {"name": "davis", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "none"}, {"name": "daily mirror", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nAs Theresa May’s Government was plunged into a fresh crisis by Boris Johnson’s resignation as Foreign Secretary over Brexit, the papers have given their view on the “day of chaos”:\nThe Daily Mirror said it would be a “big surprise” if Mrs May is not challenged over her leadership in the coming months. “Britain’s 27 European neighbours, the partners we must negotiate that departure deal with, are looking and laughing at the c haos.\n“Labour leader Jeremy Corbyn scents an opportunity for a general election, imagining himself walking into Downing Street at the head of a Labour government.\n“Britain deserves better than a Tory riot.” Read More Brexit fallout LIVE: Theresa May clings to power after Boris Johnson and David Davis resign; Jeremy Hunt new Foreign Secretary\nThe Guardian says Mr Johnson is “the most overrated politician in Britain” and Mr Davis was an “underwhelming” Brexit Secretary.\n“The Tory party has a historic reputation for being serious about power. But the modern Tory party can also be an extraordinarily febrile hothouse,” the paper says.\n“It now faces a battle that was always going to have to be fought eventually, between the fanatics of the right and the pragmatists of the centre-right.\n“Mrs May has been tenacious and sometimes skillful (though sometimes not) in postponing the battle. But the moment has arrived - and it must be resolved.”\nThe Times says Mr Johnson’s departure is neither “unexpected nor unwelcome”, however it “risks the loss of material benefits for the nation, if events turn one way, or the loss of his prized Brexit if they turn the other”.\n“What would be disastrous is if the resignations emboldened Mrs May’s critics to propose a motion of no confidence in her leadership,” the paper said.\n“Her meeting with backbenchers yesterday should have left them in no doubt that such a motion could trigger a general election and open the door to Labour.\n“The Conservative Party is on the brink. It needs to be careful not to take another step forward.”\nThe Daily Telegraph says Mrs May should rethink her Brexit strategy, calling the Chequers deal “a bad set of proposals that will encourage the EU to demand yet more concessions.\n“Even if the plan survives contact with the EU’s negotiators, it could well be defeated in the Commons - and although MPs voted to leave the EU when they triggered Article 50, they could reverse that decision if the alternative meant crashing out with no deal.\n“Mrs May now faces a crisis that could trigger a vote of confidence in her leadership if one is requested by at least 48 Tory MPs. On the other hand, if she were ousted it would take up to three months to organise a membership ballot,” the paper says.\n“The country would enter the final stages of the talks with a lame duck Prime Minister waiting for a successor to be installed. Mrs May has calculated that her party will not take that risk and intends to plough ahead.”\nThe Financial Times says that the UK faces a “vital moment in its modern history” and warned against the Conservatives’ “psychodrama over Europe” resulting in a push for a hard Brexit.\n“The Brexiteers contemplating such a course should consider some basic facts: there is no majority in the country, or in parliament, for a hard Brexit,” the paper says.\n“Moreover, they have failed to put forward a coherent alternative that could deliver an orderly departure without risking the worst option: a no-deal Brexit.\n“That would risk an economic shock and administrative chaos.”\nThe Daily Mail said it “understands - and shares - the Brexiteers’ frustration”, however the paper says Mr Johnson’s resignation risks destabilising the Government at a crucial time and Mrs May should be allowed to continue.\n“The best way forward must be to back Mrs May to get us out of the EU, then amend some of the more unpalatable detail at a later date,” the paper said.\n“But in return, she must pledge not to give one more inch to the strutting martinets in Brussels, who yesterday could barely contain their glee.”\nA worried Daily Express fears the ‘Brexit dream is dying’ as it leads with a photo of Boris Johnson posing with his resignation letter.\nReferring to Mr Johnson’s parting warning over Brexit, said it is up to Mrs May to “ensure that the dream does not die” and present her proposal to the EU without capitulation.\n“We are, though, moving towards some sort of endgame which in a chess match is when there are few pieces left on the board,” the paper says.\n“In Brexit it is the moment when the options are running out. Brussels is to blame for treating the UK with ridicule at every turn. The Government is to blame for failing to come up with a workable consensus.\n“There is no appetite for another general election nor for a second referendum. Mrs May must present her package to the EU and if they show no spirit of compromise or goodwill, then Britain must walk away. Simple.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-10T11:55:00.000+03:00", "crawled": "2018-07-10T12:25:12.003+03:00", "highlightTitle": ""}