{"organizations": [], "uuid": "f843bf8691c1d67a9f5914f7bf7f7b0f91b97de7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article361746.ece/ALTERNATES/s1200/Anne-Marie-Morris-MPppPNG.png", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/news-opinion/chequers-proposal-falls-short-clean-1820504", "country": "US", "title": "Chequers proposal falls short of a clean, free-trading Brexit in which UK takes back control", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-24T16:40:00.000+03:00", "replies_count": 0, "uuid": "f843bf8691c1d67a9f5914f7bf7f7b0f91b97de7"}, "author": "Anne Marie Morris", "url": "https://www.devonlive.com/news/news-opinion/chequers-proposal-falls-short-clean-1820504", "ord_in_thread": 0, "title": "Chequers proposal falls short of a clean, free-trading Brexit in which UK takes back control", "locations": [], "entities": {"persons": [{"name": "newton abbot", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "european court of justice", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Could not subscribe, try again later Invalid Email Anne Marie Morris is the Conservative MP for Newton Abbot and has been since 2010\nThe Chequers Agreement does not deliver on the clear Conservative manifesto pledges to leave the single market, the customs union, and the jurisdiction of the European Court of Justice.\nThe proposal falls short of a clean, free-trading Brexit in which the UK takes back regulatory control over our laws, borders, and trade policy.\nThe agreement leaves the UK half-in the EU and doesn’t deliver Brexit. It proposes that the UK “maintain a common rulebook for all goods” with the EU, including agricultural products, after Brexit. This restricts us from deviating from EU rules and regulations which prevents us from negotiating new trade deals with the rest of the world. Read More\nWhile all trade deals require some kind of agreement on standards, be that harmonisation or equivalence via mutual recognition, in this case a ‘common rulebook’ is not a common rulebook. Anne Marie Morris MP\nIt would be total compliance with the EU’s rulebook without UK influence. The UK will have to accept all old and new laws that comprise the rulebook with no say in their formulation. Parliament would in theory have the ability to enact divergent laws, but there would be consequences, with the EU allowed to impose trade penalties. Tying the UK to EU regulation in this way does not deliver on the promises of regaining sovereignty made to the British public.\nFurthermore, if EU regulations have to apply to any goods coming into the UK this restricts our ability to strike future independent trade agreements with other countries. We would not be able to accept any goods from trading partners if they diverged at all from EU laws. Read More Without more affordable homes, rural communities risk losing young families and workers\nAnother opportunity from Brexit we must be able to grasp is that 90 per cent of economic growth over the next decade will be outside the EU and it is this economic growth we need to pursue in our trade deals and export strategy. The United States, Australia, Canada, New Zealand, and India are among many whose governments have expressed interest in negotiating trade agreements with the UK.\nIn response to feedback from colleagues on the Chequers Agreement, the Government chose to back four amendments to the Taxation (Cross Border) Trade Bill, often referred to as the ‘Customs Bill’, as it came through the House of Commons last week. The Customs Bill includes provisions for the UK to impose tariffs, quotas, anti-dumping measures, enter Customs Unions and agree cross-border VAT regimes. Anne Marie Morris MP\nThe first amendment amended the Bill so that the Government may not enter a customs union with the EU without it being approved by a separate Act of Parliament. This recognises the role of Parliament in scrutinising such a decision. Read More Brexit won’t happen, and here is why\nThe second amendment backed by Government requires the UK to have a separate VAT regime from the EU and the third amendment stops the UK from collecting tariffs for the EU unless the rest of the EU reciprocates. This measure protects the UK Treasury and taxpayers.\nThe final amendment puts into law the Prime Minister’s commitment that there could not be a customs border between Northern Ireland and the rest of the UK down the Irish Sea. This preserves the integrity of the UK’s internal market.\nCrucially, the Chequers Agreement is not the final Brexit deal. We have already made good progress – on the text of the Withdrawal Agreement, by passing the EU Withdrawal Act, by publishing a White Paper – and the Customs Bill and Trade Bill passed their Third Readings this week. But we are a way off from the end and nothing is agreed until everything is agreed. Ann Marie-Morris\nI want a deal that allows us to deliver the benefits of Brexit – taking control of our borders, laws and money and by signing ambitious new trade deals with countries across the world. Read More\nThis is about agreeing an approach that delivers on the verdict of the British people – one that is in the best interests of the UK, and crucially, one that commands the support of the public. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-24T16:40:00.000+03:00", "crawled": "2018-07-24T17:06:25.025+03:00", "highlightTitle": ""}