{"organizations": [], "uuid": "d99f7e1b07ecbdf7615d93b76cafa683fe9d4fc5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14760040.ece/ALTERNATES/s1200/Breaking-News-Graphic-Live-Blog-Smaller.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-14967242", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-30T08:34:00.000+03:00", "replies_count": 0, "uuid": "d99f7e1b07ecbdf7615d93b76cafa683fe9d4fc5"}, "author": "Tom Eden", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-14967242", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "steve barron", "sentiment": "none"}, {"name": "tom eden", "sentiment": "none"}], "locations": [{"name": "newton aycliffe", "sentiment": "none"}, {"name": "york", "sentiment": "none"}, {"name": "doncaster", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "northallerton", "sentiment": "none"}, {"name": "northampton", "sentiment": "none"}], "organizations": [{"name": "northumbria police", "sentiment": "none"}, {"name": "newcastle central", "sentiment": "none"}, {"name": "northumbria police tom eden police", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "northallerton", "sentiment": "none"}, {"name": "newcastle board", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Council praise for 'patience, good humour and community spirit'\nSunderland City Council also hailed the event and praised the public.\nCllr John Kelly, Cabinet Member for Communities and Culture at Sunderland City Council, said:\n“We’d like to thank everyone who came along to help us celebrate the 30th Sunderland Airshow over the weekend and who helped make it an event to enjoy, whatever the weather threw at us.\n“A great deal of planning goes into large free outdoor events like this, and their continuing success is testament to the close partnership working with Northumbria Police and other partners within our city.\n“It was a great event and it’s the support of the people who came along to take part - their patience, good humour and community spirit - which made it so. Thank you all.” Sunderland Tom Eden Police praise Airshow attendees\nNorthumbria Police have thanked the public for their cooperation and patience after this year’s Sunderland Airshow passed peacefully.\nHundreds of thousands of spectators descended on Roker and Seaburn seafront for the 30th year of the Airshow, a staple of the North-east calendar, and it once a\\gain did not disappoint as visitors were treated to some stunning aerial displays and entertainment.\nAmong the highlights were the Red Arrows who dazzled on Friday and Saturday, while the RAF Typhoon brought the curtain down on another memorable event on Sunday.\nPolice were on duty throughout the three-day spectacle, and despite unpredictable weather over the weekend, families flocked to Wearside to create a feel-good factor across the city.\nChief Superintendent Sarah Pitt, Northumbria Police’s silver commander for the Sunderland Airshow, was quick to praise the public after another successful weekend.\nShe said:\n“Whatever the weather, Sunderland Airshow continues to be a huge favourite across the region and we were once again proud to be part of this magnificent event.\n“As a Force, we were delighted to engage with the public, take pictures with families and chat to residents about issues in their communities.\n“I would like to praise the behaviour of spectators throughout the weekend. We experienced very few incidents of note, making just five arrests over the three days. It is testament to the people of the North East that, rain or shine, they created a fantastic atmosphere and behaved impeccably.\n“As ever with large-scale events like this, and especially given the volatile weather, there was the potential for disruption on our roads and difficulties getting people to and from the site. However, I was thrilled that the event passed without incident, and everyone left in good spirits.\n“The Airshow would not be possible without the hard work of my staff, event organisers, our partners and also the public. Thank you – and see you next year.” 13:05 Tom Eden Boris Johnson finally leaving grace and favour home\nBoris Johnson appears to have accepted that “leave means leave” as removal vehicles were spotted outside the grace and favour home he lived in as foreign secretary. (Image: PA)\nThree weeks after quitting the Cabinet in a row over Theresa May’s Brexit plans, his belongings were being removed from One Carlton Gardens in central London.\nOne lorry and a minivan were parked behind the black gates of the property on Monday.\nBoth were from the Restore Harrow Green firm, which states on its website its specialities include business removals and international relocations.\nA series of white boxes were loaded into the lorry - along with what appeared to be a case of Jacques Depagneux wine, a large painting and a luxury armchair.\nMr Johnson’s departure comes days after anti-Brexit campaigners staged a stunt by offering to help him move.\nLast week, a handful of protesters parked a van featuring the slogan Leave Means Leave Removals Ltd outside the residence.\nCampaigners from For our Future’s Sake and Our Future Our Choice dressed up in overalls and brought cardboard boxes to the gates of the property.\nMr Johnson plunged the Government into crisis after he announced he was quitting on July 9, with a scathing denunciation of the Prime Minister’s Chequers Brexit blueprint.\nBut despite quitting, Mr Johnson remained in the official home situated not far from Buckingham Palace and The Ritz hotel.\nA Foreign Office spokesman said: “Former ministers are expected to leave official residences as quickly as practicable at the end of their tenure, taking into account their personal circumstances and family requirements; we can confirm there is no additional cost to taxpayers involved.”\nHe was not the first foreign secretary to stay in the residence for a period after his tenure.\nWhen Robin Cook was ousted from the Foreign Office and demoted to Commons leader in 2001, he was allowed to hang on to a “granny flat” above the new occupant in Carlton Gardens for two years. (Image: PA) Tom Eden Stag do 'paid homeless man to get tattoo on forehead'\nA stag do believed to be from Tyneside has sparked outrage after reportedly paying a homeless man £90 to get the groom’s name and postcode tattooed on his forehead. (Image: Facebook)\nThe rough sleeper had “Jamie Blake, North Shields, N28 ” inked in Benidorm.\nOn Facebook, the stunt has been branded “barbaric” and shameful. The Daily Star reported the vulnerable man was in too much pain to finish the inking.\nThe man, believed to be from Poland and called Tomek, was said to be in agony from the needle.\nFirms on the Spanish holiday island are reportedly planning to pay for him to get it removed.\nThe tattoo parlour shared a snap on Facebook of him giving the ‘peace’ sign in the chair.\nHowever, its followers were shocked staff had carried out the inking. 12:23 Tom Eden Tough new drone laws have come into force\nPeople who break new laws on flying drones could face up to five years in prison.\nThe ‘Drone Code’ , which came into force on Monday, July 30, includes a string of measures and has been written into law, meaning drones weighing more than 250g will now have to be registered with the Civil Aviation Authority. (Image: Newcastle Chronicle)\nAnd a new drone safety awareness test means owners will have to prove that they understand UK safety, security and privacy regulations, the Daily Post reports .\nIt’s part of the plan to launch a nationwide database for anyone who wants to fly the unmanned aircraft in the UK.\nSome drones, usually cheaper models, weigh less than 250g. But most - especially those with built-in cameras - weigh more.\nThis will affect a large number of popular consumer drones, including the DJI Mavic Pro (734 grams), Parrot Bebop 2 (500 grams), and even the lightweight DJI Spark (300 grams).\nPreviously, the regulations had only applied to aircraft that weigh 20kg or less.\nHowever drone operators have until November 30, 2019 to sign up to the CAA register.\nOwners of drones over 250g, who do not register with the CAA or complete the safety test, could be fined up to £1,000.\nAdditional flight restriction measures, already set out in the existing Drone Code, will now be enforced by law. NUFC Tom Eden Lejeune ruled out for large chunk of Newcastle's season\nFlorian Lejeune has revealed he expects to miss a large chunk of the season after being rocked by a knee injury. (Image: Newcastle United)\nThe Frenchman’s setback means United are now looking for another centre-half with Rafa Benitez describing Lejeune’s situation as “bad news” during the trip to Portugal.\nLejeune has now reacted to the injury via his social media accounts, and said:\n“During my last training session, I left the field due to an injury.\n“After further medical examination, the doctor told me I have a cruciate ligament injury.\n“I’ll have surgery in the next few days. I’ll do everything I can to get back as quickly as possible on St James’ Park.\n“After further medical examination, the doctor told me I have an anterior cruciate ligament injury.\n“I’ll have surgery in the next few days.\n“This injury will certainly keep me away from the pitch during a good part of the season.\n“I’ll do everything I can to get back as quickly as possible on St. James’ Park pitch.\n“I’ll come back stronger to help my team-mates and Newcastle the best I can.” Gateshead", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14967242;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-07-30T08:34:00.000+03:00", "crawled": "2018-07-30T09:04:06.010+03:00", "highlightTitle": ""}