{"organizations": [], "uuid": "86b4d90f2703ddb7206313ab2140d1060ac2d0da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14516473.ece/ALTERNATES/s1200/JS105859543.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14943323", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Shopping centre giant Hammerson to sell off £1.1bn of assets", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-24T10:15:00.000+03:00", "replies_count": 0, "uuid": "86b4d90f2703ddb7206313ab2140d1060ac2d0da"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14943323", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Shopping centre giant Hammerson to sell off £1.1bn of assets", "locations": [], "entities": {"persons": [{"name": "david atkins", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "westmorland retail park", "sentiment": "none"}, {"name": "monument mall", "sentiment": "none"}, {"name": "cramlington", "sentiment": "none"}], "organizations": [{"name": "hammerson", "sentiment": "negative"}, {"name": "cleveland retail", "sentiment": "negative"}, {"name": "arch", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Owner of failed car 'pimping' firm launches new business in Newcastle\nA businessman whose company entered liquidation two months after striking a £250,000 investment deal with a council-backed fund has set up a new business and secured a premises in Newcastle.\nCar-wrapping company Muss Media Limited – which traded as Muss Stylings – went bust at the end of June, just a few months after signing a deal worth up to £250,000 from the Finance Durham Fund.\nThe collapse of Muss Styling led to the firm’s staff losing their jobs, and former employees have been left fighting to receive money they are owed.\nThe firm’s founder, Jamie Mussett, has already incorporated a new business and secured a premises in the heart of Newcastle.\nHis new company, which is incorporated under the name UK Auto Holdings Limited, will be a “luxury car wash” operating out of the former Triumph garage on Dinsdale Place, Shieldfield, Newcastle.\nRead what Mr Mussett had to say about setting up a new business here . Muss Styling carries out a range of automotive fashion work (Image: Unknown) 9.10 Coreena Ford MPs warn of 'merry-go-round' culture in bids for Government contracts\nA “merry-go-round” culture that encourages companies to bid for contracts at undeliverable prices has been created by the Government, a powerful committee has warned.\nIn the wake of the collapse of Carillion, MPs raised concerns about the emergence of a small group of large companies that are expert at winning public contracts despite not always delivering a good service in return.\nLittle consideration is given to whether businesses can meet the demands of a contract at the right price, according to the Public Accounts Committee (PAC). Around £250bn a year of public money is spent through commercial relationships but too many contracts are “secretive or opaque”.\n“Quite frankly the taxpayer deserves better,” the report states.\n“The Government has created a merry-go-round procurement culture that encouraged a small number of companies to bid for contracts that they knew they would be unable to deliver for the agreed price\n“The Government has allowed a culture to develop in which a small number of large companies that believe that they are too big to fail pursued new business with little apparent consideration of their ability to deliver the right service at the right price.”\nCarillion, the UK’s second largest construction company, collapsed under a debt pile of £1.5 billion on January 15.\nIt had employed 43,000 people, including about 20,000 in the UK.\nThe PAC said Carillion’s collapse had “brought to a head” concerns about the Government’s approach to procurement, which covers contracts on everything from medical assessments for benefits claimants to building nuclear weapons. Defaced branding is seen outside Carillion's Royal Liverpool Hospital site (Image: Getty Images Europe) 9.05 Coreena Ford Corbyn: Labour would bring manufacturing home in post-Brexit jobs boost\nManufacturing jobs would be brought back to the UK from abroad and the public sector outsourcing “racket” scrapped by a Labour government to stimulate a post-Brexit industrial renaissance, Jeremy Corbyn will say today.\nFocusing on the City and financial services for four decades at the expense of building things is “sucking the dynamism out of our economy”, and robbing workers of good wages and job security, the opposition leader will tell an audience in Birmingham.\nAddressing the manufacturers organisation EEF he will say there is a need to “reprogramme” with greater emphasis on manufacturing.\nHe will also call on Theresa May to change track and negotiate with the EU to ensure that Britain remains in “a brand new customs union” after Brexit in March.\nHe will argue that otherwise Britain will become “a nightmare of chlorinated chicken” that is “in hock to Donald Trump”.\nMr Corbyn will say:\nFor the last 40 years, a magical kind of thinking has dominated the way Britain is run.\nWe’ve been told that it’s good - advanced even - for our country to manufacture less and less and instead rely on cheap labour from abroad to produce imports, while we focus on the City of London and the finance sector.\nA lack of support for manufacturing is sucking the dynamism out of our economy, pay from the pockets of our workers and any hope of secure, well-paid jobs from a generation of our young people.\nIt must be our job in government to reprogramme our economy so that it stops working for the few and begins working for the many. That is why we will build things here again that for too long have been built abroad because we have failed to invest. Labour Party leader Jeremy Corbyn (Image: PA) 8.58 Coreena Ford North Sea workers stop production in strike\nWorkers on three North Sea platforms have gone on strike in a row over offshore rotas and wages.\nUnion Unite said its members started the 24-hour strike on Monday at 6am on Total E&P’s Alwyn, Dunbar and Elgin platforms.\nUnite regional officer John Boland said:\nWe can confirm that the strike action on Alwyn, Dunbar and Elgin platforms has gone ahead as planned. “Production has been stopped and the wells have been shut.\nAlthough no further talks are planned at present we would urge the company to come back to us with an improved offer to get our members back to work and the wells up and running again.\nThe industrial action is the first of five planned stoppages and coincides with a continuous overtime ban.\nFurther 24-hour strikes are planned for August 6 and 20 with twelve-hour walkouts on July 30 and August 13.\nThe union said the dispute centres on a wage review and plans to move workers to a three weeks on three weeks off rota, involving an extra week offshore. Total E&P said it wants to introduce a uniform rota system which will bring staff in line with workers on their recently acquired Maersk Oil installations.\nA Total E&P spokeswoman said the strikes have gone ahead despite it making new proposals. 8.51 Coreena Ford Superdry co-founder Julian Dunkerton sells off shares for £71m\nSuperdry co-founder Julian Dunkerton has sold a 6.7% stake in the fashion firm for around £71 million. The share sale sees his stake in the group reduced to 18.5%.\nMr Dunkerton sold 5.5 million shares at £12.85 each. He has agreed not to sell any further shares for at least 90 days.\nEarlier this year the co-founder of fashion retailer Superdry announced he was stepping down and donating more than £1m in shares, saying he planned to devote more time to other business and charitable interests.\nJulian Dunkerton left the role on March 31, with creative teams stepping in to take over his product and brand work. Julian Dunkerton, the co-founder of Superdry. 8.40 Coreena Ford Frank Recruitment launches new brand to find talent for Amazon cloud platform\nSpecialist tech recruiters Frank Recruitment Group has launched its ninth brand , which specialises in finding talent across the Amazon Web Services (AWS) industry.\nThe Newcastle-headquartered group – which has offices in the US, Australia, Germany and Singapore – focuses on recruiting tech talent capable of working in a variety of niche digital roles.\nThe new brand will be known as Jefferson Frank and has been launched following the increased demand for AWS talent across the world.\nAWS is a cloud computing platform provided by Amazon. IT research company Gartner has found that AWS is experiencing 20% year-on-year growth.\nJames Lloyd-Townshend CEO, James Lloyd-Townshend, said: “AWS is an emerging technology with incredible business potential.\n“Amazon Cloud has recorded more than one million active users per month, and with no less than 90% of businesses migrating to the cloud, it comes as no surprise that we’ve seen such a boom in demand for skilled cloud professionals across the AWS ecosystem. To meet this demand, we’ve launched Jefferson Frank, whose remit is to focus solely on AWS recruitment.” Frank Recruitment Group's new office at St Nicholas Building in Newcastle (Image: Frank Recruitment Group) 8.35 KEY EVENT Hammerson CEO unveils strategy for 'winning destinations'\nSelling off the Cleveland Retail Park would mean Hammerson is also exiting the North East, having already sold off its three other regional interests.\nIt sold off Monument Mall in Newcastle for £75m in 2015 and the following year secured two deals with Arch to sell off Manor Walks Shopping Centre in Cramlington for £78m and nearby Westmorland Retail Park for £36m.\nChief executive David Atkins said\nThrough increasing the level of disposals, including exiting the retail parks sector, we will now focus solely on winning destinations of the highest quality: Flagship retail destinations and premium outlets.\nThese are the venues we believe will maintain relevance and outperform against the shifting retail backdrop. Our customer and retailer offer will be amplified, and this includes a step change in our retailer line up.\nWe will reduce the amount of floor space let to department stores and high street fashion as we actively focus on the latest consumer trends and take bolder steps to provide the best retail mix.\nOur results today demonstrate the resilience of our business. We are taking tough decisions and have absolute conviction in our ability to deliver.\nBy reprioritising our capital deployment and repositioning our portfolio, we will accelerate future shareholder value and returns. David Atkins, chief executive of Hammerson 8.25 KEY EVENT Billionaire brothers to create Newcastle's newest landmark high-rise building\nA landmark office and leisure scheme which would create an impressive gateway into Newcastle city centre - as well as hundreds of new jobs - is being driven forward by two of the most prominent real estate owners in the world.\nTaras Properties, which is owned by billionare brothers David and Simon Reuben – currently ranked the 60th wealthiest people in the world in the 2016 Forbes List – is planning to bring forward a scheme to transform the prominent former Bank of England site at the junction of Pilgrim Street and Swan House roundabout.\nThe development would mark the first of a far-reaching three-phase scheme to regenerate the East Pilgrim Street area, eventually creating a raft of retail, leisure and office schemes to completely reconfigure the entrance to the city.\nTaras Properties, which owns the entire site, is presenting proposals to Newcastle City Council’s planning department to construct a landmark 14-storey, 120,000 sqft office building with complimentary ground floor leisure uses.\nAs well as creating hundreds of jobs through the construction phase, the office would have space for more than 1,200 workers, making it one of the largest speculative developments in for the city over the last few years.\nThe site was home to the massive Bank of England building, which was constructed in the late 1960s but lay empty for several years before being demolished six years ago. An area of land at the end of Pilgrim Street near to the Swan House roundabout in central Newcastle which is to be redeveloped (Image: Newcastle Chronicle) 8.22 Coreena Ford Carbon Dioxide shortage takes the fizz out of Britvic sales\nRobinsons squash firm Britvic has said Britain’s recent carbon dioxide crisis hit its fizzy drink sales and left it unable to make the most of surging demand amid the summer heatwave.\nThe company said UK sales of fizzy drinks, excluding the new soft drinks sugar tax, fell 2.9% in the three months to July 8 due to the CO2 woes.\nIt was forced to switch promotions to its still drinks ranges, which saw sales jump 11.7% stripping out the sugar tax impact.\nThis helped UK sales overall rise 8%, or 1.9% higher excluding the sugar tax, while underlying group sales fell 0.6% in the quarter.\nIncluding the sugar tax, group revenues rose 3.4%.\nThe group - which also bottles Pepsi in the UK and Ireland - said CO2 supplies are now back to normal and it has started rebuilding its stock levels and launching further fizzy drink promotions.\nSimon Litherland, chief executive of Britvic, said: “Whilst the industry-wide shortage of carbon dioxide held back our ability to fully capitalise on the exceptional weather in Great Britain and Ireland, we leveraged the breadth and strength of our portfolio to moderate the impact.\n“Consequently, we remain confident of achieving market expectations for the full year.”\nBritain’s fizzy drink shortage was caused by a raft of closures of factories producing the gas as a by-product of the fertiliser industry.\nFactories normally close temporarily for maintenance in the summer, but this year too many plants across Europe shut at the same time, leaving CO2 supplies woefully short. A woman with glass of water (Image: Getty Images/iStockphoto) 8.10 KEY EVENT Shopping giant Hammerson to sell off £1.1bn of property assets\nBullring owner Hammerson has this morning issued a strong suggestion it is poised to dispose of its remaining North East shopping outlet as part of a £1.1bn asset sale.\nFollowing its failed attempt to merge with rival Intu, owner of Eldon Square in Newcastle and Metrocentre in Gateshead, Hammerson is looking to win over angry shareholders with a new wide ranging strategy, which includes setting a disposal target of £1.1 billion by the end of 2019.\nIt has already reached £300m in disposals this year and has now increased its overall target for 2018 to £600m.\nIn the medium term, it said, it is exiting the retail park sector.\nThis means the Cleveland Retail Park in Middlesbrough will be sold off among 15 other retail parks.\nIt will also aim to diversify the geography of its property holdings, with non-UK retail exposure set to increase by around 10%. Hammerson is now aiming to cut costs by around £7m per year.\nHammerson will launch a share buyback programme worth £300m as part of efforts to return proceeds from its asset disposals to investors over the next 12 months.\nThe company has also announced that it is reducing the number of executive directors from four to two.\nChief investment officer Peter Cole and executive director Jean-Philippe Mouton will both step down from the board at the end of the year.\nHammerson made the announcement alongside its half year results which showed pre-tax profit plunging 80% to £55.8m over the six months to June 30. Revenue for the period was down from £160.1m to £152.5m.\nThe firm also revealed it had taken a £3.1m hit as a result of CVAs and administrations at its retail parks, with Toys R Us and Maplin having the biggest impact. The Bullring shopping centre in Birmingham, owned by Hammerson. More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14943323;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-07-24T10:15:00.000+03:00", "crawled": "2018-07-24T10:44:31.057+03:00", "highlightTitle": ""}