{"organizations": [], "uuid": "58a610cb5f7b50ab3ac0aca79994e2beb84cc79f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14852995.ece/ALTERNATES/s1200/JS156326181.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14852968", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: 50,000 high street retail jobs axed in first six months of the year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-02T10:15:00.000+03:00", "replies_count": 0, "uuid": "58a610cb5f7b50ab3ac0aca79994e2beb84cc79f"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14852968", "ord_in_thread": 0, "title": "Business Breakfast LIVE: 50,000 high street retail jobs axed in first six months of the year", "locations": [], "entities": {"persons": [{"name": "anne cairns", "sentiment": "none"}], "locations": [], "organizations": [{"name": "coreena ford mastercard", "sentiment": "negative"}, {"name": "mastercard", "sentiment": "negative"}, {"name": "press association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Amazon set to launch £120m fulfilment centre in North East, creating thousands of jobs\nGlobal retailer Amazon has moved a step closer to opening a giant logistics centre in the North East following a £120m funding deal .\nThe online retailer is understood to be the billionaire business heading to Darlington , following the announcement that a deal has been agreed for a 1.5m sq ft logistics fulfilment centre next to the A66 in Darlington which is pre-let to a ‘world-leading retailer’.\nNational logistics developer db symmetry has secured the letting at Symmetry Park, Darlington, which is being funded by Tritax Big Box REIT.\nThe global online retail giant has taken the facility on a 20-year lease. The fulfilment centre will occupy 40 acres of the wider 90-acre site, leaving 37-acres available for further development.\nIt is understood the fulfilment centre, where thousands of parcels will be packed and shipped every day, could create as many as 3,000 jobs. Amazon's Fulfilment Centre at Kingston Park in Peterborough (Image: Aaron Chown/PA Wire) 9.10 Coreena Ford Newcastle's newest micropub opens - with artistic inspiration\nTwo craft beer enthusiasts have joined forces to open Newcastle’s newest micropub in a converted railway arch.\nPete Allan and Karl Parkin and their partners have joined forces to create Beer Street, a new mini pub inspired by the famous Hogarth painting duo Beer Street and Gin Lane.\nThe pair have more than 30 years’ experience in the trade and, just like the healthy, happy drinkers in Hogarth’s 18th Century picture – with beer depicted as a health alternative to gin – they are looking forward to similarly nourishing visitors with a host of local ales and beers.\nFinal touches are being made to the 50-capacity unit in Forth Street, which is right next to fellow micropub Box Social and round the corner from another, Split Chimp.\nArtist Toby Heaps, better known as Sune, has used the curved walls of the arch to create stunning backdrops within the bar, inspired by the Hogarth prints.\nMr Allan said: “Jan and Karl have been running the Old Fox in Felling for a while now and it’s been successful and they’ve been looking for another opportunity.\n“We got talking and decided to do something together, so both of our families have invested in this.\n“We were looking at Stephenson Quarter as being in an up-and-coming area in terms of development work, plus with Box Social next door and the Split Chimp we’ll now have a bit of a hub – and adding more micropubs can only be a good thing because we are creating more space for drinkers and more opportunities.\n“And it’s a very friendly relationship we have with the others too. It’s not about competing or undercutting, but producing more opportunities for producers and consumers. When we open on Friday you’ll have a nice run of three places to go to, each one offering something different.” Karl Parkin, Jan Colman and Pete Allan in front of art work by Sune inside their new micropub, Beer Street (Image: Beer Street) 9.05 Coreena Ford Gender pension pay gap revealed\nYoung women putting money into a workplace pension may end up with less money than their male counterparts, according to new research.\nA study by investment firm Fidelity International found that a woman’s pension pot could be more than 10% smaller than men’s.\nThe main reason is the gender pay gap, and women taking time off to raise children or look after a sick or elderly relative.\nWomen could close the gender pension gap by paying an extra 1% of their salary towards a pension early on in their career, said the report.\nMost women are apathetic about pensions, with almost two out of five not knowing how much their pension was worth, said Fidelity.\nMaike Currie, investment director at Fidelity International, said: “Financial inequality is one of the greatest challenges we face today. “We live longer, earn less and are more likely to take career breaks or work part-time.\n“To unlock the financial power of women, we need to address the personal, professional and policy barriers stopping women from investing.”\nA Department for Work and Pensions spokesman said: “Our pension reforms are setting millions of women on the path to a secure retirement and helping to address the historic gender divide in pensions income. “The introduction of automatic enrolment has seen the number of women in the private sector without a workplace pension halved.” Plastic models of a man and woman (Image: PA) 9.00 Coreena Ford Increase in estate agent insolvencies\nMore than 150 estate agents went insolvent last year as pressure from online rivals continues to increase, a new study finds.\nThe total was only five more than the previous year, but thousands of UK estate agents are currently showing signs of financial distress, said accountants Moore Stephens.\nBigger estate agents are feeling the strain just as much as smaller firms as they have higher staffing and property costs than companies trading online, said the report.\nChris Marsden of Moore Stephens, said: “Insolvencies of high street estate agent are increasing as online competitors continue to chip away at their sales and undermine commission rates.”\n“Some areas in the UK are appear to have an excess capacity of estate agents, which could mean there is not enough business to spread around as property transactions stagnate.\n“Estate agents with a traditional model may have to look at whether they can reduce overheads and review their service offering to effectively compete in the current market.” More than 150 estate agents went insolvent last year (Image: Newcastle Chronicle) 8.55 Coreena Ford Kromek hails 'milestone' year as firm records EBITDA positive for first time\nSedgefield’s Kromek has reported on a ‘milestone’ year, as revenue growth from its ramp-up in commercial activities led it to achieve EBITDA positive for the first time.\nThe detection technology firm, which focuses on the medical, security and nuclear markets, reported a 32% leap in revenues to £11.8m and EBITDA of £500,000 compared to last year’s loss of £1.5m.\nProduct sales accounted for 81% of total revenues, a growth year-on-year of 44%.\nThe firm said growth was due to continued delivery on previously-signed agreements as well as starting on new high-value contracts won during the year.\nKromek also secured new purpose-built premises for its US operations in Pittsburgh, which will enable it to become a world-leading manufacturer of SPECT cameras.\nSeven new patents were filed and 29 granted during the period.\nDr Arnab Basu, CEO of Kromek, said:\nI am very pleased to report that Kromek had another good year of delivering revenue growth and developing our customer base who continue to launch next generation products incorporating our advanced radiation detectors.\nWe also achieved one of our key targets for the year by becoming EBITDA positive for the first time in our history. This is an important milestone towards cash flow breakeven and pre-tax profits.\nLooking ahead, the momentum of the 2017/18 financial year has been sustained into the current financial year as Kromek’s products continue to gain traction in all of our target markets. Arnab Basu, chief executive of Kromek 8.48 Coreena Ford Former Newcastle hospital site put up sale, casting doubt over planned developments\nNewcastle health bosses have put a prominent former hospital site in Newcastle up for sale, casting doubt over planned developments .\nThe former Sanderson Hospital site in Gosforth was poised to be redeveloped into a new health centre in a partnership with developers Malhotra Group and the landowners, the Newcastle upon Tyne Hospitals NHS Foundation Trust.\nThe sizeable patch of land has lain empty for more than 15 years but the Newcastle-based Malhotra Group was working on a new future for the site with Newcastle’s Ryder Architecture designing a polyclinic containing diagnostic facilities, treatment rooms, GP surgeries and shops.\nThe scheme was the latest plan earmarked for the land, at Salters Road, which was formerly occupied by Sanderson Hospital, which was built in 1897 as a home for destitute children before being more latterly occupied as a care facility for the elderly.\nConstruction firm Wimpey received planning permission to build houses and flats on the sites in 2011, despite huge numbers of protests that led to its plans being revised a number of times.\nBut Wimpey pulled out of the scheme in 2013, saying a slump in the property market during a lengthy planning battle had made its development uneconomic.\nNow the freehold of the site is up for sale, with interested parties being asked to contact property firm Cushman & Wakefield for the guide price.\nA spokeswoman for Newcastle Upon Tyne NHS Foundation Trust said: “The Trust does not comment on commercial issues. However we can confirm that we own the Sanderson Hospital site, we have put the site up for sale and we’ll be looking for the best possible price.” Aerial view of former Sanderson Hospital site in Gosforth 8.38 Vertu makes key car dealership acquisition in £21.8m deal\nVertu now operates 125 outlets across the UK after snapping up a Mercedez-Benz specialist.\nThe Gateshead based motor retailer has acquired the entire issued share capital of Hughes Group Holdings Limited and its subsidiary Hughes of Beaconsfield Limited for an estimated cash consideration of £21.8m.\nThe deal is based upon estimated net assets of £12.0m and goodwill of £9.8m. £1.5m of this amount will be deferred for a period of 12 months.\nFollowing this acquisition, the Group’s network of sales and aftersales outlets across the UK has increased to 125 outlets.\nIn total, six sales outlets are added to the group by this acquisition which the board expects to be earnings enhancing in its first full year of ownership. The operational management of the successful Hughes business will stay with the company following the acquisition.\nHughes has represented Mercedes-Benz for over 40 years, operating outlets in Beaconsfield and Aylesbury, which is an adjacent market area to Vertu’s existing Mercedes-Benz operations in Reading, Ascot and Slough.\nThe acquisition also brings the Mercedes-Benz Commercial Van franchise to the Group for the first time through the operation in Aylesbury.\nHughes also operates outlets for Skoda in Aylesbury, Jeep in Beaconsfield and Peugeot in High Wycombe and operates a vehicle preparation centre in Wendover.\nRobert Forrester, CEO of Vertu Motors said:\nWe are delighted to announce the addition of two excellent Mercedes-Benz dealerships to the Group which represent a further step in the growth of our premium business, adjacent to our existing Mercedes-Benz operations in the Thames valley.\nThe Hughes business has operated in the Beaconsfield area for over 40 years, and is very well established in this attractive market area, serving an excellent demographic profile for the Mercedes-Benz brand. Robert Forrester, CEO of Vertu Motors 8.30 Coreena Ford Mastercard urges more cashless payments - despite Visa's IT fiasco\nMastercard is pushing for a bigger uptake of cashless payments, saying it makes financial sense for Governments to ditch cash in favour of card or digital payments.\nThe company has reassured consumers it has “massive contingency plans” for IT failures like those that blocked millions of transactions at rival Visa.\nAnne Cairns, the group’s vice chairman, told the Press Association that it made financial sense for Governments to drop cash in favour of cashless payments because cash can often have higher production, transport and insurance and security costs.\nShe said:\nCash costs a lot of money, it costs a country between half a percent and 1.5% of its GDP (gross domestic product) and so governments are waking up to the fact that they could really benefit their economy by getting rid of cash.\nThere is also a cost to consumers, who might have to pay more when buying a rail ticket in person, rather than online in advance, for example.\nWhen asked whether it was risky to push consumers into a digital-pay economy in light of a recent IT fiasco that blocked millions of Visa payments in early June, Ms Cairns said any system should have “multiple back-ups.”\nShe also assured that Mastercard itself was well-prepared for similar issues, saying “we have massive contingency plans” in place.\nVisa has since confirmed that its issue were caused by a “very rare partial failure” of a switch in one of its data centres, which meant its back-up centre could not automatically process all transactions. Mastercard is pushing for a bigger uptake of cashless payments (Image: PA) 8.25 Coreena Ford Monzo losses widen as banking ambitions ramp up costs\nMonzo saw losses balloon last year after its banking ambitions led to a 336% surge in operational costs.\nThe digital challenger logged pre-tax losses of £33.1m in the year to February 2018, having widened from just £7.9m a year earlier.\nMonzo said this was primarily the result of a major rise in operating costs from £8m to £34.9m, which reflected investments in becoming “a fully operational bank”.\nThe company began offering current accounts last September, and has since fully phased out its pre-paid cards.\nIt also introduced overdrafts, which has been taken up by around 37,000 customers, and lifted revenues. Interest income came in at £150,000, having been nil a year earlier, while fee and commission income rose to £2.2m from £112,000.\nChief executive Tom Blomfield said: “Moving to current accounts has given our customers access to all the power and protection that comes with a full banking licence. 8.20 KEY EVENT Multimillion pound visitor attraction to be built at Gateshead Old Town Hall\nMythical monsters and magical artefacts are set to take over Gateshead’s Old Town Hall Quarter in multimillion-pound regeneration plans .\nDinosauria Ltd has reached an agreement with Gateshead Council for the long-term lease of the former town hall, paving the way for the buildings to be transformed into The Unnatural History Museum, eventually creating almost 300 jobs.\nFollowing the agreement for the company to take on the lease of the 120-year-old buildings, there will be an initial eight-figure investment by Dinosauria Ltd to create the family-friendly museum with 90 jobs created.\nRooms which once played host to council meetings will thrive with a collection of interactive exhibits made up of mythical monsters, legendary beasts and magical artefacts from Greek and Roman mythology, modern and classical fantasy stories, and magical folklore.\nAttractions at The Unnatural History Museum will include wizards, unicorns, trolls, fairies, goblins and dragons, with a walk-through immersive experience for visitors to navigate, along corridors and through rooms filled with animatronic exhibits, virtual reality, audio-visual effects and live actors.\nA further two phases will follow to extend the attraction, with the provision for additional leisure and entertainment including a themed restaurant with microbrewery and bar. The developments for the wider site will create more than 200 jobs.\nThe company is being supported by Newcastle-based wealth management specialists, Tier One Capital, which is assisting in raising finance for the project. Gateshead's Old Town Hall is to be transformed into the Unnatural History Museum (Image: Dinosauria Ltd) 8.15 Coreena Ford Tesco links up with French retailer Carrefour in strategic alliance\nTesco is to form a “strategic alliance” with French retailer Carrefour as part of efforts to cut prices and get a leg up on competitors.\nThe long-term deal will be covered by a three-year framework and see the two companies form a “strategic relationship” when dealing with global suppliers. It will also entail the joint purchasing of their own-branded products.\nA statement explained the alliance will “enable both companies to improve the quality and choice of products available to their customers, at even lower prices thereby enhancing their competitiveness”.\nTesco and Carrefour claim the agreement would also create “significant opportunities” for their suppliers.\nA formal agreement is expected within the next two months.\nTesco chief executive Dave Lewis said: “By working together and making the most of our collective product expertise and sourcing capability, we will be able to serve our customers even better, further improving choice, quality and value.”\nThe move could give Tesco an extra edge against competitors, including discounters such as Aldi, Lidl and Asda.\nRecent figures from Kantar Worldpanel show that Tesco’s market share decreased to 27.7% over the 12 weeks to June 17, from 27.9% a year ago.\nThat was despite sales growing 1.4% over the period. A Tesco sign (Image: PA) 8.10 KEY EVENT Struggling retail sector sees 50,000 jobs lost in brutal first half\nAround 50,000 jobs have been axed in the first half of the year as retail workers bore the brunt of hundreds of store closures.\nNumbers crunched by the Press Association show that approximately 50,000 staff have been made redundant or seen their role put under threat, with the bulk of them working for well-known high street chains.\nIn the last few weeks alone, House of Fraser has put more than 6,000 jobs at risk with a radical store closure plan, while Poundworld has tumbled into administration, endangering a further 5,100.\nOn a local level we have also seen store closure announcements from Marks & Spencer, with two in the North East set to be the first to go next month.\nThe figures add to Toys R Us and Maplin, which collapsed earlier this year, while casual dining companies like Prezzo, Byron and Jamie’s Italian have also shut restaurants and culled hundreds of jobs.\nRetailers have been hammered by Brexit-fuelled inflation, soaring business rates and falling consumer confidence.\nThe TUC called on the Government to “up its game” to stem the tide.\nThe union organisation’s general secretary, Frances O’Grady, said: “Retail depends on customers having money in their pockets. One reason why some shops are struggling is because wage growth has been very weak.\n“Government needs to up its game, boost the economy and invest in great jobs that people can live on.”\nExperts said 2018 will go down in history as the “year of the Company Voluntary Arrangement” - an insolvency procedure used to push through several store closure programmes this year.\nSoaring business rates have been flagged as a major contributor to retail failures.\nFigures from Altus show that the average business rates bill for a department store in England and Wales this year for rocketed 26.6% to £717,952 following last year’s Government revaluation. Outside a Maplin store (Image: Birmingham Mail) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14852968;"], "published": "2018-07-02T10:15:00.000+03:00", "crawled": "2018-07-02T10:35:16.026+03:00", "highlightTitle": ""}