{"organizations": [], "uuid": "cb2d30453a09f75b0febaebc2f8a7e83a7eb01e8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14968536.ece/ALTERNATES/s1200/0_TMP_NEC_230718ePassportNokes04JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-airports-new-passport-gates-14968495", "country": "GB", "domain_rank": 21960, "title": "Newcastle Airport's new passport gates get thumbs up from immigration minister", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-30T18:00:00.000+03:00", "replies_count": 0, "uuid": "cb2d30453a09f75b0febaebc2f8a7e83a7eb01e8"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-airports-new-passport-gates-14968495", "ord_in_thread": 0, "title": "Newcastle Airport's new passport gates get thumbs up from immigration minister", "locations": [], "entities": {"persons": [{"name": "caroline nokes", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "newcastle airport", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle international airport", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Newcastle Airport's new passport gates get thumbs up from immigration minister Caroline Nokes visited the airport as part of Theresa May's cabinet visit to the North East and tested the new technology out for herself Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe immigration minister has given Newcastle International Airport’s new passport gates the seal of approval ahead of the summer rush.\nCaroline Nokes was shown the new technology on a visit shortly after Theresa May’s cabinet meeting in Gateshead.\nThe sophisticated new gates have been installed to improve security and get passengers arriving at Newcastle through passport control quicker.\nUsing facial recognition technology and a passport scanner, the gates can get up to 10 passengers through in a minute, up from the three a minute achieved by manual passport desks. (Image: newcastle chronicle)\nThere’s no doubt e-gates are here to stay: there are now 250 in use for people arriving in the UK, processing 47.9m people in 2017/18.\nThe gates are funded by the UK Border Agency - the cost is confidential - and they form the centrepiece of the airport’s new multi-million pound arrivals hall.\nAfter giving the new tech a whirl, the minister said: “Our first duty is to secure our borders and the new gates have the ability to flag up anybody on a watch-list. (Image: newcastle chronicle)\n“They are very secure and ease passenger flow, which is doubly important the week the school holidays are beginning.\n“I’ve been through them myself and realised that if you follow the very simply instructions, it’s a very easy process. Read More\n“I was told today that the group who have taken to using them the best is the over 70s which gives lie to the myth that the older generation aren’t good with new technology. Screens which greet passengers at the new ePassport gates at Newcastle Airport (Image: newcastle chronicle)\n“The facial recognition technology they use is absolutely cutting edge.”\nAs well as UK passport holders, the gates can be used by EU, EEA and Swiss citizens too.\nAsked if the new technology would be disrupted by a no-deal Brexit, the minister said: “The new technology will continue to work no matter what happens and will greatly benefit British citizens, who make up the vast majority of those who will use them. Immigration Minister Caroline Nokes talks to the Uk Border force at the new ePassport gates at Newcastle Airport (Image: newcastle chronicle)\n“The Government is working very hard to make sure we get a good deal.”\nAdrian Dangar, 56, from North Yorkshire, used the e-gates upon returning from a family holiday in Corfu. Read More Theresa May in Newcastle RECAP: Tory cabinet visit Tyneside for Great Exhibition away day\nHe said: “I’ve been through them several times now and I think they’re brilliant.\n“The first time people use them they think they’re going to be slow and complicated but in reality they speed everything up.\n“I was last off the plane but I got through arrivals in no time at all.”\nHere’s how to use them: How to use ePassport gates\nOpen your passport to the photo page. Don’t forget to remove the passport from its cover.\nHold the photo page down on the reader and try to keep it still.\nLook at the screen in front until it turns green, then walk through the gate.\nRemember:\nRemove sunglasses, hats and scarves. You might need to take your glasses off too.\nGo through the gates one at a time.", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-30T18:00:00.000+03:00", "crawled": "2018-07-31T04:37:47.002+03:00", "highlightTitle": ""}