{"organizations": [], "uuid": "7922a2ee6a8d06a1c40e15c8350be11495e4986b", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/news/business/article1610685.ece/ALTERNATES/s1200/Jim-Chris-Dawson-35.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/business/50-biggest-businesses-devon-revealed-1729713", "country": "US", "title": "The 50 biggest businesses in Devon - revealed - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.112, "site_type": "news", "published": "2018-07-05T03:00:00.000+03:00", "replies_count": 0, "uuid": "7922a2ee6a8d06a1c40e15c8350be11495e4986b"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/50-biggest-businesses-devon-revealed-1729713", "ord_in_thread": 0, "title": "The 50 biggest businesses in Devon - revealed - Devon Live", "locations": [], "entities": {"persons": [{"name": "dawson", "sentiment": "none"}, {"name": "chris dawson", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "exeter racecourse", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "pavey group", "sentiment": "none"}, {"name": "cornwall kpmg", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}, {"name": "devon colleges group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Could not subscribe, try again later Invalid Email Get daily updates pushed directly to you Subscribe to notifications See our privacy notice\nThe Range empire owned by Devon billionaire Chris Dawson has once again topped the Top 150 list of largest employers in Devon and Cornwall.\nThe discount retailer, with a turnover of £761.2 million, is the biggest employer in the region with 8,846 workers.\nMr Dawson is one of the richest men in Britain with the Plymouth-headquartered business boosting his personal wealth by an extra £60 million in the past year. Mr Dawson, the former market trader is now among Britain’s most recognisable business faces.\nHe is continuing to grow his retail empire – another 100 stores are set to open by 2021.\nDevon dominates the list of Top 150 companies, with 71% of the biggest employers in the county, compared to 29% in Cornwall. Top 150: Devon v Cornwall KPMG\nThe list was revealed at the launch of the Western Morning News Annual Business Guide 2018 to VIP business leaders at Exeter Racecourse yesterday.\nSponsored by Pavey Group and Devon Colleges Group with data compiled by KPMG, the Annual Business Guide acts as a barometer for every sector and geographical area right across the region.\nIn launching the guide at the preview, Bill Martin, editor Western Morning News, said the guide was a key part of the #BackTheSouthWest campaign, designed to take a unified message to the government for the region’s investment needs. The Top 150 dominate in four sectors KPMG\nHe said: “ The launch of the Annual Business Guide which again this year showcases a region boasting remarkable levels of innovation, creativity, investment and hard work despite the uncertainty we are surrounded by and our peripherality.\n“All of those in this year’s list, and the tens of thousands of small and micro business in the region, deserve to be celebrated for their achievement and their contribution to the regional economy. And they also deserve support. Better roads, better rail, better digital connectivity are all “must-haves” rather than “nice to haves”. ”\nAlso in the top five are Exeter-based Pennon Group PLC, Devonport Dockyard in Plymouth, Newcross Healthcare Solutions in Totnes and Princess Yachts in Plymouth.\nHere is a video of the launch Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nThe top 20 shows only one new entrant with Natatomisam Limited. The James Brent vehicle for various businesses including Plymouth Argyle Football Club, Plymouth Pavilions and Saltrock Surfware moved up from 47 to 17.\nTogether, the Top150 have a total turnover of £11.4billion and employ 83,260.\nKPMG Plymouth compiled the list. It is based on accounts filed to Companies House by the end of May and includes companies headquartered in Devon and Cornwall and is ranked by the number of employees.\nIt does not include charities or the public sector.\nAndy Gordon, KPMG director, said: “With the uncertainty that has faced the UK economy over the last 12 months including Brexit and the retail slump, it is very pleasing to see that our top 150 Devon and Cornwall businesses have demonstrated stability and growth”\nThe full Top 150 covers businesses in Devon and Cornwall and is listed in a table below. Meanwhile... Here are the Top 50 in Devon Number 1: CDS (Superstores International) Ltd Employees: 8,846 Turnover: £761.2million\nCDS (Superstores International) Ltd, which trades as The Range, tops the pile in the annual Western Morning News list of the region’s biggest companies, compiled by accountancy firm KPMG.\nThe company, owned by Mr Dawson and his wife, now employs nearly 9,000 people and has a turnover of more than £761 million.\nThe Plymouth-headquartered business’ bounty is helping bulge its founder’s wallet too – by an extra £60 million in the past year. Mr Dawson, the former market trader who is now among Britain’s most recognisable business faces, is continuing to grow his retail empire – another 100 stores are set to open by 2021.\nProfits leapt in 2016/17 by more than 18% to nearly £68 million.\nAnd the mogul has revealed he is about to launch another five stores – in Portadown, Cardiff, Dublin, Liverpool and Chichester – by August.\nThe company has already opened five stores this year, in England and Ireland, and nine more, including three in Scotland and two in Belfast, are in the pipeline for the rest of 2018, taking the total to well above 150.\nThe 66-year-old is also looking to expand into Europe, but closer to home has started work on a £25million head office, training academy and superstore at Derriford in Plymouth.\nIn 2017 The Range opened its £100 million “mega shed” distribution centre at Avonmouth, near Bristol, creating 1,050 jobs.\nIt came as the firm leaped ten places up the list of Britain’s biggest private sector companies last year after increasing sales by £100 million. The chain’s sales increased by 15% to land it at number 80 in the Sunday Times HSBC Top Track 100 league table in mid 2017.\nFor its next mega-project, The Range’s HQ and superstore at Seaton Hill, Derriford, is expected to open in 2019 – and will be named Elsie Margaret House after Mr Dawson’s mother. (Image: John Allen) 2:Devonport Royal Dockyard Ltd, Plymouth, Devon\nEmployees: 5,127\nTurnover: £688.5million\nDevonport Royal Dockyard may soon have 500 fewer people working at it but the company that runs it has seen profits surge to a record £391.1million.\nEngineering giant Babcock International Group Plc owns and operates the main refit, maintenance and workshop area of the 330-acre naval site known as Devonport Royal Dockyard.\nThe company, which employs more than 5,000 people in Plymouth, is slimming down its management structure in the city, but in 2018 saw before-tax profits jump 8% on revenues of £4.659 billion, up by 2.5%.\nThat is good news for a company which was jettisoned from the FTSE 100 in 2017 – to make way for takeaway app Just Eat. The majority of the water treatment works at Crownhill will be relocated to Roborough (Image: Penny Cross) 3: Pennon Group PLC, Exeter, Devon\nEmployees: 4,799\nThe business behind South West Water, Viridor, Bournemouth Water and South West Water Business. 4: Newcross Healthcare Solutions Limited, Totnes, Devon\nEmployees: 2,719\nProvider of healthcare for elderly, sick and vulnerable people that has grown nationwide. 5: Princess Yachts International Ltd, Plymouth, Devon\nEmployees: 2,407\nTurnover: £274.4million\nLuxury boat builder Princess Yachts has been especially buoyant in 2018 making a £7.9 million profit and selling a jaw-dropping £30 million worth of boats in just one week.\nThe Plymouth company had a record-breaking year in which its order book hit £750 million.\nIt is a huge turnaround for the firm which in 2017 announced a loss of £7 million.\nAfter a stellar year, the firm, which employs about 2,500 people in the city, saw turnover jump 26.6% to £274.4 million.\nThat represents the firm’s highest sales figure in its 53-year history.\nFinancial results for the 12 months to December 31, 2017, show an operating profit before exceptionals of £7.9 million, representing a turnaround of £15million on its 2016 results.\nIt continues a trend of strong year-on-year growth for the L Catterton-owned luxury yacht builder.\nPrincess’ recent performance at the industry’s three biggest global sales events – the Cannes, Fort Lauderdale and Düsseldorf boat shows – saw the company power ahead across its entire fleet.\nPrincess’ advance order book now totals in excess £750 million, 20% higher than the previous year.\nTo support this growth, Princess has increased its workforce by more than 500 people in the past year. A Flybe plane at Newquay Airport (Image: Cornwall Airport Newquay / Idenna) 6: Flybe Group PLC, Clyst Honiton, Devon\nEmployees: 2,131\nTurnover: £707.4million\nEurope’s largest regional airline has been undergoing a transformation to bring it into profit after a reported loss of £9million. 7: Wills Lifestyle Holdings Limited, Salcombe, Devon\nEmployees: 1,973\nTurnover: £142.3million\nThe company behind Jack Wills, the clothing retailer, was founded with its first shop in Salcombe in 1999 and now has stores across the UK and the world including Kuwait, Singapore and Macau. 8: Mole Valley Farmers Ltd, South Molton, Devon\nEmployees: 1,933\nTurnover: £411.1million\nSouth West retail firm run as a cooperative with branches in Bridgend, Bridgwater, Cullompton, Frome, Gwinear, Holsworthy, Liskeard, Newton Abbot, Penzance, South Molton, St Columb, Tavistock andYeovil 9: Gregory Distribution (Holdings) Ltd, Exeter, Devon\nEmployees: 1,763\nProvides customised warehousing and distribution services for the contract distribution market throughout the UK St Austell Brewery chief executive James Staughton toasts the Queen's Award for Enterprise win 10: St.Austell Brewery Company Limited, St Austell, Cornwall.\nEmployees: 1,553\nTurnover: £169.3million\nThe makers of Tribute Ale and owners of pubs and inns throughout the region, it is the brand behind a number of pubs in Devon including The Globe in Topsham, Old Market House in Brixham and the Church House Inn in Kingsbridge. 11: Scot Group Limited, Exeter, Devon\nEmployees: 1279\nTurnover: £103.6million\nOperates both the Dollar and Thrifty rental brands in the UK and is the largest privately owned rental company in the UK. 12: Percy R Brend & Sons (Holdings) Ltd, Torquay, Devon\nEmployees: 1,166\nOwns a collection of 11 luxury hotels across Devon and Cornwall. 13: White Rose Ltd, Plymouth, Devon\nEmployees: 1,049\nTurnover: £34.7million\nThe franchisee behind 12 McDonald’s restaurants in Devon and Cornwall. Bruce Robertson, owner and chairman of Trago Mills has announced plans to build a fifth store by 2020 (Image: Stephen Haywood) 15: Charles Robertson (Holdings) Ltd t/a Trago, Liskeard, Cornwall\nEmployees: 875\nTurnover: £71.7million\nWith its flagship garden park at the Newton Abbot store, Trago is a longstanding discount retailer that has just opened its fourth store at Methyr Tydfil in Wales, its first outside the South West. 16: Norbord Europe Ltd, South Molton, Devon\nEmployees: 748\nTurnover: £298.6million\nA world-leading manufacturer of engineered wood-based panel products that has been supplying products to Europe for over 40 years.\nNorbord Europe is part of Norbord Incorporated, with headquarters in Toronto, Canada, publicly owned and listed on the Toronto Stock Exchange. 17: Vospers Motor House Ltd, Plymouth, Devon\nEmployees: 732\nThe car dealership is currently building a £12million car sales supersite in Exeter. 18: Accord-Uk Ltd, Barnstaple\nEmployees: 646\nTurnover: £438.6million\nPharmaceutical company involved in the development, manufacturing and distribution of pharmaceutical products to more than 70 countries globally. 20: Francis Clark LLP, Torquay, Devon\nEmployees: 555\nChartered accountants with offices in Exeter, New Forest, Taunton, Plymouth, Torquay, Poole, Truro and Salisbury. Queen Elizabeth II during their visit to Wrigley's in Plymouth. in 2015 21: The Wrigley Company Ltd, Plymouth, Devon\nEmployees: 532\nTurnover: £247.6million\nA family-owned business for more than a century, Wrigley became a subsidiary of manufacturing powerhouse, Mars in 2008 and produces 34 brands across its global portfolio. Wrigley UK produces more than a dozen of these, including Extra, Airwaves, Hubba Bubba, Tunes, Lockets, Starburst and Skittles. 22: Wrafton Laboratories Ltd, Braunton, Devon\nEmployees: 520\nTurnover: £46.4million\nPart of the Perrigo Company, leading global provider of healthcare products. Perrigo develops, manufactures and distributes over-the-counter medicines. 23: Devon Doctors Ltd, Exeter, Devon\nEmployees: 516\nTurnover: £30.6million\nProvides urgent out-of-hours GP service with treatment centres in Plymouth, Barnstaple, Exeter, Tiverton, Honiton, Torquay, Newton Abbot, Totnes and Okehampton. Warrens Bakery is looking to open 1,000 new shops over the next decade (Image: Warrens Bakery) 24: Warrens Bakery Limited, Penzance, Cornwall\nEmployees: 516\nTurnover: £16.2million\nCornish pasty makers, included here for its well known name on many Devon High Streets. It has 60 stores throughout the UK with more than 20 branches in Devon. 25: Amberon Holdings Ltd, Paignton, Devon\nEmployees: 469\nTurnover: £25.9million\nProvider of traffic management and temporary traffic lights. With 21 depots nationwide, Amberon operates throughout the UK. 26: John Heathcoat & Company (Holdings) Ltd, Tiverton, Devon\nEmployees: 462\nTurnover: £54.2million\nFounded in 1808, Heathcoat Fabrics is the leading supplier of engineered textile solutions with global custom. 27: Michelmores LLP, Exeter, Devon\nEmployees: 458\nTop 100 law firm with offices in London, Bristol and Exeter. 28: Foot Anstey LLP, Plymouth, Devon\nEmployees: 455\nTurnover: £38.3million\nOne of the largest regional law firms based outside London with offices in Exeter, Plymouth, Southampton, Taunton Truro, Bristol and London. 29: Lancaster Leisure Ltd, Barnstaple, Devon\nEmployees: 455\nFinancial services business founded in 1960 that holds or owns securities of companies. 30: Ashfords LLP, Exeter, Devon\nEmployees: 450\nTurnover: £40.6million\nNational provider of legal, professional and regulatory services with offices in Exeter, Plymouth, Bristol, London, Taunton and Tiverton. 31: CWC (UK Holdings) Ltd, Exeter, Devon\nEmployees: 449\nThe company behind Mercedes Benz Of Exeter 32: David Hunt (North Devon) Ltd, Barnstaple, Devon\nEmployees: 438\nFounded in 1998, the company sells prepared foods and drinks for on-premise consumption. 33: Bott Group Ltd, Bude, Cornwall\nEmployees: 427\nTurnover: £53.7million\nThe Bott Group, a world-leading manufacturer and supplier of workshop equipment, in-vehicle equipment and workplace systems, is technically in Cornwall but as its right on the Devon border, is included in this list.\nIt has production facilities in Germany, the United Kingdom and Hungary, and licensed partners and importers across the globe. 34: Midas Group Ltd, Exeter, Devon\nEmployees: 414\nTurnover: £213.6million\nThe construction firm behind Plymouth’s Oceansgate Marine Zone has reported a prosperous few months with increased profits and expansion into the West Midlands and South East.\nFrom its roots in the South West, Midas has grown to become one of the UK’s largest independent construction and property services providers, with offices at Indian Queens near St Columb in Mid Cornwall, Exeter, Newton Abbot, Bristol, Newport in South Wales and Southampton.\nHighlights of Midas’ year include the completion of the first phase of the Oceansgate marine enterprise project in South Yard, Plymouth, and a series of schemes under way across Cornwall and Devon including a new retail park at Marsh Mills in Plymouth, Cornwall’s new archive centre Kresen Kernow, a new Premier Inn for Wadebridge and the £17million new Hi-Tech and Digital Centre at South Devon College.\nIn Plymouth, it moved into larger offices this year, which will act as a hub for the group’s activities across the city and surrounding area and new offices opened in 2017 in Longbridge, Birmingham, and in Leatherhead, Surrey.\nIt is currently delivering the innovative 72-home low-energy Passivhaus development at Bodmin Road, Plymouth, which is the largest of its kind in the country, on behalf of another longstanding partner Plymouth Community Homes. Laurence Murrell of Torquay Leisure Hotels (Image: Andy Styles) 35: Torquay Leisure Hotels Ltd, Torquay, Devon\nEmployees: 410\nTurnover: £13.5million\nGroup of four hotels and self catering apartments owned by the Murrell family for almost 70 years. 36: British Ceramic Tile Ltd, Heathfield, Devon\nEmployees: 395\nTurnover: £48.5million\nThe largest manufacturer of ceramic and glass tiles in the UK, works with big name designers brands including Laura Ashley and Ted Baker with customers across the globe. 37: B.A.I. (UK) Ltd, Plymouth, Devon\nEmployees: 392\nThe company behind Brittany Ferries, operating from Millbay Docks, Plymouth 38: Centrax Industries Ltd, Newton Abbot, Devon\nEmployees: 389\nTurnover: £71.7million\nA longstanding name in the power generation industry, it makes generating sets with Siemens gas turbine engines. 39: The Barden Corporation (UK) Ltd, Plymouth, Devon\nEmployees: 384\nTurnover: £41million\nThe Plymouth employer is investing more than £15million to safeguard the business for another 50 years and create jobs.\nThe super precision bearing manufacturer has embarked on a five-year growth plan which will see it explore new markets, territories and products.\nIt is likely to boost employment at the Estover factory and increase turnover from the current £40million to £50million annually – and secure the long-term future of the business in Plymouth.\nBarden is a recognised world leader in super-precision bearing systems.\nIts products are found in cars, aircraft, the nuclear industry, missiles and satellites.\nThe plan is for it to plough cash into the plant so it can tap into the huge global growth in the aerospace industry, including commercial aircraft and communications satellites.\nBarden has already embarked on a two-year remodelling of its Estover factory.\nAbout £3.5million is being invested into this project, due to end in 2019. 40: Pro-Direct Group Ltd, Newton Abbot, Devon\nEmployees: 378\nWorld’s largest online sports retailer 41: Vital Pet Products Ltd, North Tawton, Devon\nEmployees: 366\nWholesale supplier of pet products throughout the UK 42: Landmark Information Group Ltd, Exeter, Devon\nEmployees: 364\nTurnover: £58.8million\nLandmark provides environmental and property risk assessment reports.\nIt supplies professional mapping and data in the UK – including, small and large scale digital mapping and data, GIS, historical maps, aerial photography and site intelligence reports, together with environmental risk and planning information for a wide number of sectors. 43: Rittal CSM Ltd\nEmployees: 358\nTurnover: £60.3million\nMetal enclosures firm Rittal CSM is creating jobs and predicting turnover to hit a record £90million in 2018 as growth in the world’s computer industry sends it into overdrive.\nThe Plymouth manufacturer is expecting to take on a “large” number of staff.\nAnd Rittal, which makes metal cabinets for industry and huge digital firms such as Facebook, Cisco and Hewlett Packard, is looking for a range of workers from university graduates to completely unskilled people seeking a new career.\nIt has created more than 100 jobs in the past year and now has more than 500 staff on the payroll at its vast Roborough factory.\nAnd it needs more, from experienced quality and industrial engineers, to new apprentices and even raw recruits it can train itself.\nIt has taken on unskilled people from Plymouth’s Jobcentre including a former chef who it trained to become a qualified welder. 44: Manor House Hotel (Okehampton) Ltd\nEmployees: 347\nHotel offering sport, craft and leisure breaks 45: Daish’s Group, Torquay, Devon\nEmployees: 346\nTurnover: £16million\nProvider of coach holidays with eight hotels in Devon, Cornwall, Dorset and the Isle of Wight. 46: Goodridge Ltd, Exeter, Devon\nEmployees: 334\nTurnover £36.6million\nGoodridge is the world’s leading manufacturer of performance brake lines and fluid transfer systems for motorsport, defence and specialist industry.\nGoodridge operates globally with manufacturing and distribution operations in the UK, USA, Mexico and Europe. Lachie Turner of Exeter Chiefs thanks fans after his last appearance at Sandy Park - the Aviva Premiership semi-final match between Exeter Chiefs and Newcastle Falcons (Photo: Tom Sandberg/PPAUK) 47: Exeter Rugby Group, Exeter, Devon\nEmployees: 329\nThe group behind Exeter Chiefs and the rugby ground and conference centre at Sandy Park 48: Trinity Ten, Clyst St Mary, Devon\nEmployees: 326", "external_links": [], "published": "2018-07-05T03:00:00.000+03:00", "crawled": "2018-07-05T09:05:59.012+03:00", "highlightTitle": ""}