{"organizations": [], "uuid": "982680ba3fdc8728b537d4841b6163a41fc1a103", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13947300.ece/ALTERNATES/s1200/1800px-x-810px-Splash.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-tynes-600m-devolution-deal-14939938", "country": "GB", "domain_rank": 21960, "title": "North of Tyne's £600m devolution deal set to move a step closer to reality", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-23T10:43:00.000+03:00", "replies_count": 0, "uuid": "982680ba3fdc8728b537d4841b6163a41fc1a103"}, "author": "Kali Lindsay", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-tynes-600m-devolution-deal-14939938", "ord_in_thread": 0, "title": "North of Tyne's £600m devolution deal set to move a step closer to reality", "locations": [], "entities": {"persons": [{"name": "tyne", "sentiment": "negative"}, {"name": "north of tyne", "sentiment": "negative"}, {"name": "theresa ma", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "north of tyne combined authority", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North of Tyne's £600m devolution deal set to move a step closer to reality Prime Minister Theresa May will announce the Government will lay legislation to conclude devolution deal Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA historic devolution deal that will unlock a £600 million investment fund for the North East will get under way on Monday.\nPrime Minister Theresa May will announce on a visit to the region that the Government will lay legislation in Parliament to formally conclude the devolution deal and transfer unprecedented new powers from central Government to local people in the North of Tyne.\nThe deal is worth more than £600m over 30 years and is expected to generate £1.1 billion for the local economy, create 10,000 new jobs, and leverage £1.2bn in private sector investment.\nThe three North of Tyne councils – Newcastle , North Tyneside , and Northumberland - expect to set up the new North of Tyne Combined Authority in October 2018. Leader of Newcastle City Council councillor Nick Forbes (Image: Newcastle Chronicle)\nAn an interim mayor will be appointed ahead of a mayoral election in summer 2019.\nMrs May said making Britain a country that works for everyone, in urban and rural regions, is a priority for the Government, with a thriving economy across the Northern Powerhouse central to that. Read More Theresa May in Newcastle LIVE: Tory cabinet visit Tyneside for Great Exhibition away day\nMrs May added: “We have set out major policies and investments as part of our Modern Industrial Strategy to unlock the potential in the North - and more than any government in history, we are making sure that we are delivering the outcomes that really matter to people who live and work here.” Prime Minister Theresa May speaks during a cabinet meeting (Image: PA)\nOnce established, the new authority will have the power to make key strategic decisions for the region – decisions traditionally made in London – that reflect local people’s needs and priorities.\nBenefits to the region will include more and better paid jobs, more affordable homes, faster economic growth and better connected communities, as well as opportunities created via a £23m adult education budget.\nLeader of Newcastle City Council Nick Forbes welcomed the announcement. Read More Theresa May: I'll give the North East the investment, the freedom and the good Brexit deal it needs\nHe said: “I and other leaders are looking forward to getting on with our job creation plans once this devolution deal clears the parliamentary process.\n“Our region needs more and better jobs and we have ambitious plans to take back control of decision making and let people here determine how we should invest in the North East.”\nMr Forbes said this is just the first step in the devolution journey, adding “myself and other leaders are ambitious for far greater devolution out of Whitehall and back to the north”. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-23T10:43:00.000+03:00", "crawled": "2018-07-23T11:56:50.006+03:00", "highlightTitle": ""}