{"organizations": [], "uuid": "5e682372557f4b8022b38d064ac972309468ae94", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14902233.ece/ALTERNATES/s1200/New-Wear-Crossing-Sunderland.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/under-investment-north-east-infrastructure-14901844", "country": "GB", "domain_rank": 21960, "title": "Under-investment in North East infrastructure laid bare in new report", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-12T19:47:00.000+03:00", "replies_count": 0, "uuid": "5e682372557f4b8022b38d064ac972309468ae94"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/under-investment-north-east-infrastructure-14901844", "ord_in_thread": 0, "title": "Under-investment in North East infrastructure laid bare in new report", "locations": [], "entities": {"persons": [], "locations": [{"name": "new wear crossing", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "office of national statistics", "sentiment": "none"}, {"name": "scape group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The 100 metre centrepiece of the New Wear Crossing in Sunderland is lifted into place, a crucial step in the construction of the city's first new bridge across the River Wear for 45 years (Image: PA) Share Get\nYears of under investment in the region’s infrastructure have been laid bare in a new report - though the funding gap could be narrowing.\nResearch published by Scape Group and based on figures from the Office of National Statistics shows that during the 20 years from 1997-2017, the North East’s infrastructure output was valued at £4,054 per person. Read More Barratt Developments leads FTSE 100 risers after revealing it will beat profit predictions\nThat is significantly less than the £6,160 per person spent in London and one of the lowest figures in the country.\nBut Scape’s analysis found that the North East had received a significant acceleration in infrastructure investment over the last four years, getting the highest spending per person in 2017 at £457.\nThe report does not identify individual projects, though work on schemes like the Northern Spire bridge in Sunderland and the A19 Silverlink roundabout is seeing significant investment to improve the region’s transport infrastructure.\nBut business groups have called for changes to be made to the formulas used to calculate how infrastructure spending is distributed across the country. The A19/Coast Road Silverlink works, which are entering the final stage of construction\nRachel Anderson, North East England Chamber of Commerce assistant director, said: “These figures are unsurprising as we have known for a long time that the Treasury formulas for infrastructure spend favour moving people around the South East, rather than investing in our region.\n“A key Chamber campaign is to change these formulas to help the North East make a case for investment to grow our economy.”\nOne of the big concerns raised by the Chamber is the lack of investment in the North East’s transport infrastructure.\n“The transport infrastructure of our region is of paramount importance, right from the dualling of the A1 to Scotland to the A66 much-needed improvements and our under-invested rail network,” added Ms Anderson. Read More Public to have say on £250m Newcastle urban village set to create more than 1,000 jobs\n“One of the main priorities for the next few years is funding for Darlington station, so it can service the East Coast mainline, which will be particularly important for new high speed trains. We also want to see improvements to the A19 and the creation of a new Tees Crossing.”\nIn total the North East has received £10.7bn in infrastructure output over the last 20 years. That compares to £33.5bn in the North West, £36.65bn in the South East, and £54.14bn in London.\nHowever, on a yearly basis the amount of investment in the North East fell to a low of just £190m in 2008, compared to £2.11bn in London during the same year.\nThe report also warned that infrastructure output could take a hit in the years to come due to a skills shortage in the industry that may be caused by Brexit.\nMark Robinson, Scape Group chief executive, said: “Over the past decade the UK has become increasingly reliant on construction talent from the European Union, so much so that EU migrants now comprise around 8% of the construction workforce.\n“Coupled with a shortage of UK labour the industry will face a real issue in the immediate future if action isn’t taken to widen the talent pool to include those who may not have considered a career in construction before.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-12T19:47:00.000+03:00", "crawled": "2018-07-12T22:42:10.005+03:00", "highlightTitle": ""}