{"organizations": [], "uuid": "3a458075e102d5cd08344b001b7839c31b8f684f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14760040.ece/ALTERNATES/s1200/Breaking-News-Graphic-Live-Blog-Smaller.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-14882578", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-09T08:30:00.000+03:00", "replies_count": 0, "uuid": "3a458075e102d5cd08344b001b7839c31b8f684f"}, "author": "Tom Eden", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-14882578", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "david davis", "sentiment": "negative"}], "locations": [{"name": "northern ireland", "sentiment": "none"}], "organizations": [{"name": "customs union", "sentiment": "none"}, {"name": "commission", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Ian Lavery, the Wansbeck MP, posted this in the early hours:\nNewcastle Central MP Chi Onwurah has a similar message to Emily Thornberry (7.10am):\nNewcastle North’s MP Catherine McKinnell hasn’t posted about the resignation, but did retweet this:\nMeanwhile, the region’s Tory MPs have remained silent about the situation. 07:18 Tom Eden Will there be a leadership challenge?\nA Conservative Party leadership contest would be triggered if 15% of Tory MPs write to Sir Graham Brady, the chairman of the 1922 committee expressing their lack of confidence in the leader.\nIn the current parliament that means 48 MPs.\nCoincidentally, Theresa May was due to speak to the 1922 committe today. That could be quite interesting.... Politics Tom Eden Government in chaos after resignations\nDavid Davis’s resigntion is a major blow to Prime Minister Theresa May and her exit strategy from the European Union. (Image: Getty Images Europe)\nThe Prime Minister is hoping to win over Tory Brexiteers after a backlash against her plans for leaving the European Union.But Mr Davis, who signed up to the plan agreed by the Cabinet at Chequers on Friday, has now quit. Two senior sources confirmed Mr Davis’ departure from the Cabinet.His junior ministerial colleague Steve Baker has also quit his role at the Department for Exiting the European Union (Dexeu) along with Suella Braverman, another Brexit minister.The resignations are likely to embolden Brexit supporting backbenchers with concerns about Mrs May’s leadership. 07:10 Tom Eden Resignation reaction\nPlenty of reaction already to the the news that David Davis has resigned just day’s after the Conservatives ‘unity away day’:\nBrexiteer Jacob Rees-Mogg said it will be “very difficult” for Mrs May’s Brexit plans to win MPs’ backing without Mr Davis.\nDisputed a suggestion that Mrs May’s position was now untenable, he told BBC 5Live:\n“These proposals will have to come to the House of Commons in legislation and the question is ‘will they command support from Conservative MPs?’.\n“And I think without David Davis there, without his imprimatur, it will be very difficult for them to get the support of Conservative MPs and therefore the Prime Minister would be well advised to reconsider them.”\n“Even the greatest of leaders can find that some of their proposals do not command widespread support and have to review them, even when they’ve got large majorities.”\nAnd from the Labour side: 07:04 Tom Eden Theresa May's response\nHere is the full text of Theresa May’s letter in response to David Davis’s resignation as Brexit Secretary:\n“Dear David\n“Thank you for your letter explaining your decision to resign as Secretary of State for Exiting the European Union.\n“I am sorry that you have chosen to leave the Government when we have already made so much progress towards delivering a smooth and successful Brexit, and when we are only eight months from the date set in law when the United Kingdom will leave the European Union.\n“At Chequers on Friday, we as the Cabinet agreed a comprehensive and detailed proposal which provides a precise, responsible, and credible basis for progressing our negotiations towards a new relationship between the UK and the EU after we leave in March. We set out how we will deliver on the result of the referendum and the commitments we made in our manifesto for the 2017 general election: Leaving the EU on 29 March 2019. Ending free movement and taking back control of our borders. No more sending vast sums of money each year to the EU. A new business-friendly customs model with freedom to strike new trade deals around the world. A UK-EU free trade area with a common rulebook for industrial goods and agricultural products which will be good for jobs. A commitment to maintain high standards on consumer and employment rights and the environment. A Parliamentary lock on all new rules and regulations. Leaving the Common Agricultural Policy and the Common Fisheries Policy. Restoring the supremacy of British courts by ending the jurisdiction of the European Court of Justice in the UK. No hard border between Northern Ireland and Ireland, or between Northern Ireland and Great Britain. Continued, close co-operation on security to keep our people safe. An independent foreign and defence policy, working closely with the EU and other allies.\n“This is consistent with the mandate of the referendum and with the commitments we laid out in our general election manifesto: leaving the single market and the customs union but seeking a deep and special partnership including a comprehensive free trade and customs agreement; ending the vast annual contributions to the EU; and pursuing fair, orderly negotiations, minimising disruption and giving as much certainty as possible so both sides benefit.\n“As we said in our manifesto, we believe it is necessary to agree the terms of our future partnership alongside our withdrawal, reaching agreement on both within the two years allowed by Article 50.\n“I have always agreed with you that these two must go alongside one another, but if we are to get sufficient detail about our future partnership, we need to act now. We have made a significant move: it is for the EU now to respond in the same spirit.\n“I do not agree with your characterisation of the policy we agreed at Cabinet on Friday.\n“Parliament will decide whether or not to back the deal the Government negotiates, but that deal will undoubtedly mean the returning of powers from Brussels to the United Kingdom.\n“The direct effect of EU law will end when we leave the EU. Where the UK chooses to apply a common rulebook, each rule will have to be agreed by Parliament.\n“Choosing not to sign up to certain rules would lead to consequences for market access, security co-operation or the frictionless border, but that decision will rest with our sovereign Parliament, which will have a lock on whether to incorporate those rules into the UK legal order.\n“I am sorry that the Government will not have the benefit of your continued expertise and counsel as we secure this deal and complete the process of leaving the EU, but I would like to thank you warmly for everything you have done over the past two years as Secretary of State to shape our departure from the EU, and the new role the UK will forge on the world stage as an independent, self-governing nation once again.\n“You returned to Government after nineteen years to lead an entirely new Department responsible for a vital, complex, and unprecedented task.\n“You have helped to steer through Parliament some of the most important legislation for generations, including the European Union (Notification of Withdrawal) Act 2017 and the European Union (Withdrawal) Act 2018, which received Royal Assent last week.\n“These landmark Acts, and what they will do, stand as testament to your work and our commitment to honouring the result of the referendum.\n“Yours sincerely, Theresa May”", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14882578;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-07-09T08:30:00.000+03:00", "crawled": "2018-07-09T09:07:42.005+03:00", "highlightTitle": ""}