{"organizations": [], "uuid": "00558a020393910db7754ad1b173b25d22e26cf8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1763237.ece/ALTERNATES/s1200/1014421.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/alan-nuttall-jobs-ms-asda-1763065", "country": "GB", "domain_rank": 48128, "title": "M&S and Asda shopfitters Alan Nuttall Partnership to cut up to 245 jobs in Hinckley and Dudley as high street spending falls - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "00558a020393910db7754ad1b173b25d22e26cf8"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/alan-nuttall-jobs-ms-asda-1763065", "ord_in_thread": 0, "title": "M&S and Asda shopfitters Alan Nuttall Partnership to cut up to 245 jobs in Hinckley and Dudley as high street spending falls - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "dudley", "sentiment": "negative"}, {"name": "hinckley", "sentiment": "negative"}, {"name": "alan nuttall", "sentiment": "none"}, {"name": "alan nuttall partnership", "sentiment": "none"}], "locations": [{"name": "swarovski", "sentiment": "none"}, {"name": "hinckley", "sentiment": "none"}], "organizations": [{"name": "leicestershire live m&s", "sentiment": "negative"}, {"name": "asda", "sentiment": "negative"}, {"name": "alan nuttall partnership", "sentiment": "negative"}, {"name": "m&s", "sentiment": "negative"}, {"name": "homebase", "sentiment": "none"}, {"name": "morrisons", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "M&S and Asda shopfitters Alan Nuttall to cut up to 245 jobs in Hinckley and Dudley as high street spending falls Award-winning firm hit by knock-on effect of consumer slowdown on its big-name clients Share Nuttalls was founded by Alan Nuttall, pictured here in 2006 Share Get Business Thank you for subscribing! Could\nMore than 200 jobs are set to go at shop fit-out specialist Alan Nuttall Partnership, whose clients include M&S, Pret, Swarovski, Morrisons, M&S, Homebase and Harrods.\nThe company, which has operations in Hinckley and Dudley, has been badly hit by its high street clients and restaurants cutting down on store revamps following a drop in consumer spending.\nThe £50 million turnover company, which builds and supplies shop interiors, food counters, refrigeration and signs, has told its 500-plus staff that as many as 245 jobs are at risk if the business is to keep trading.\nTurnover has dropped from £59 million two years ago.\nAsda, its second biggest client, recently announced merger plans with Sainsbury's, while the owner of another client, high street fashion chain Accessorize, cut hundreds of jobs last year and closed stores in an effort to keep trading. Happier times: In 2016 Nuttalls celebrated its 50th anniversary\nElsewhere, Homebase is cutting 300 jobs at its Milton Keynes head office, with speculation that as many as 80 of its stores could close.\nAlan Nuttall Partnership employs around 100 people in Hinckley, where it has its hot food counter and sign operations, and 400 in Dudley, where its main shopfitting business is based. Read More What Dunelm have said over calls for new branch in Leicester city centre or Fosse Park\nManaging director Nino Calandra said staff were told on Friday that the “drastic” decision to job cuts would safeguard the future of the business as it waited for new orders and looked at new sectors to move into, such as leisure.\nHe said he hoped the jobs cuts would be kept down to 200.\nSome 84 redundancies were made at the start of the year, but the market had continued to deteriorate.\nMr Calandra said: “It is our intention to downsize and re-shape the business to reflect the shrinking retail sector.\n“Sadly, we have no option.\n\"We need to do this to live to fight another day.\n“We have invested time and resource to try and move into new sectors to reduce our dependence on the retail sector, but sadly this doesn’t happen overnight, although we hope we will see the benefits of these actions in the near future.”\nA spokesman for the business estimated that the retail downturn meant that nationally, more than 10,000 shops were expected to close this year. Read More\nMerger deals, such as that planned between Asda and Sainsburys, were putting further strain on businesses such as Nuttalls, he added.\nThe spokesman said: “The growth of on-line retailing seems virtually unstoppable.\n“Traditional retailers, whilst having a larger choice of empty shops countrywide to choose from, are hesitating to open new branches for a number of reasons, with confidence at a worrying level as we head towards Brexit next March.\n“The seemingly unstoppable growth of supermarkets – the retail sensation for the last 40 years – is coming to an end.\n“No longer are large retailers each opening 20 to 30 new stores a year.\n“It’s unlikely that will ever happen again.” Read More Businesses \"less confident about recruiting\" due to Brexit and slow down in high street spending\nThe company has nearly a million square foot of manufacturing, engineering and office space.\nThree years ago it became an employee-owned partnership in much the same way as John Lewis, with every employee becoming a partner.\nThe partnership has its headquarters in Dodwells Road, Hinckley, and was set up as a small display firm by Alan Nuttall in his garage on a £137 budget in September 1966.\nMr Nuttall changed the way fruit and veg was sold by creating the first self-serve counter system, which is still in use by supermarkets today. Like us on Facebook", "external_links": [], "published": "2018-07-09T03:00:00.000+03:00", "crawled": "2018-07-09T14:21:01.018+03:00", "highlightTitle": ""}