{"organizations": [], "uuid": "6d671366e9d484c4e444c04a5ca3cb1f25637c46", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/news/leicester-news/article351929.ece/ALTERNATES/s1200/PICS-435-BWalsh-pics-001-0112315JPG.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/leicestershire-great-place-indian-firms-1754700", "country": "GB", "domain_rank": 48128, "title": "India still loves doing business in Leicestershire – despite Brexit wobbles - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.023, "site_type": "news", "published": "2018-07-09T03:00:00.000+03:00", "replies_count": 0, "uuid": "6d671366e9d484c4e444c04a5ca3cb1f25637c46"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/leicestershire-great-place-indian-firms-1754700", "ord_in_thread": 0, "title": "India still loves doing business in Leicestershire – despite Brexit wobbles - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "grant thornton", "sentiment": "none"}, {"name": "beth walsh", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}, {"name": "india", "sentiment": "none"}, {"name": "regent road", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "east midlands", "sentiment": "none"}, {"name": "leicester city centre", "sentiment": "none"}], "organizations": [{"name": "leicestershire live news india", "sentiment": "negative"}, {"name": "dion global solutions", "sentiment": "none"}, {"name": "little india event", "sentiment": "none"}, {"name": "confederation of indian industry", "sentiment": "none"}, {"name": "britain tracker", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News India still loves doing business in Leicestershire – despite Brexit wobbles “UK cannot overlook significance of the Indian economy – set to be the third largest by 2030 – and must ensure it remains a leading investment destination” Share Flash mob dancers in Leicester City Centre for Little India Event (Image: Beth Walsh) Share Get Business Thank you for subscribing! Could\nIndian-owned firms continue to play a key part in the success of the East Midlands according to a new report – despite Brexit wobbles.\nThe India meets Britain Tracker, published by accounting firm Grant Thornton and the Confederation of Indian Industry, looked at Indian businesses operating in the UK with an annual growth rate of 10 per cent or more.\nIt suggested uncertainty over Brexit doesn’t seem to have had much impact with around 800 Indian companies now operating in the UK.\nDion Global Solutions, an Indian-based technology provider to the finance sector, with an office in Regent Road, Leicester, was among the most successful according to the report. Practice Leader Chris Frostwick at Grant Thornton in Leicester.\nChris Frostwick, practice leader of Grant Thornton’s Leicester office, also in Regent Road, said: “Our tracker report places Leicester company Dion Global Solutions at number 22 with a 60 per cent growth in turnover.\n“The report clearly shows that the UK remains a highly attractive destination for Indian investors.\n“Following the Brexit vote, the UK economy is in a period of flux as it looks at how to reinvigorate its role as a global trading nation and seeks to forge new trade deals.\n“With India’s growing wealth and increasingly important role on the world stage its position in the Commonwealth is growing, coinciding with the UK’s aims to revitalise trade and investment with Commonwealth countries.\n“The UK cannot overlook the significance of the Indian economy – set to be the third largest in the world by 2030 – and must ensure that, beyond Brexit, it remains a leading investment destination.” Regional IoD boss of the year Nik Kotecha, chief executive of Morningside pharmaceuticals\nDr Nik Kotecha OBE, chief executive of Loughborough medicines supplier Morningside Pharmaceuticals, said the region was a great place to do business.\nHe said: “I was honoured to accompany Prime Minister Theresa May on her first trade mission to India, and during the visit I saw Indian businesses were very interested in two-way investment with the East Midlands and UK as a whole. Read More How Cofresh went from a fish and chip shop in Leicester to a booming national business\n“There is a real appetite for hi-tech exports of products and services from the UK, which was evidenced by the £1.2 billion in trade deals announced following the trip.\n“I think this year’s Tracker shows our business ties with India are continuing to grow and this is providing a boost to the economy, as well as jobs for people locally, and tens of thousands nationally.” Like us on Facebook", "external_links": [], "published": "2018-07-09T03:00:00.000+03:00", "crawled": "2018-07-09T09:28:19.021+03:00", "highlightTitle": ""}