{"organizations": [], "uuid": "19822e979d1833af103e5ba9070bfed945cb96e4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14937985.ece/ALTERNATES/s1200/0_IBP_NEC_220718tyne_bridge_01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-14937891", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-22T11:00:00.000+03:00", "replies_count": 0, "uuid": "19822e979d1833af103e5ba9070bfed945cb96e4"}, "author": "Tom Eden", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-14937891", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "rafa benitez", "sentiment": "negative"}, {"name": "tom eden benitez", "sentiment": "negative"}, {"name": "mike ashley", "sentiment": "none"}, {"name": "toon", "sentiment": "none"}, {"name": "keane", "sentiment": "none"}, {"name": "benitez", "sentiment": "none"}], "locations": [], "organizations": [{"name": "liverpool", "sentiment": "none"}, {"name": "real madrid", "sentiment": "none"}, {"name": "academy", "sentiment": "none"}, {"name": "united", "sentiment": "none"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "magpies", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tom Eden West Brom's loan offer for Dwight Gayle rejected\nNewcastle’s bid to sign Salomón Rondón is set to splutter into another week after West Bromwich Albion threw a curve ball United’s way during the latest round of discussions.\nHaving already rejected the offer of a structured deal from Newcastle , the Baggies asked for Dwight Gayle on a season-long loan.\nThis was swiftly snubbed by United boss Rafa Benitez with the 58-year-old eager to hold on to the former Crystal Palace striker this season.\nWest Brom were offered Rolando Aarons as an option last week but the relegated Premier League side opted against the move.\nEffectively losing Gayle in exchange for Rondon wouldn’t solve anything for Benitez either because he still wants an additional forward to add much-needed competition to their ranks.\nIf Newcastle can agree the sale of Aleksandar Mitrovic - who is due back on Tyneside on Wednesday for pre-season training - it might help push through a £16.5million purchase of Rondon. Newcastle Tom Eden Care home with just one bath put in special measures\nA Newcastle care home which is being investigated over assault allegations has been put in special measures by a health watchdog. (Image: Newcastle Chronicle)\nInspectors from the Care Quality Commission (CQC) carried out an unannounced inspection after claims three members of staff abused residents at Park House Care Home in Fawdon .\nPolice are conducting inquiries into the allegations but the CQC inspection revealed a number of other issues - including just one working bath between 46 residents and people being referred to as “rezzies” in a staff meeting.\nThe home, run by Akari Care, has now been rated ‘inadequate’ and put in special measures.\nCQC inspectors visited the home three times at the end of May this year after receiving an anonymous allegation of abuse at the home.\nTheir report said that during the inspection several people “raised safeguarding allegations of a physical and psychological nature”.\nIt said: “Two staff informed us of their concerns about how certain staff spoke with people.”\nThey also found that there was only one bath in use for all people on both floors because none of the showers or other baths were working - although this was resolved by the third day of the inspection.\nThe report said there had been no running water in the ground floor sluice throughout April and May 2018, and “suitable water temperatures were not always maintained in people’s bedrooms”.\nIt also criticised some of the language used by some staff which “did not promote people’s dignity” 15:50 Tom Eden Berwick MP facing questions over Brexit lawbreaking\nA Northumberland MP is among those facing questions over her involvement in the Brexit campaign group which broke electoral law. Berwick MP Anne-Marie Trevelyan\nBerwick MP Anne-Marie Trevelyan is a former board member of Vote Leave, which has been fined £61,000 and referred to police.\nThe Electoral Commission said the group exceeded its £7m spending limit by funnelling £675,315 through pro-Brexit youth group BeLeave - though the group branded the findings “wholly inaccurate”.\nThis week a number of Labour MPs, including Sunderland MP Julie Elliot, called for the referendum to be re-run as a result of “cheating”.\nAnd questions have been raised over the positions of politicians who were of key members of Vote Leave.\nMs Trevelyan refused to answer questions about the scandal surrounding Vote Leave, when asked by ChronicleLive today, but did say that she has not been approached directly by the police or the Electoral Commission. Jillian Grant Tom Eden Blind victim battered with hammer by twisted murderer\nMurdered blind woman Jillian Grant had been smashed to the head with a hammer, strangled and possibly drowned and sexually assaulted by a “twisted” killer who then tried to burn his parents to death as they slept.\nMark Smith subjected vulnerable Jillian to a terrifying ordeal then dumped her body in a cupboard at his home in North Shields.\nThe killer then set fire to his parents’ home as they slept in the early hours of Christmas Day - but they were saved by their smoke alarm.\nWhen the emergency services turned up to the blaze in Heaton, Newcastle, Smith was there with his parents, but suspicion quickly fell on him as he was holding the same kind of bottle used to set four seats of fire at the house.\nAnd when police went to his home as part of their investigation, they found traces of blood in the bathroom then discovered Jillian’s battered body hidden under a large number of items in a hall cupboard.\nGruesome details of the case were finally revealed in court as the case against Smith - who killed himself in prison having pleaded guilty to murdering Jillian and attempting to murder his parents - was closed.\nJudge Paul Sloan QC said he would have been jailed for a “very long period” had he not hanged himself in his cell.\nProsecutor Kevin Wardlaw told Newcastle Crown Court : “At about 5am on Christmas Day last year, the emergency services were called to a house fire in Heaton, Newcastle, at the home of Graham and Linda Smith. 15:12 Tom Eden Theresa May to visit the North East\nPrime Minister Theresa May and her cabinet are in Newcastle tomorrow for an away day as government ministers visit the North East. Prime Minister Theresa May speaks during a cabinet meeting (Image: PA)\nThe cabinet are coming to the region for a special meeting to tie in with the Great Exhibition of the North, taking place in Newcastle and Gateshead .\nEconomic growth, skills and export strategy are expected to be on the agenda.\nThe Prime Minister - writing exclusively for ChronicleLive - claims: “This Government believes in the North East, and this Government is backing the North East.”\nMrs May is also expected to make announcements about the North of the Tyne devolution deal and the East Coast Main Line, which has been temporarily taken back into public ownership after the failure of the Virgin Trains franchise.\nThe last cabinet ‘away day’, at the Prime Minister’s grace and favour residence Chequers, descended into farce as a raft of resignations followed an apparent ‘agreement’ about Brexit.\nFormer Brexit Secretary David Davis resigned over the plan, with ex Foreign Secretary Boris Johnson following in his wake. Politics Tom Eden Brexit secretary accuses EU of 'irresponsibly' increasing pressure\nBrexit Secretary Dominic Raab has accused the EU of “irresponsibly” ramping up pressure in withdrawal negotiations. (Image: Getty Images Europe)\nThe comments came as Mr Raab indicated he was still trying to persuade all members of the Cabinet that Theresa May’s Chequers compromise agreement was “the best plan to get the best deal”.\nAs Mr Raab, who has said a deal with the EU can be reached by October, readied to return to Brussels for more Brexit talks on Thursday, he signalled that Britain could withhold its £39 billion divorce bill if it did not get a trade deal in return.\nAnd Tory former prime minister Sir John Major left the door open to a new referendum, insisting such a vote would be “morally justified”.\nMr Raab was scathing about comments from Brussels stating that a no deal scenario would mean there would be no specific arrangements in place for UK citizens living on the continent, or for EU migrants in Britain after withdrawal.\nMr Raab told BBC1’s The Andrew Marr Show: “Well, I think that’s a rather irresponsible thing to be coming from the other side.\n“We ought to be trying to reassure citizens on the continent and also here.\n“There is obviously an attempt to try and ramp up the pressure.”\nThe Brexit Secretary said there had to be “conditionality” under the Article 50 withdrawal mechanism between settling Britain’s exit payment and creating a new relationship with the EU.\nHe told the Sunday Telegraph:\n“Article 50 requires, as we negotiate the withdrawal agreement, that there’s a future framework for our new relationship going forward, so the two are linked.\n“You can’t have one side fulfilling its side of the bargain and the other side not, or going slow, or failing to commit on its side.\n“So, I think we do need to make sure that there’s some conditionality between the two.” 14:09 Tom Eden Cancer-battling dad \"hopeful\" over medical cannabis\nA dad who believes medical marijuana could help him fight a rare cancer has welcomed expert calls for legalisation. Paul Keeney with wife Cheryl and son Dylan\nThe Advisory Council on the Misuse of Drugs (ACMD) on Thursday advised cannabis products should be on offer as medical treatments, where safe.\nTheir recommendation would put the drug schedule two of the misuse of drugs regulations 2001, meaning it could be prescribed by doctors. At present, cannabis is classed as a schedule one substance, meaning it’s considered to have no medical value.\nFor Ashington cancer-suffered Paul Keeney, this news is a cause for “cautious hope”.\nPaul was diagnosed with a rare form of penile cancer in April last year and has since had to undergo six operations.\nFrom his own research, and talking with friends who have risked criminalisation to seek a cure, he believes cannabis oil could halt the progression of the cruel disease.\nBut using it would make the dad-of-one a criminal.\nPaul, who started an online petition for the legalisation of medical marijuana signed by close to 300,000 people, said: “Altogether this seems like good news. They’ve deemed it safe, said it should be taken out of schedule one, and that’s the first step to legalisation.\n“It’s become absolutely massive now, everyone’s talking about it. There’s no getting away from it now, the Government can’t hide from the fact that it’s safe, effective, and people know it is.”\nHowever, Paul urged lawmakers and researchers to act fast, building on knowledge developed abroad, to ensure those in need of medication could access the drug as soon as possible. Stockton Man, 46, 'fighting for his life' after serious assault\nA man is critically ill in hospital after a serious Sunday morning assault in Stockton.\nPolice were called to a report of a “serious assault” on Cleatlam Close, Hardwick, at about 10am on Sunday, July 22.\nA 46-year-old man was flown to James Cook University Hospital by air ambulance, where he is described as being in a critical condition.\nOnlookers gathered as the air ambulance landed near Hardwick Green Primary Academy.\nPolice haven’t released further details, but locals were reporting that a man had been stabbed.\nA house was cordoned off with blue and white police tape and a Crime Scene Investigation van was among the police vehicles attending.\nThe Cleveland Police helicopter was also sent to the scene.\nA Cleveland Police spokeswoman said: “Enquiries are currently ongoing and officers are appealing for witnesses or anyone with information to contact Cleveland Police on the non-emergency number 101, quoting event number 133353.”", "external_links": ["https://www.gazettelive.co.uk/news/teesside-news/helicopter-police-hardwick-stockton-live-14938329", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14937891;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-07-22T11:00:00.000+03:00", "crawled": "2018-07-22T16:19:19.004+03:00", "highlightTitle": ""}