{"organizations": [], "uuid": "016a8561eb6f346bd6aafb645ac8572c7ad96aba", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1285876.ece/ALTERNATES/s1200/Storm-damage-at-Dawlish-damage-to-the-railway-tracks-and-road-at-Riviera-Terrace-and-Sea-lawn-Terrace-Dawlish-2014.jpg", "site_section": "http://www.westernmorningnews.co.uk/education-news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/failing-dawlish-rail-line-is-1757597", "country": "GB", "title": "Failing Dawlish rail line 'is a threat' to Exeter", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-06T18:55:00.000+03:00", "replies_count": 0, "uuid": "016a8561eb6f346bd6aafb645ac8572c7ad96aba"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/failing-dawlish-rail-line-is-1757597", "ord_in_thread": 0, "title": "Failing Dawlish rail line 'is a threat' to Exeter", "locations": [], "entities": {"persons": [{"name": "dawlish", "sentiment": "none"}, {"name": "chris grayling", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "bradshaw", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "exeter ben bradshaw", "sentiment": "none"}, {"name": "exeter failing dawlish", "sentiment": "none"}, {"name": "invalid email empty", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Failing Dawlish rail line 'is a threat' to Exeter Ben Bradshaw MP said that a lack of infrastructure funding is holding the region back Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nEmpty promises over the future of the Dawlish rail line is a major threat to Exeter and Devon, MP Ben Bradshaw has warned.\nThe labour MP said that the long awaited fix to the Dawlish line is a classic example of how the region is left lagging behind London and Manchester when it comes to government funding and it is holding back growth.\nHe said: “We have had very little compared with London and the North and we keep banging on about it but we still don’t have a promise of a meaningful solution to the Dawlish railway problem.\n“We get a pretty bad deal when it comes to regional development funding and if you look at infrastructure, railways are a classic example.” Read More\nMr Bradshaw was referring to a promise made in May by transport secretary Chris Grayling that work to protect the Westcountry main railway line at Dawlish is “the most important infrastructure project in the country”. Exeter MP Ben Bradshaw\nAnd yet, four years and four months after the only main line west of Exeter was severed for weeks in the February 2014 storm, the Government is still only at the stage of drawing up a feasibility study to deliver on its promise to solve the problem.\nMr Bradshaw said: “Our peripherality and our apparent lack of a strong political voice is one of the things that holds us back.”\nThe South West receives £212 a head annually in railways funding, compared to £1,943 in London. Yet, passenger growth in the South West has been twice the national average. What are the plans for the Dawlish rail route?\nStorms like the one that cut the rail link at Dawlish in 2014 could become an annual event over the next 100 years.\nNetwork Rail has a programme of improvements to protect the line between Exeter and Newton Abbot to improve resilience over the next century.\nTo date, although the investigations are being paid for by the Department of Transport, no funding has been secured for the works and it will have to go through public consultation and the planning process.\nIt is making the Teignmouth cliffs its priority, with four other programmes in the pipeline.\nClimate change is increasing the risk of landslip from the steep cliffs between Teignmouth and Parson’s Tunnel which would block the main Exeter to Plymouth railway line.\nSuch a landslip happened within days of the track being cut by waves just up the line at Dawlish, but received less publicity.\nNetwork Rail highlights two options for the cliffs.\nThe first would involve cutting back the cliffs to a 30-degree slope.\nThe second option is to push the line further out to sea and to stabilise the base of the cliffs. The go-ahead depends on public consultation and government funding.\nNetwork Rail has raised a section of the sea wall walk to meet the higher level along the rest of the Exeter to Newton Abbot stretch. The low level meant that the railway had far less protection from the railway and that contributed to the failure in 2014.\nNetwork Rail also believes that, unless action is taken to protect the line along the Exe and Teign estuaries, we could see scenes like those on the Somerset Levels in 2013/14.\nOver the next 15 to 30 years the embankments along the estuaries will have to be raised, and drainage improved.\nFinally, on a 10 to 50-year timescale, Network Rail will tackle falling rocks from the cliffs above the Kennaway Tunnel to Parson’s Tunnel stretch of line with rockfall shelters to protect the railway and trains from any falling debris to the east of Parsons Tunnel.\nHe was speaking at the Exeter Chamber Networking Lunch held at the Royal Albert Memorial Museum (RAMM) on Friday, July 6.\nSpeaking during a Q&A session with discussions including Brexit and the NHS, he said that a lack of a strong local or regional local government structure compared to Manchester, fronted by Mayor Andy Burnham, meant the region lags behind. Read More Iconic Exeter pub will close this month - to be replaced by student flats\nHe said: “You can do a lot more when you have that. Here, you have this ridiculous two tier local government system, these Local Enterprise Partnerships that are too small and that are not really a coherent geographical area.\n“We do very well given some of the challenges but that doesn’t mean we could do better if some of those were addressed.”\nMr Bradshaw said that future threats to Exeter will be any impact to the growth and student numbers at the University of Exeter. Exeter University\nLast year, an economic impact study found that more than £1billion has been injected into the economy and 11,000 jobs have been generated by the University of Exeter.\nThe analysis found that in 2015-16 it injected £540million into the economy of Exeter alone, helping to create more than 5,300 jobs in the city. Read More\nIn all, 10,757 jobs were generated across the South West, the report commissioned by the university and carried out by Viewforth Consulting said.\nMr Bradshaw said that the public backlash against student housing was a challenge to the university.\nHe said: “A lot of people complain to me about the amount of student accommodation going up in Exeter, apart from the fact that the city council has very little power to turn applications down and if they do and lose then that’s very costly for the council, these are private developments.\n“For many years, people have been complaining about students taking over residential areas, there are some streets like Monks Road that are going back to family ownership so there are always those pressures that you have to try and manage.” Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-06T18:55:00.000+03:00", "crawled": "2018-07-06T19:14:55.017+03:00", "highlightTitle": ""}