{"organizations": [], "uuid": "de6f73f4c96df0c58f06e7f80ae5c3d10f81fa61", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14862811.ece/ALTERNATES/s1200/Colombia-v-England-FIFA-World-Cup-2018-Round-of-16-Spartak-Stadium.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14947034", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: World Cup and Love Island help to lift ITV revenues to £1.8bn", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-25T10:10:00.000+03:00", "replies_count": 0, "uuid": "de6f73f4c96df0c58f06e7f80ae5c3d10f81fa61"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14947034", "ord_in_thread": 0, "title": "Business Breakfast LIVE: World Cup and Love Island help to lift ITV revenues to £1.8bn", "locations": [], "entities": {"persons": [{"name": "allsop", "sentiment": "none"}], "locations": [{"name": "forth banks", "sentiment": "none"}, {"name": "stephenson quarter", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "moorfield group", "sentiment": "none"}, {"name": "newcastle quayside", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Flats with views of River Tyne to be available soon\nWork is under way on a multimillion-pound scheme which will create more than 280 rental apartments overlooking the River Tyne .\nOver £30m is being been invested in The Forge, a three-phase residential project which is poised to be the first build-to-rent scheme to be completed in Newcastle at Forth Banks, on Newcastle Quayside.\nThe sizeable brownfield site is being transformed with the erection of one seven-storey and two nine-storey properties in the development, which is one of several bringing the build-to-rent sector to the North East, creating 283 purpose-built rental apartments.\nSpanning over 200,000sqft in the Stephenson Quarter, The Forge is being delivered by Moorfield Group and will comprise one, two and three-bedroom apartments boasting unrivalled facilities and amenities, man­­aged by property consultant Allsop.\nThe first of the three blocks is due to complete and be ready to move into this summer, followed by blocks two and three later this year. How a completed apartment at The Forge in Newcastle will look (Image: Paul Harmer Photography Ltd) 9.02 Coreena Ford Record numbers of workers willing to find jobs abroad, study reveals\nA record number of people would be willing to move abroad to work in the wake of Brexit, according to new research.\nA study by totaljobs found that 62% of adults were prepared to work overseas, 18% more that four years ago.\nThe survey of 6,500 workers also found that half would be open to relocating elsewhere in the UK, with London, Manchester and Edinburgh the most desirable places to live.\nThe jobs site said the number of people considering moving abroad posed a “significant threat” to the country’s pool of skilled workers.\nMike Booker of totaljobs, said:\nAcross the country workers are willing to relocate for better employment opportunities, which is a really positive message for employers looking to attract new talent.\nThe results of our survey demonstrate the fluidity of talent migration within the UK, and the current talent pool available to British bosses.\nHowever, employers need to be aware of the growing desire amongst UK workers to relocate overseas and must ensure they’re prepared to offer competitive benefits, a healthy work-life balance and skills training to ensure they attract and retain top talent. A plane takes off at sunset (Image: PA) 9.00 North East Business Executive Awards launch to find region's top business leader\nThe annual search for the North East’s top business leader has begun.\nThe official launch of The North East Business Executive Awards 2018 will see judges looking for company leaders who have drive, dynamism and integrity, as well as commercial acumen and who are playing a role to improve life in the North East.\nOne of the biggest contests in the North East business calendar, the awards are run by The Journal with our sister paper on Teesside The Gazette, and associate sponsors Brewin Dolphin. Last year the main prize was won by Steve Bagshaw, chief executive officer for Fujifilm Diosynth Biotechnologies.\nPrizes were also won by Kevin Brown of Pacifica Group Ltd, David Harrison of True Potential LLP and Phil Pallister of 0800 Repair Gas Services, with Helen McArdle taking home the lifetime achievement award and Phil Coates the prize for non-executive director of the year.\nIn addition to the top award, there are trophies for the young business person of the year, who must be aged 40 or under, non-executive director of the year and a lifetime achievement award.\nInvestment management firm Brewin Dolphin is returning as the associate sponsor of the awards, with support from Muckle LLP, Newcastle University Business School, RSM and Womble Bond Dickinson. (Image: Newcastle Chronicle) Coreena Ford Price-comparison firm could save families a packet on Florida holidays\nA Sunshine State-loving couple have launched a price comparison website to help holidaymakers hunting for tickets to Florida’s theme parks and attractions.\nPhil and Julie Randle set up www.ticketrangers.com after finding huge differences in pricing and terms for Florida’s tourist attractions while researching a holiday.\nThe pair, who got engaged at Universal Studios, have had many trips visiting the likes of the Disney parks, Universal Studios and SeaWorld.\nIt was when they were planning a return trip to Florida in 2015 that Mr Randle, an IT manager, researched ticket prices to get the best deals.\nHe found such a variety of deals that he created a spreadsheet detailing the different attractions and deals available, shared it on an online forum and received hundreds of responses.\nMrs Randle, a nursery nurse from Town End Farm who now runs the site full time, said: “We really want to help people save money for their holidays and find the deal that is best for them.” Julie and Phil Randle with their children Niall and Martha in Florida 8.47 KEY EVENT ITV launches cost-cutting drive\nITV has launched a cost-cutting drive that will see it save up to £40m by 2021 as the broadcaster continues to battle weak ad revenue growth amid an “uncertain market environment”.\nRecently hired chief executive Carolyn McCall unveiled what she called a strategy “refresh” which it said will address sector competition and ensure that ITV remains “a structurally sound business”.\nIt will involve a £60m investment in the business over the next three years that will in part help ramp up its UK and global production, and create a “direct to consumer business”.\nThe broadcaster also outlined a raft of cost cuts, with plans to target £35m to £40m in savings between 2019 and 2021, with £15m of those cost cuts set to take place next year alone.\nA spokesman for the company said it was too early to say whether job cuts would be necessary. 8.42 KEY EVENT Ryanair to axe 100 pilots and 200 cabin crew in changes to Dublin schedule\nLow-cost airline Ryanair has warned over potential job cuts for 100 pilots and more than 200 cabin crew under plans to slash its Dublin-based fleet of aircraft from 30 to around 24 for the winter.\nRyanair said it had issued 90-day notices to the pilots and cabin crew affected and will now begin consultations on redundancy.\nIt is cutting its Dublin base by 20% and instead doubling its Polish fleet to more than 10, partly as a result of recent strikes by Irish pilots, which it said had hit bookings and consumer confidence in its Irish flights. It will be offering impacted staff transfers to Poland to minimise redundancies.\nIn the light of the Dublin base cuts, Ryanair has today issued letters of 90 days protective notice to over 100 pilots and over 200 cabin crew employees, whose services may not be required from 28 Oct onwards\nRyanair’s COO Peter Bellew said:\n“We regret these base aircraft reductions at Dublin for Winter 2018, but the Board has decided to allocate more aircraft to those markets where we are enjoying strong growth (such as Poland), and this will result in some aircraft reductions and job cuts in country markets where business has weakened, or forward bookings are being damaged by rolling strikes by Irish pilots. Ryanair operates a fleet of over 450 aircraft from 87 bases across Europe. We can only do so if we continue to offer low fares, reliable flight services to our customers, and if our reputation for reliability or forward bookings is affected, then base and potential job cuts such as these at Dublin are a deeply regretted consequence”. A Ryanair plane (Image: newcastle chronicle) 8.34 KEY EVENT Vertu chairman to share firm's progress with shareholders at AGM\nGateshead motor retailer Vertu holds its AGM later today, where chairman Peter Jones will update shareholders on the firm’s progress.\nHe will announce that the group has continued to deliver profits in line with the board’s expectations, seeing 6.5% growth in the group’s like-for-like service revenues, which have been driven by high levels of retention of vehicle sales customers, growth in warranty and used vehicle preparation work and price increases to customers, reflecting increased costs.\nUsed car sales are up 13.1% against what it believes to be a static overall market, and it is also bucking the UK trend in new car sales.\nThe UK new vehicle market saw private new vehicle registrations fall by 4.4% during the six months to June 30, as the impact of currency continues to reduce the profitability of manufacturers importing vehicles into the UK, resulting in vehicle pricing pressures and reduced supply push tendencies.\nIn addition, and as expected, Vertu is experiencing longer new vehicle lead times from some manufacturers. Despite these factors, the group out-performed the market, delivering like-for-like new vehicle volume growth of 2.1%.\nIn March the group sold surplus land at Newcastle-under-Lyme for £2m, making £600,000 profit on disposal, and it also closed its loss-making Cheltenham Mazda dealership.\nAn offer on the freehold property has been accepted subject to planning permission.\nThe firm also acquired Hughes Group Holdings Limited for consideration of £21.8m in the period, and also acquired the freehold of its Newcastle Vauxhall dealership in a £7.4m deal.\nThe chairman will tell shareholders: “The Board continues to assess further acquisition opportunities, using strict investment return criteria to maintain discipline in capital allocation.” Peter Jones Coreena Ford Noel Edmonds blasts Lloyds after 'devastating' customer survey\nTV star Noel Edmonds has said Lloyds Banking Group should be “very concerned” about its reputation after a survey he commissioned found 80% of its customers want senior management to be held accountable for fraud at HBOS.\nA ComRes poll surveyed 2,006 respondents and found that 84% would back a public inquiry into whether management concealed the HBOS fraud before its takeover by Lloyds at the height of the financial crisis.\nAround 60% believed the HBOS fraud case and Lloyds’ subsequent actions have impacted their belief that Lloyds acts in the best interests of customers.\nMr Edmonds said: “This survey shows a high level of public awareness, and a high level of public distrust, and they should be very concerned.\n“And I hope that the senior management will change the way they treat the way victims of their wrongdoing.”\nThe report was commissioned by the Deal Or No Deal Star and funded by Therium, which is financially backing his litigation efforts.\nHe is planning to pursue Lloyds for around £64m in damages for losses allegedly suffered when his former business Unique Group was destroyed because of the fraud, although he has yet to lodge legal papers. Corrupt bankers from the HBOS Reading branch were jailed last year for the £245 million loans scam which destroyed several businesses, before they squandered the profits on high-end prostitutes and luxury holidays.\nA spokesman for the lender said: “Lloyds Banking Group takes trust and reputation extremely seriously. “We commission a quarterly survey of over 1,800 customers to monitor trust. The independent survey, run by Ipsos Mori, shows that 75% of our customers trust Lloyds Bank. “We are still waiting for Mr Edmonds to file his legal claim. If he does file his claim, it will be contested.” Noel Edmonds (Image: Channel 4) 8.20 KEY EVENT Fresh bid to transform eyesore Newcastle building into landmark offices scheme\nFresh attempts to transform a former Newcastle department store into modern offices are poised to go before planners.\nIn its heyday, the John Blundell and Howards store in Clayton Street West welcomed hordes of shoppers as one of the city’s traditional department stores.\nThe building has lain empty for almost 30 years, however, ever since closing to customers in the late 1980s. Several bids to bring it back to life with new uses have fallen at the first planning hurdle.\nSeveral development proposals have been put forward over the years – including an 80-bed hotel plan six years ago – and owner Trafalgar Leisure, owned by Sam Hamadi, launched renewed efforts to bring the eyesore back to life as a modern office two years ago.\nHowever, the £2m makeover plans were rejected by council who said a proposed two-storey pitched roof extension would be “overly dominant in relation to the host building and would be detrimental to the setting of the adjacent listed building and to the character and appearance of this part of the Central Conservation Area”. An appeal was made soon afterwards but dismissed last August.\nNow a renewed bid to pave the way for the old store to be turned into offices has been submitted by Trafalgar Leisure, including a revised roof design to the new extension, to ensure that it “appears subservient to the existing building that fronts Clayton Street”.\nThe design and access statement submitted on behalf of the leisure firm provides details of the works to be carried out, which will reveal a lot of the historic fabric of the building. The Blundell building in Newcastle which its owners want to transform into modern offices. 8.15 Coreena Ford Santander profits drop 18%\nBanking giant Santander has reported an 18% drop in underlying pre-tax profits to £920m for the six months to June 30, down from £1.1bn a year earlier.\nIt said half-year statutory pre-tax profits fell 15% to £903m.\nThe bank said net interest income fell 6% after being hit by lower mortgage pricing and loss of customers on standard variable rate deals. It saw net mortgage lending - gross lending less redemptions - growth of £2.3bn in the first half.\nCustomer deposits fell to £172.6bn from £174.4bn a year earlier.\nNathan Bostock, chief executive of Santander, said:\nWe have continued to deliver for our customers in a competitive market with strong net mortgage growth to UK homeowners and focused lending growth to trading businesses, driven by an emphasis on customer experience and loyalty.\nThe competitive and uncertain operating environment has resulted in profit before tax of £903 million, down 15% year-on-year.\nCost discipline is a key priority for management.\nWe are progressing with our 2018 efficiency initiatives and expect the benefits of our actions to come through in the second half of the year. A Santander high street bank 8.10 KEY EVENT World Cup and Love Island help to lift ITV revenues 8% to £1.8bn\nTV show Love Island and the screening of World Cup matches served up a boost for ITV in its half yearly figures.\nTotal advertising revenue was up by 2% to £890m with 48% growth in online revenues and ITV Family share of viewing was up 9% in the six months to June 30 2018.\nThe channel reported an 8% rise in total revenue for the period to £1.8bn while pre-tax profits for the period grew 2% to £265 million.\nITV chief executive Carolyn McCall cheered the “strong” results, noting “outstanding contributions” from Love Island and World Cup programming.\nShe said:\nI’m pleased to say that there is a really healthy pipeline of new and returning programmes.\nITV is well placed to take advantage of this opportunity though its new strategic plan. ITV will be more than TV - it will be a structurally sound integrated producer broadcaster where we aim to maintain total viewing and increase total advertising revenue; it will be a growing and profitable content business, which drives returns; and it will create value by developing and nurturing strong direct consumer relationships, where people want to spend money on a range of content and experiences with a really trusted brand.\nWe will deliver this strategy by building greater capability in data, analytics and technology as well as developing the great creative and commercial talent ITV already has. Executing the strategy will enable us to continue to deliver sustainable returns to our shareholders.\nMrs McCall also said ITV continued to drive significant audiences with returning brands such as Vera - currently filming its new series back in the North East - which had it’s most successful series to date, Endeavour, The Durrells, Good Karma Hospital, Ant & Dec’s Saturday Night Takeaway, Britain’s Got Talent and The Real Full Monty. Vera actress Brenda Blethyn at Island View (Image: The Ambler / Andrew Mounsey) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14947034;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-07-25T10:10:00.000+03:00", "crawled": "2018-07-25T12:08:45.032+03:00", "highlightTitle": ""}