{"organizations": [], "uuid": "af1e8db9107be1f33e7e73e8a61ea5ba31ba91ec", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1830077.ece/ALTERNATES/s1200/2_Delifrance.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/dlifrance-uk-doubles-capacity-croissant-1830328", "country": "GB", "domain_rank": 48128, "title": "Délifrance UK doubles capacity of croissant factory in Wigston following £4m investment - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-28T03:00:00.000+03:00", "replies_count": 0, "uuid": "af1e8db9107be1f33e7e73e8a61ea5ba31ba91ec"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/dlifrance-uk-doubles-capacity-croissant-1830328", "ord_in_thread": 0, "title": "Délifrance UK doubles capacity of croissant factory in Wigston following £4m investment - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "andrew cole", "sentiment": "none"}, {"name": "alex hannam", "sentiment": "none"}], "locations": [{"name": "wigston", "sentiment": "none"}, {"name": "délifrance uk", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "chartwell drive", "sentiment": "none"}], "organizations": [{"name": "leicestershire live délifrance uk", "sentiment": "negative"}, {"name": "invalid email délifrance uk", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Délifrance UK doubles capacity of croissant factory in Wigston following £4m investment Improved production line could lead to two dozen new jobs Share Wigston factory bakes pains au chocolat, pains aux raisins and other sweet pastries Get Business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nDélifrance UK has doubled the capacity of its continental pastry factory in Wigston following a £4 million investment.\nEnergy efficient ovens, glazing, cooling and filling machines as well as new conveyor systems have been installed at the premises in Chartwell Drive.\nThere is also a new filling line for squirting everything from chocolate and jam to cheese sauce into the finished pastries.\nThe site – which runs 24 hours a day, 364 days a year – bakes tens of thousands of French-made raw croissants, pains au chocolat, pains aux raisins and other sweet pastries each day. Délifrance UK managing director Andrew Cole at the Wigston viennoiserie factory (Image: Alex Hannam)\nThe finished products are shipped out to supermarkets, caterers and restaurants up and down the country.\nNewly promoted Délifrance UK managing director Andrew Cole said there were around 200 people on the factory floor with potential to add another couple of dozen jobs as production grows.\nThe site is also the Délifrance UK head office, accounting for another 50 or so Wigston jobs, while another 50 work in a baguette bakery next door, producing “tens of thousands of tonnes” of bread each year – again using French ingredients.\nDélifrance UK, which also has a factory in Southall, West London, has an annual turnover of 150 million euros, equal to around £133 million. Globally Délifrance makes one in 10 of all croissants sold in Europe\nIt makes up around 20 per cent of the French-based Délifrance business which has operations around the world and is responsible for one in every 10 European croissants sold each day.\nGlobal turnover is around 750 million euros.\nDélifrance has been baking in Wigston for 20 years, and this year marks the tenth anniversary of the fresh viennoiserie – croissants and pastry – line.\nFollowing the investment, Mr Cole said staff numbers will increase from 21 to 30 per shift, and up to 45 when production is at maximum capacity.\nHe said the investment showed the parent company’s commitment to post-Brexit Britain.\nHe said: “Our people make us who we are, so it’s exciting to be able to expand our team further, continue to develop their skills, and get even more talented staff creating the products our customers in Wigston and beyond know and love.” Read More\nHe said as well as being more environmentally friendly, the site has been designed to make life easier for staff with improved changing rooms, better air conditioning and a better canteen.\nThere is also a new training structure to encourage professional growth. Read More\nMr Cole said: “These changes to staff facilities and our all new training structure show that this is as much an investment in our team as it is an investment in boosting our capacity.”\nThis Wigston investment follows a global rebrand for the business.\nThe global business produces more than 1,000 bread, viennoiserie, pâtisserie and savoury products, and has 16 factories, mainly in the EU, but also in China and Thailand, supplying 100 countries. Like us on Facebook ", "external_links": [], "published": "2018-07-28T03:00:00.000+03:00", "crawled": "2018-07-28T11:02:26.006+03:00", "highlightTitle": ""}