{"organizations": [], "uuid": "2db3d8d020fdb5c4c13794cbb8b3700d33393467", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11693220.ece/ALTERNATES/s1200/JS96123389.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/greggs-launch-more-drive-thrus-14973338", "country": "GB", "domain_rank": 21960, "title": "Greggs to launch more drive-thrus as it launches new £2 pizza deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-31T15:29:00.000+03:00", "replies_count": 0, "uuid": "2db3d8d020fdb5c4c13794cbb8b3700d33393467"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/greggs-launch-more-drive-thrus-14973338", "ord_in_thread": 0, "title": "Greggs to launch more drive-thrus as it launches new £2 pizza deal", "locations": [], "entities": {"persons": [{"name": "greggs", "sentiment": "negative"}, {"name": "roger whiteside", "sentiment": "negative"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Greggs chief executive Roger Whiteside (Image: Simon Williams/Greggs/PA Wire) Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nNorth East food-on-the-go favourite Greggs is aiming to to have 2,500 shops across the UK following its £100m investment programme.\nThe sausage roll supremos, headquartered in Newcastle, now have 1,888 shops and have long publicised a target of 2,000 stores.\nAs it nears its target date of 2020 for the completion of a five-year programme to overhaul its production, manufacturing and logistic systems, chief executive Roger Whiteside said Greggs will hit its goal next year, and will then aim for its new target by seeking out new locations for shops where customers work and travel.\nHis comments came in interim results for the 26 weeks to June 30, a period in which its shop opening programme progressed well with 59 new shops opening and 25 closing.\nGreggs expects around 100 net new shops for the year as a whole, putting it on track to reach the magic number of 2,000 shops next year.\n“It shows we have confidence in the business to be able to grow to that number,” Mr Whiteside said.\n“And that’s not where we think it ends because we have built the capacity to go beyond 2,000 – that was just a nice round number we came up with five years ago when we started on this journey.\n“The growth will come from convenient access. We have mapped the UK and there’s thousands of opportunities in places like retail parks, industrial sites, business parks – areas where you wouldn’t normally put shops where are there are thousands of people who want access to food away from home, where they work or travel.”\nThe second Greggs ‘Drive-Thru’ shop opened at Ashby-de-la-Zouch, in Leicestershire, and Mr Whiteside said he expects to see “a handful more” more open each year, while its first London Underground shop in Westminster Tube station was also joined by openings in other transport locations such as Birmingham New Street station, Glasgow Buchanan bus terminal and East Midlands Airport. Read More Big rise in profits reported at Newcastle Building Society\nAn opening on the concourse at London Bridge is also expected in September.\nAs well as being number two in the UK sandwich sales, Mr Whiteside said Greggs sells more slices of pizza than anyone else in the country, and it is poised to sell even more by introducing a new £2 pizza slice plus drink offer, which will only be available after 4pm.\n“We’ve launched the pizza deal but we only do it after 4pm – we want to entice people into the shops at the time of day when we’re not usually busy and customers are responding to that and the value is terrific.”\nNew product categories alongside traditional bakery favourites saw strong growth in the half year, particularly in sales of hot drinks, breakfast, healthier choices and hot food.\nThe ‘growth categories’ now account for 30% of sales – double the sales they brought in five years ago – thanks to new additions and expansion of its popular £2 breakfast deal to include a broader offer, adding yoghurts and fruit pots. Read More Cafe Rouge closes Newcastle restaurant after six years in the city\nIn May it also launched its first vegan product, the Mexican Bean Wrap, and its autumn menu will include a number of new hot sandwich options.\nOverall, Mr Whiteside hailed the firm’s resilient performance amid challenging market conditions, with total sales up 5% to £476m and company-managed shop like-for-like sales up 1.5%.\nUnderlying operating profit was £25.7m, down on last year’s £27.6m, and Mr Whiteside said Greggs remains cautious for the future amid trading conditions affecting the whole sector and that the firm expects full year profits to be flat.\nJim Winship, director of the British Sandwich Association, has warned this week there could be serious problems with importing the fresh ingredients for sandwiches if there are severe delays at UK ports following Brexit.\nSpeaking on the BBC, he warned that a no-deal Brexit could limit the amount of choice consumers have if tomatoes, lettuces and other ingredients can’t get across borders. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-31T15:29:00.000+03:00", "crawled": "2018-07-31T16:19:29.020+03:00", "highlightTitle": ""}