{"organizations": [], "uuid": "096c060bbe24ae8c56f2c548590efc4ae436765f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14889295.ece/ALTERNATES/s1200/Ross-Davies-R-receiving-his-young-innovators-award-from-the-Princes-Trust.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastles-grown-urban-plans-turn-14889220", "country": "GB", "domain_rank": 21960, "title": "Newcastle's Grown Urban plans to turn abandoned buildings into urban farms", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-10T14:02:00.000+03:00", "replies_count": 0, "uuid": "096c060bbe24ae8c56f2c548590efc4ae436765f"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastles-grown-urban-plans-turn-14889220", "ord_in_thread": 0, "title": "Newcastle's Grown Urban plans to turn abandoned buildings into urban farms", "locations": [], "entities": {"persons": [{"name": "ross davies", "sentiment": "negative"}, {"name": "davies", "sentiment": "none"}], "locations": [{"name": "asia", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "kang kong", "sentiment": "none"}], "organizations": [{"name": "grown urban", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "newcastle's grown urban", "sentiment": "neutral"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle's Grown Urban plans to turn abandoned buildings into urban farms Ross Davies won an innovation award from the Prince's Trust for his urban farming business Share Grown Urban managing director Ross Davies (R) receiving his young innovators award from the Prince's Trust (Image: Ross Davies) Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nA young entrepreneur is searching for an abandoned building in Newcastle that he can convert into an urban farm.\nRoss Davies is planning to grow Asian vegetables and herbs in the city, in an attempt to change the flavours of food in Newcastle while reducing the distance it travels before it reaches customers’ plates.\nThe 29-year-old wants to set up a vertical farm in Newcastle and initially plans to grow a variety of water spinach called Kang Kong. The plant is not used much in the UK because the high cost to transport it to Europe means it is expensive to buy.\nBy sourcing seeds from Asia and growing them in the North East, Mr Davies plans to make the vegetable a more common feature in restaurants and homes.\nMr Davies has now been named as one of the country’s top young innovators by the Prince’s Trust, which has provided him with a grant to get Grown Urban off the ground. The organisation has provided him with £5,000 for the business and will pay him the living wage for six months. He is also looking to receive additional funding to allow him to scale up the business.\nWith £140,000 Mr Davies believes he can grow the business to the point where he can open an additional farm after a year, and a further three during the following 12 months. The expansion would target other busy urban areas, such as Leeds, Manchester, Bristol, Brighton, and Birmingham.\nHe said: “The first thing I am starting to grow is Kang Kong, which is a water spinach grown in Thailand. It has to be transported up to China, then it has to go to Amsterdam, then London, then it gets distributed from there.\n“There are thousands of miles it has to travel. It can take 20 days to get to the end consumer but I will be growing it within a 100-mile radius of where it is delivered.” Read More Developers unveil £250m plan for Newcastle Quayside urban village\nThrough his company Grown Urban, Mr Davies is hoping to find an abandoned building with a high ceiling and convert it into a vertical farm. The farm will work by growing plants on levels, meaning he will need a large room that is between six and 10 metres high.\nThe farm will be mostly automated so the crops are given the correct amount of water and nutrients, while the humid indoor environment will be perfectly suited to Asian plants.\nMr Davies is hoping to bring some life back into an abandoned building, such as an old public baths, which would have the height needed to grow his crops.\nGrown Urban’s plants will then be sold to local restaurants. He is also considering growing more traditional herbs such as basil and mint.\nMr Davies - who has a bachelors degree in biology, and a masters degree in innovation, creativity and entrepreneurship from Newcastle University - is also able to change the flavour of his plants to suit the tastes of local restaurants. By adjusting the nutrients fed to the plants he can make pepper taste more peppery or peas taste sweeter. Read More Nissan has been left 'in the dark' on Brexit and warns of slow decline\nGrown Urban is also planning to sell smaller versions of its vertical farm system to consumers and businesses. The “plant pods”, as they are currently known, will allow people to grow their own herbs with minimum effort.\n“I have an end product which is a smaller version of the vertical farm that hangs on a canvas on the wall,” added Mr Davies. “Each of the plant pods has an automated system that waters it and adds nutrients.\n“It means the plants can last 20 to 30 days on its own. Some plants will last two days before they go brown and wilt.”\nThe plant pods are currently being developed, with the company working on a prototype version. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-10T14:02:00.000+03:00", "crawled": "2018-07-10T14:31:21.006+03:00", "highlightTitle": ""}