{"organizations": [], "uuid": "d2e0642a1690a30048a39ffedfcf01a956cc8c6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14943532.ece/ALTERNATES/s1200/1_Theresa-May-Brings-Cabinet-To-The-North-East.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-tells-newcastle-workers-brexit-14943706", "country": "GB", "domain_rank": 21960, "title": "Theresa May tells Newcastle workers her Brexit plan will be 'good for the UK and good for the EU'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-23T20:39:00.000+03:00", "replies_count": 0, "uuid": "d2e0642a1690a30048a39ffedfcf01a956cc8c6f"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-tells-newcastle-workers-brexit-14943706", "ord_in_thread": 0, "title": "Theresa May tells Newcastle workers her Brexit plan will be 'good for the UK and good for the EU'", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "positive"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "positive"}, {"name": "newcastle", "sentiment": "positive"}, {"name": "the reece group", "sentiment": "none"}, {"name": "armstrong works", "sentiment": "none"}, {"name": "reece group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Theresa May tells Newcastle workers her Brexit plan will be 'good for the UK and good for the EU' The Prime Minister met employees at The Reece Group, in Newcastle, to answer questions, after a cabinet meeting in Gateshead Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nTheresa May used a visit to Newcastle to defend her Brexit plan and insist her Government was “working for all parts of the country”.\nIn a day-long visit to the North East, the Prime Minister sat in a special cabinet meeting at The Sage , in Gateshead, before visiting the Reece Group’s engineering companies at Armstrong Works, Newcastle.\nEngineers, apprentices and other employees said they had found out just a few hours before that their day would be interrupted for a conversation with the leader of the country.\nOne employee told ChronicleLive he thought the visit was “mostly PR” but that it was “nice to see her coming up here and making an effort”. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nAfter a nervous start, workers geared up to ask the PM questions which tackled subjects from education to her own hobbies.\nMost of the questions, though, focused on Brexit, and its impact on the region.\n• Maintained her controversial exit plan would be accepted both by Parliament and the EU, though she acknowledges she was “prepared” for a no-deal Brexit\n• Claimed a strong partnership would be “good for the EU and good for the UK”\n• Denied “have our cake and eat it”, saying there were “constrictive responses” from the EU\n• Claimed the country was set to make trade partnerships with the rest of the world, with “lots of interest out there” and the “special relationship” with the US was as special as ever with trade deals in the works.\nResponding to concerns over the country’s economic future, Mrs May insisted the “frictionless movement” of goods to the EU built into her deal would protect the region’s major industry. Read More Devolution latest\nOne employee asked the Prime Minister how she expected to deliver the Brexit “people had voted for” when the referendum had asked a simple yes or no question.\nReiterating that there wouldn’t be a second referendum, she said: “The question people were asked was a simple one, leave or remain, but behind that there are layers of complexity.”\nShe said the debate around the referendum had made it clear that the electorate’s priorities for Brexit were “an end to freedom of movement, end to the jurisdiction of EU court of justice, end to the feeling we were paying huge sums of money to the EU.”\nShe said voters had wanted the UK to “take back control” and set its own rules. Theresa May answers questions during a Q&A session with employees at the Armstrong Works engineering facility (Image: Getty Images Europe)\nSpeaking to the media afterwards, Mrs May was asked about Government analysis from February predicting drops in North East GDP after leaving the EU.\nShe claimed her Brexit plan would “protect jobs and livelihoods in the North East”, emphasising her hope that a “good economic relationship with the European Union ” would be maintained.\nShe said: “Particularly if you look at some industries here in the North East like the automotive industry, the integrated supply chains across the UK and other EU countries are very important to them.\n“What we’ve proposed in our plan which we put to the European Union is to protect those integrated supply chains to ensure that we develop a free trade area between the UK and the European Union ... such that the movement of both parts and products, because I recognise there are significant exports here from the North East, the movement of those products is frictionless.” Read More Theresa May announces £780 million to improve East Coast Main Line rail services\nAsked specifically about Nissan, in Sunderland, Mrs May claimed “frictionless movement” was what was important.\nThe Prime Minister also used her visit to announce £780m to improve East Coast Main Line rail services, as well as confirm £337m for Metro improvements.\nDespite the fanfare around the North of Tyne devolution deal which accompanied the visit, politicians were unable to confirm the legislation moving it forward would be laid before Parliament on Tuesday, before the summer recess.\nA debate on the detail of it will have to be tabled for after the recess, although the North of Tyne authority was meant to be created in summer 2018 - after sign off from Parliament.\nAddressing whether the deal was something for which there was true enthusiasm North of the Tyne - in the context of a little over 20% turnout for the Tees Valley mayoral election - she said: “The combined authority, the devolution deal, is important, £600m over a period of years, going in to the area to help to improve the economy of the area, provide those jobs for people for the future.”\nShe argued the move would give people more control over decisions affecting their everyday lives. Read More North of Tyne devolution won't be approved on schedule - but May 2019 election still 'on track'\nWe asked Mrs May whether a day-long visit and an announcement of rail cash was enough to convince the North East her Government would be able to tackle areas like education, where parts of the region continue to struggle.\nShe said: “I want to make sure that as a Government we’re working for all parts of the country. We’ve come here to the North East today, I’ve made this visit to the Reece Group, other cabinet colleagues have been making visits around the North more generally, looking at the advantages the Northern Powerhouse is bringing that combined focus on the issues and on the development particularly infrastructure that is needed.\n“But there are issues that need to be addressed, such as in the education arena, I’m pleased to say that in the North East 44,000 more children are in good or outstanding schools, but we do want to make sure that as we look ahead to the future, the education that young people are getting is the right education ... and I genuinely want anybody across the country, whatever their background, wherever they are from to be able to go as far as their talents and their willingness to work hard will take them.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-23T20:39:00.000+03:00", "crawled": "2018-07-24T02:22:04.006+03:00", "highlightTitle": ""}