{"organizations": [], "uuid": "c3e489762991aca03781bb19ab31b80b01f6caeb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14933118.ece/ALTERNATES/s1200/0_Matthew-Rawlings-general-manager-for-JH-Wood-Engineers.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/farming/berwick-engineering-firm-offer-extended-14932922", "country": "GB", "domain_rank": 21960, "title": "Berwick engineering firm to offer extended service to farmers during harvest", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-20T15:17:00.000+03:00", "replies_count": 0, "uuid": "c3e489762991aca03781bb19ab31b80b01f6caeb"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/farming/berwick-engineering-firm-offer-extended-14932922", "ord_in_thread": 0, "title": "Berwick engineering firm to offer extended service to farmers during harvest", "locations": [], "entities": {"persons": [{"name": "matthew rawlings", "sentiment": "none"}], "locations": [{"name": "berwick", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "berwick", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Berwick engineering firm to offer extended service to farmers during harvest JH Wood is launching an out-of-hours helpline for farmers Share Matthew Rawlings, general manager for JH Wood Engineers Share Get business updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nAn engineering firm in Berwick is extending its opening hours and is launching an out-of-hours helpline to support farmers during the harvest period.\nJH Wood Engineers has made the changes to its opening hours to support farmers across north Northumberland and the Scottish Borders.\nThe company will provide immediate help for urgent repairs, such as axle repairs, onsite welding, machine design and grain auger repairs.\nThe company is also launching an out-of-hours helpline – 07714 781 452 – which will be available for repairs and parts from July 1 to October 30.\nMatthew Rawlings, general manager for JH Wood, said: “The helpline is there to reassure farmers in that they can call to check for stock and also, of course, discuss repairs. Read More Confidence among North East farmers set to plummet on Brexit\n“We are fully aware that this is one of the most significant times of the year for so many farmers, in terms of their immediate need for repairs and engineering work, which in most instances, needs to be done at very short notice.\n“So, we have specifically expanded our offering and increased our opening times to meet this demand, and I would like to assure that we have the people, the solutions and the expertise to handle the most diverse range of engineering requests.”\nJH Wood will continue to open from Monday to Friday from 8am to 5pm, but will also open on Saturday mornings from 8am to 12pm.\nThe business stocks a range of harvest essentials including drier parts, bearings, belts and workshop consumables such as aerosols, lubricants, and discs. Read More Rural Awards celebrate the heroes of the North East countryside\nHowever, Mr Rawlings is keen to point out that farmers need to plan ahead to avoid disruption to their harvest.\nHe said: “If you possibly can, plan ahead and check that all machinery, parts and tools are in good condition. For those bearings that you know might go, and those chains that need repairing, we can order your spares in and book time for you in advance. By doing this, you will know that you are equipped and ready, even if the worst does happen.”\nJH Woods was established 75 years ago and specialises in fabrication work and precision-machined parts. It also carries out onsite repairs as well as provides replacement components for a wide range of machinery. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-20T15:17:00.000+03:00", "crawled": "2018-07-20T19:19:14.005+03:00", "highlightTitle": ""}