{"organizations": [], "uuid": "cc12cd20af872e38762b6a9fa101a62d3785a29e", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/incoming/article1754722.ece/ALTERNATES/s1200/Dartington-Estate-2.jpg", "site_section": "", "section_title": "", "url": "https://www.devonlive.com/news/devon-news/go-behind-scenes-south-devon-1754570", "country": "US", "title": "We go behind the scenes on the South Devon estate with an amazing farming history - Devon Live", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-06T03:00:00.000+03:00", "replies_count": 0, "uuid": "cc12cd20af872e38762b6a9fa101a62d3785a29e"}, "author": "Athwenna Irons", "url": "https://www.devonlive.com/news/devon-news/go-behind-scenes-south-devon-1754570", "ord_in_thread": 0, "title": "We go behind the scenes on the South Devon estate with an amazing farming history - Devon Live", "locations": [], "entities": {"persons": [{"name": "dartington", "sentiment": "none"}, {"name": "dorothy", "sentiment": "none"}, {"name": "elmhirst", "sentiment": "none"}, {"name": "leonard elmhirst", "sentiment": "none"}], "locations": [{"name": "south devon", "sentiment": "none"}, {"name": "dartington hall", "sentiment": "none"}], "organizations": [{"name": "dartington estate", "sentiment": "none"}, {"name": "dartington hall trust archive", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "We go behind the scenes on the South Devon estate with an amazing farming history Dartington dates right the way back to medieval times Share A bird's eye view over the Dartington Estate, purchased by Dorothy and Leonard Elmhirst in 1925 Share Get Daily updates directly to your inbox + Subscribe Could not subscribe, try again later Invalid Email Get daily updates pushed directly to you Subscribe to notifications See our privacy notice\nBehind every great story there are pioneers, thinkers and dreamers, whose work has not only stood the test of time but helped shape what we see and enjoy today.\nA truly captivating tale also needs enduring lead characters and this is where Dorothy and Leonard Elmhirst make their entrance, as purchasers of the neglected 14th century Dartington Estate in 1925.\nInspired by the many innovative thinkers of the time, the Elmhirst’s were pioneers and through Dorothy’s inherited wealth, exceptionally well-off. Dorothy and Leonard Elmhirst in front of Dartington Hall (Image: Dartington Hall Trust Archive)\nThey poured their resources into the “Dartington Experiment” – restoring the estate buildings and setting up a host of farming, forestry, educational and performing arts and crafts enterprises. This experiment was formalised in 1932 with the creation of The Dartington Hall Trust, which oversaw Dorothy and Leonard’s charitable work.\nFast forward to 2018 and as I soon realise from chatting to Estate Manager, John Channon and Community Resilience Manager (Food and Farming), Harriet Bell, the list of agricultural and environmental innovations born from the Elmhirst’s progressive thinking is nothing short of remarkable.\nThe 1,200-acre estate boasts a rich history of experimentation and research; one that includes setting up the first intensive poultry unit and prairie in the South West and importing the first tractor to Europe in the 1920s, launching the UK’s first artificial insemination scheme for cattle in the 1930s and carrying out exotic conifer trials in the 1940s. Read More Why this Exeter University professor is urging farmers to adapt to shopper's changing eating habits\n“The work that we are undertaking here will once again see the estate placed at the forefront of experimental land use,” says John, who joined Dartington in 2009 having previously spent over 20 years working with the National Trust as a Property Manager in Devon. “Our vision is that the whole estate, comprising its buildings, woods and farmland, will become an exemplar of diversity and rural re-generation.”\nAnd diversify it certainly has done, in a process spearheaded by the estate’s Land Use Review in 2012. At the centre of this review, which included consultation with the local community and a range of agricultural experts, was the estate’s main agricultural holding, Old Parsonage Farm. What was previously a 750-acre traditional dairy and arable farm has now been divided into a variety of separate holdings, welcoming an eclectic mix of enterprises to the land.\nThe now 480-acre Old Parsonage Farm is home to Jon and Lynne Perkin, who since taking on the tenancy in March 2015 have diversified away from traditional practices and developed a goat dairy, offering a range of products including whole milk, ice cream and kefir, a cultured milk drink. Old Parsonage Farm tenant farmer, Jon Perkin, with a selection of his Dartington Dairy products\n“Jon and Lynne’s farm is an amazing example of the diversification potential of Devon farms,” comments Harriet, “as we wouldn’t have even known to suggest goat kefir as an option in the Land Use Review. I think it just goes to show what markets can be out there that you might not currently imagine.”\nThe list of projects under way elsewhere on the estate is equally impressive, with over 150 businesses, charities and social enterprises based here. Schumacher College, established in 1991, has become a leading international centre for sustainable education, while the Huxhams Cross Biodynamic Farm is proving to be a shining example of how to weave together the practices of biodynamic food production, permaculture design and agroforestry to create a resilient and sustainable farm.\nCommunity involvement is also a big part of Dartington’s ethos, with two Community Supported Agriculture (CSA) projects and food growing schemes through gardens, allotments and orchards. In addition the charity LandWorks provides a supported route back into the community for day release prisoners from Devon prisons, by gaining work experience through outdoor, physical activity such as participation in landscaping projects, woodwork and growing a variety of fruit and vegetables. Read More Dangerous hornets make a live nest inside farmer's tractor\nAs John explains: “The point of the whole experiment here is to try and come up with ideas that are replicable. If somebody comes to us and says for example ‘we don’t know anything about agroforestry’, we are able to then explain how we’re making it work, and making it work commercially.\n“I think the issue with many of the fringe farming methods is that they are seen to be quite risky, and I think with the impending agricultural policy changes and what happens to the Basic Payment Scheme (BPS), people are going to be forced to start to look at other ways of managing land.\n“A number of farms in Devon and Cornwall will currently only be surviving because of their BPS payments. The worst scenario post-Brexit will be that it is stopped altogether, while the best seems to be that it goes more towards public goods and greening. We’ve got lots of examples of that here which we’re very happy for people to come and take a look at. The whole purpose of this is to have that variety of experiments on the estate which could be an option for people in the future.” The agroforestry field at Dartington includes 1,600 elderflower trees, 600 apples trees and 150 Sichuan pepper plants trees\nPerhaps the most striking example of how Dartington is driving a new approach to land management is the 48-acre silvoarable agroforestry field.\nInspired by Martin Crawford’s ground breaking estate-based Agroforestry Research Trust, which has promoted the combining of trees and crops as an alternative to traditional monocultures since 1992, a key aim of The Dartington Hall Trust’s Land Use Review project was a wider roll out of agroforestry across the estate.\nThe resulting innovative scheme has seen Old Parsonage Farm tenants, Jon and Lynne Perkin, team up with local partners Luscombe Drinks, Huxhams Cross Farm and Salthouse & Peppermongers in Scotland. Each partner enterprise has been licensed to plant 1,600 elderflower trees, 600 apples trees and 150 Sichuan pepper plants trees, and they will manage, process and market the crops from their own trees independently. Read More Children should take school trips to slaughterhouses, says Countryfile's Tom Heap\nThe Perkins continue to rotate their own arable crop between the rows of trees, farming ‘horizontally’ while the tree crop licensees farm it ‘vertically’ to maximise space available for crop production.\nAs Harriet explains, silvoarable agroforestry systems are recognised for their potential contribution towards improving biodiversity and ensuring that soil nutrients are better used, re-cycled and soil run-off is greatly reduced.\n“Agroforestry isn’t mentioned at all in the Government’s Health and Harmony paper,” she says. “Here in our agroforestry field we’ve gone from having one crop to five at no economic disadvantage to our tenant at all, but rather potentially an economic advantage to him in terms of his relationship with other producers, and the fact that agroforestry is evidence to increase yield overall.” More than 150 businesses, charities and social enterprises are based on the 1,200-acre Dartington Estate\nGiven Dartington’s history as a dominant force for change, this surely stands it in incredibly good stead for life outside of the European Union, and the introduction of a new domestic agricultural policy for British farming.\nThe Dartington Hall Trust was among the 44,000 respondents to the Government’s recent Health and Harmony consultation, which sought views from farmers, food producers and conservationists on proposals for future agricultural policy and the reform of direct subsidy payments currently made under the Common Agricultural Policy (CAP).\nWhile John and Harriet are largely supportive of the proposals being put forward by Defra (Department for Environment, Food and Rural Affairs) and the Environment Secretary, Michael Gove, as they explain their response to the consultation did raise a number of questions. Read More We went out with the last salmon fisherman on the River Exe - as the tradition looks set to die\nHarriet says: “A lot of our farm tenants, including our most successful and viable ones, are currently too small to qualify for any payment at all, so we would obviously like to see that addressed. They may not qualify for any payments but are as much a productive food producer in our community as some of our bigger farmers.\n“This explains why more young entrants don’t come into farming – a lot of our younger entrants go into much smaller-scale farming and horticulture, and yet they don’t see any support for that at all.”\nHigh on Harriet’s wish list for a future domestic policy is a degree of flexibility to allow farmers to be independent and deliver biodiversity gains, as well as food production. “I think one of our concerns about the ways you could interpret the Health and Harmony paper is you potentially see this split between what is considered as food production land and what you see as conservation land,” she explains. Harriet Bell, Community Resilience Manager (Food and Farming) at the Dartington Estate\n“There’s definitely been a bit of push back around farmers’ primary focus being food production. You can see a lot of examples here on the estate where the space to think more creatively about the agricultural landscape enables the delivery of greater biodiversity gains and greater food production.\n“We wouldn’t wish to see a system that doesn’t recognise the ability for farming to be highly productive and good for biodiversity at the same time. Previously a lot of the Higher Level Stewardship and Countryside Stewardship schemes have been very prescriptive, so for example one of the barriers to agroforestry historically has been that it is just not recognised as a system. It can qualify for OR5 (organic conversion – top fruit) payment if the trees are planted exactly four metres apart and the rows are exactly eight metres apart, but actually that’s not the best design and layout for this particular field. How do we create a system which is flexible enough, rather than so prescriptive it stops farmers innovating or applying their own personal knowledge to develop the appropriate landscapes for them.”\nHarriet adds: “We would argue that some of the most productive systems we see on our estate are productive not just in terms of food but in terms of social value, which is what so much of the emphasis is on within the consultation. Read More Hannah's parents speak for first time after her tragic death\n“The Permaculture view is that the most productive elements are often on the edge of farm systems, so I think you can draw a nice parallel in that a lot of the farming systems that have been on the edge of mainstream farm practice for a long time are actually demonstrably more productive, not just in terms of food but in terms of the added value the Health and Harmony paper is looking for. Therefore we’re looking for a system going forward that can deliver both the natural capital benefit and our food production.\n“Food sovereignty is still critically important and a lot of those approaches – be it agroforestry, permaculture or agroecology – demonstrably deliver all of those things in one system, rather than having farming over here and conservation over there.”\nJohn also comments: “We are very supportive of the Government’s current initiative. If you look at what we’re trying to do across the estate it resonates hugely with a lot of things in the Health and Harmony consultation – soil health, water quality and the appalling loss of biodiversity that has happened over the last few years. It seems that increasingly whereas farmers were considered to be the guardians of the landscape, there is now concern that actually farming is becoming more responsible for that continuing loss as other areas clean up their act.” John Channon, Dartington Estate Manager\nWhile 93 years may have passed since the Elmhirst’s were first enchanted by Dartington’s remarkable beauty, their pioneering vision for wholeness – alongside their appetite for creative experimentation – shows no signs of ageing and continues to demonstrate the same vigour and vibrancy.\nIt’s impossible to predict what Dorothy and Leonard would have made of Brexit, or indeed today’s modern agricultural practices, but what we can be certain of is John and Harriet’s unfaltering commitment to the task of guiding the Dartington Estate through this monumental time of transition.\nAsked to gauge their levels of excitement for the future, Harriet openly admits: “I swing 50/50. Sometimes I am really excited about it and then I get quite worried, particularly when we start talking about trade agreements. Read More Farming dynasty win battle to get third home built on site of farm\n“The first time I read the Health and Harmony paper what I took away from it was a question of ‘okay, are we saying that we’re going to produce really high quality and welfare goods for export, and then import cheap food for us to subsist on?’ I think that would be hugely detrimental to British farmers and something that we ought to try and avoid to maintain our food sovereignty.\n“The exciting bit about it is the opportunity to innovate, experiment and create a system that is best suited to us. But you do need a working landscape rather than a large playground, so that is where the balance has to come between the public goods and food production.”\nJohn concludes: “A lot of change will be required from professionals such as land agents and solicitors, in terms of being more flexible and thinking outside the box when they’re putting agreements together.\n“If somebody wants to let land, for example, there will be a template they can take off the shelf. But actually in several cases here we’ve had to come up with slightly more complicated arrangements and I think that will be necessary in order for people to try and survive, to come up with something different and that’s what we are trying to do here.” Like us on Facebook ", "external_links": [], "published": "2018-07-06T03:00:00.000+03:00", "crawled": "2018-07-06T13:28:06.030+03:00", "highlightTitle": ""}