{"organizations": [], "uuid": "20abe474965dc331749e7f6fe6fba66b9ca14154", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1534199.ece/ALTERNATES/s1200/Cox-1.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-mp-geoffrey-cox-new-1766877", "country": "GB", "title": "Devon MP Geoffrey Cox is the new Attorney General after Cabinet reshuffle", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-10T00:36:00.000+03:00", "replies_count": 0, "uuid": "20abe474965dc331749e7f6fe6fba66b9ca14154"}, "author": "Richard Booth", "url": "https://www.devonlive.com/news/devon-mp-geoffrey-cox-new-1766877", "ord_in_thread": 0, "title": "Devon MP Geoffrey Cox is the new Attorney General after Cabinet reshuffle", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "geoffrey cox", "sentiment": "none"}, {"name": "jeremy hunt", "sentiment": "none"}, {"name": "jeremy wright", "sentiment": "none"}, {"name": "mckeeva bush", "sentiment": "none"}], "locations": [{"name": "west devon", "sentiment": "none"}], "organizations": [{"name": "cabinet", "sentiment": "none"}, {"name": "caymans", "sentiment": "none"}, {"name": "nhs", "sentiment": "none"}, {"name": "invalid email devon", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Devon MP Geoffrey Cox is the new Attorney General after Cabinet reshuffle The news was confirmed by Number 10 on Monday night Share\nDevon MP Geoffrey Cox has been appointed as Attorney General to replace Jeremy Wright.\nThe news was confirmed by Number 10 on Monday night.\nThe Torridge and West Devon MP Geoffrey Cox will now attend cabinet.\n@UKPrimeMinister posted on Twitter: \"The Queen has been pleased to approve the appointment of Geoffrey_Cox QC MP as Attorney General attending Cabinet. Her Majesty has been pleased to approve that he be sworn of Her Majesty's most honourable Privy Council.\" Read More NHS stockpiling medicine ahead of Brexit\nThe MP has been in office for 13 years in total.\nIn the past the part-time barrister has acted for companies based in the Caymans - and once represented the British overseas territory’s Opposition Leader McKeeva Bush in a corruption trial over his use of a government credit card in casinos.\nOther changes tonight include Jeremy Hunt becoming the new Foreign Secretary after Boris Johnson quit the role over the government’s Brexit plans. Read More What is The Attorney General? The following is taken from www.gov.uk Responsibilities\nThe Attorney General is chief legal adviser to the Crown and has a number of independent public interest functions, as well as overseeing the Law Officers’ departments. These are: the Crown Prosecution Service Her Majesty’s Crown Prosecution Service Inspectorate the Government Legal Department\nOther responsibilities include: acting as principal legal adviser on questions of EU and international law, human rights and devolution issues referring unduly lenient sentences to the Court of Appeal bringing proceedings for contempt of court intervening in certain proceedings to protect charities dealing with questions of law arising on government Bills legal aspects of all major international and domestic litigation involving the government\nThe Attorney General also holds the separate office of Advocate General for Northern Ireland. The Advocate General for Scotland has specific responsibility for Scottish law matters.\nMatt Hancock will take over Hunt’s brief at the Department of Health, leaving behind his job as Secretary of State for Culture, Media and Sport.\nThe announcements came the day after David Davis stepped down as Brexit Minsiter. Like us on Facebook", "external_links": ["https://twitter.com/Geoffrey_Cox", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-07-10T00:36:00.000+03:00", "crawled": "2018-07-10T00:47:50.010+03:00", "highlightTitle": ""}