{"organizations": [], "uuid": "c6ddc5e2e9c2ff942d96fc01123cc24ffdcccbe2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14939149.ece/ALTERNATES/s1200/0_GWR_-NJL_060718summit_01.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/parliamentary-logjam-could-derail-north-14939135", "country": "GB", "domain_rank": 21960, "title": "Parliamentary logjam could derail North of Tyne devolution, Newcastle leader warns", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-22T18:00:00.000+03:00", "replies_count": 0, "uuid": "c6ddc5e2e9c2ff942d96fc01123cc24ffdcccbe2"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/parliamentary-logjam-could-derail-north-14939135", "ord_in_thread": 0, "title": "Parliamentary logjam could derail North of Tyne devolution, Newcastle leader warns", "locations": [], "entities": {"persons": [{"name": "north of tyne", "sentiment": "negative"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "north tyneside", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "time", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Parliamentary logjam could derail North of Tyne devolution, Newcastle leader warns Time is running out before MPs go on their summer recess to get the North East's devolution deal through parliament Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\n​The Government has two days to get North of Tyne devolution over the line or risk derailing planned mayoral elections next May.\nNewcastle, Northumberland and North Tyneside signed a landmark £600m deal in November 2017 to set up a new authority with a raft of powers.\nBut while everything has been signed off in the North East, the Government are yet to put the relevant orders before parliament and formally green-light the process. Read More Devolution D-Day: North East councils set to vote on historic split to pave way for landmark deal\nThe Commons has been consumed by dramatic late night Brexit debates in recent weeks, meaning the North East’s devolution deal hasn’t gone before MPs.\nWith Parliament breaking for summer on July 24, there is now a tiny window to squeeze legislation onto the timetable.\nChronicleLive understands discussions have taken place in the Ministry of Housing, Communities & Local Government and the orders could be laid early next week but nothing has been confirmed. Former Attorney General Jeremy Wright and Housing Secretary James Brokenshire leave Downing Street (Image: Getty Images Europe)\nDelaying the process over the summer would send the planned timetable for setting up the new authority into disarray and potentially mean the region’s first mayoral elections, slated to take place on May 2, would need to be knocked back.\nNewcastle City Council leader Nick Forbes has called on the communities minister, James Brokenshire, to find parliamentary time to pass the final law needed to kick-start the process. Read More\nHe said: “Here in the North East three councils have come together to start taking powers back from Whitehall and begin a devolution process which will see more decision about the future of our region taken in our region.\n“What we need now is Government to take the next steps and secure parliamentary approval.\n“I look forward to seeing ministers match our ambition and fulfilling the devolution deal we signed earlier this year.\n“The next few years will be a time of great uncertainty so it is even more important that we can get on with sharing a positive vision for our region, and start letting residents and businesses have a bigger say over how we support job creation.”\nTheresa May ’s cabinet will visit the North East on July 23 for a special meeting to tie in with the Greater Exhibition of the North, taking place in Newcastle and Gateshead.​ Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-22T18:00:00.000+03:00", "crawled": "2018-07-22T19:13:42.000+03:00", "highlightTitle": ""}