{"organizations": [], "uuid": "2f9cf3bff3b65a3818aee2423bc5e35b3de27a7a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14760040.ece/ALTERNATES/s1200/Breaking-News-Graphic-Live-Blog-Smaller.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-14887689", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-10T08:30:00.000+03:00", "replies_count": 0, "uuid": "2f9cf3bff3b65a3818aee2423bc5e35b3de27a7a"}, "author": "Tom Eden", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-14887689", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [{"name": "tom eden", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Northbound traffic should follow the solid black square. Southbound should follow the solid black triangle. 14:29 Katie Collings A19 closure\nThe A19 is closed in both directions between Ingleby Arncliffe and Kirklevington in North Yorkshire due to an overturned car.\nThe car had been travelling on the southbound carriageway but came to a rest on the northbound side. 14:19 Katie Collings Disruption on the A1\nAll lanes have now been opened on the A1 southbound around Seaton Burn Roundabout following an earlier issue which was reported to be a jackknifed caravan on the road. Top Story Tom Eden See inside fire-hit St Thomas More Academy\nThis is the damage caused to a North Shields school after it was hit by a fire:\nA blaze broke out in the design and technology area of St Thomas More Roman Catholic Academy in North Shields in the early hours of Tuesday.\nThe fire was contained to one room but caused extensive damage to the metal work room, wooden store and roof of the building.\nFire crews were called the school on Lynn Road at around 2am at remained on the scene for around seven hours.\nTyne and Wear Fire and Rescue Service described it as a “difficult fire”, adding: “20 firefighters, some using breathing apparatus, quickly extinguished the fire to ensure it didn’t spread and cause further damage.”\nResidents living nearby said they were woken by flashing lights and could see smoke coming from the building.\nOne woman, who wished to remain nameless, said: “There was quite a lot of smoke and flames.\n“I heard the fire engines and banging on the gate - they must’ve been trying to break the lock of the gate.\n“There were about three or four fire engines.\n“The firefighters seemed to get it under control quite quickly.”\nAnother resident said: “I wasn’t woken by the sound of sirens, it was the heavy engines running.\n“When I looked outside I saw flashing lights and they were getting the lock off the side gate and running to the hydrant.\n“I thought it must’ve been quite serious as there were four engines and some were still there in the morning.”\nNo-one was injured in the blaze and the cause is believed to be accidental. Northumbria Police Crime-fighting dogs...in shoes!\nCrime-fighting police dogs are learning to tread carefully after being fitted with specially-made shoes.\nNorthumbria Police’s Dog Section — known as K9s — play a vital role in supporting front-line policing and putting dangerous offenders behind bars.\nThe dogs are often confronted with dangerous environments or people who are prepared to attack them to evade capture.\nAfter spending more than a year training to be a fully-licenced police dog to prepare them for any situation they may be faced with, they are now being kitted out with a less-orthodox piece of uniform — custom-made shoes.\nIn their public order training this week Vinny, Oakley, Pike, Rab, Q and Quinn pulled on new kicks that have been designed to prevent their paws from being injured.\nMost of the dogs have tried them on before, but for newly-qualified PDs Quinn - alongside puppies Q and Pike - it was a first.\nHandler Hayley thought that the dogs took a while to get used to their new kit, but said:\n“We have all seen those videos where dogs have had shoes on and walked a bit funny and Quinn was no different at the beginning.\n“I don’t think he really knew what was going on but he got used to them eventually and that is really important for his development.\n“There will be times that he has to pull them on in the future so these types of training sessions are valuable to prepare him for the real thing.”\nRich Davies is a dog trainer at Northumbria Police and said that the shoes are a really valuable piece of kit for when the K9s are in a potentially-hazardous environment.\nHe said:\n“Our dog handlers are often deployed to properties where there may be hazards whether that be broken glass, needles used to take drugs or even chemicals.\n“Their paws are quite tough but they do get cut and that can be very painful for the dog and keep them off work for a few days.\n“The welfare of our police pups and K9s is very important to us and so we do try to get them trained in using the dog boots.\n“We regularly train them in how to respond in hostile environments and so this was a great opportunity to get them used to the boots again.\n“They all did a great job and Quinn in particular was fantastic considering it was the first time he had worn the fancy footwear!” Politics Tom Eden No further resignations\nTheresa May appeared to have stemmed the tide of Brexit resignations from her Government, as senior ministers rallied around the Prime Minister at the first meeting of her new Cabinet. (Image: Getty Images Europe)\nLeading Brexiteer Michael Gove left no doubt that he would not follow Boris Johnson and David Davis out of the Cabinet, declaring that he backed the Prime Minister’s plans “100%”.\nAnd International Trade Secretary Liam Fox was seen to shake his head and mouth the word “No” when reporters asked him on his way out of Cabinet whether he was about to quit.\nMrs May gathered her new team at 10 Downing Street as shockwaves continued to reverberate in Westminster following the first day since 1982 when two Cabinet ministers resigned within 24 hours.\nJeremy Hunt, appointed the new Foreign Secretary as the Prime Minister carried out a hurried reshuffle of her top team, vowed that he would be “four square” behind her in driving through her Brexit plan.\nAnd Mr Gove told ITV News he was “absolutely not” planning to resign.\nAsked whether Mrs May was in trouble following the rash of departures from her Government on Monday, the Environment Secretary replied: “No.”\nAnd he told reporters outside his London home: “I admire Boris and David very much and I’m sorry that they have left the Government, but ... I hope you have a lovely day.”\nIn a tweet clearly designed to show she was not being knocked off course, Mrs May said: “Productive Cabinet meeting this morning - looking ahead to a busy week. And sending our best wishes to @England for tomorrow!”\nAfter the early-morning Cabinet, the PM went on to a service at Westminster Abbey to mark the 100th anniversary of the RAF and was later due to join German Chancellor Angela Merkel for a summit in London on the future of the Balkans. Sunderland Tom Eden Tall ships 2018: A day-by-day guide\nIn just a few days’ time the Tall Ships will sail into Sunderland and there’s more than just the vessels themselves to see as the massive event descends on Wearside. (Image: PR)\nThe host city, which will welcome 55 sailing vessels from around the world from July 11 to July 14, is gearing up for what’s being billed as the UK’s largest free family event.\nWhile the magnificent tall ships themselves promise to be the main crowd-puller, as they gather here in full sail ahead of setting off on the first race to Esbjerg in Denmark, the event organisers are keen to ensure that there will be plenty more on offer to interest the crowds.\nWith an estimated 1.5m visitors due to descend upon Sunderland during the course of the event, the entertainment programme will feature something for all ages, from fairgrounds and markets to art workshops and exhibitions.\nSo what’s on when? Well the entertainment programme actually gets going the day before the ships themselves arrive.", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14887689;", "http://www.gazettelive.co.uk/apps", "http://www.twitter.com/tomeden11", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-07-10T08:30:00.000+03:00", "crawled": "2018-07-10T08:47:41.000+03:00", "highlightTitle": ""}