{"organizations": [], "uuid": "4fab4ebf364e0466d75dd7f7edbc01a1c08ae5fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14856707.ece/ALTERNATES/s1200/Teacher-training-applications.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/revealed-staggering-amount-teachers-north-14856510", "country": "GB", "domain_rank": 21960, "title": "Revealed: The staggering amount of teachers North East schools lost in just one year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-02T18:24:00.000+03:00", "replies_count": 0, "uuid": "4fab4ebf364e0466d75dd7f7edbc01a1c08ae5fd"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/revealed-staggering-amount-teachers-north-14856510", "ord_in_thread": 0, "title": "Revealed: The staggering amount of teachers North East schools lost in just one year", "locations": [], "entities": {"persons": [{"name": "angela rayner", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "department for education", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "A school teacher (Image: PA) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nNorth East schools are struggling to get by with 500 fewer teachers than just a year ago.\nIn Northumberland alone, the number of teachers fell by 171 in 12 months.\nThe Department for Education admitted it faced a struggle attracting people into the profession.\nA spokesperson said: “Teacher recruitment will always be challenging in a strong economy with record numbers of jobs.”\nIt follows repeated warnings that schools face a recruitment crisis because they can’t attract enough staff.\nNorth East headteachers have warned of vacancies going unfilled, and schools say they must be allowed to offer better pay.\nNew figures published by the Government show that the number of teachers in publicly-funded schools fell by 5,000 in one year. Read More The race to remain: Number of EU citizens applying to stay in North East after Brexit soars\nAngela Rayner MP, Labour’s Shadow Education Secretary, said: “These appalling statistics are a direct result of this Tory Government’s failure to give hardworking teachers the support they need.\n“Ministers have admitted that their policies have left teachers thousands of pounds worse off in real terms, yet teachers’ workloads continue to skyrocket, driving teachers out of our classrooms.\n“As vacancies continue to rise, schools will be left with no choice but spending more and more on supply agencies, which are costing schools hundreds of millions of pounds a year because of this Government’s failure to recruit the teachers we need.”\nA DfE spokesperson said: “The number of teachers in our schools remains high, with more than 450,000 in classrooms across the country.\n“An additional 32,000 trainee teachers were recruited last year, despite an extremely competitive graduate labour market which shows that teaching continues to be an attractive career.”\nEducation Secretary Damian Hinds had made recruitment his tip priority, the DfE said. Council 2016/2017 change:\nNewcastle upon Tyne 2,531 2,476 -55\nNorth Tyneside 1,939 1,846 -93\nSouth Tyneside 1,352 1,317 -35\nSunderland 2,475 2,395 -80", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-02T18:24:00.000+03:00", "crawled": "2018-07-02T21:00:36.023+03:00", "highlightTitle": ""}