{"organizations": [], "uuid": "870cf32cc5ed6ed253df336cbe554a01ae0b1e8d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14898981.ece/ALTERNATES/s1200/dONALD-tRUMP.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/donald-trump-uk-visit-live-14898859", "country": "GB", "domain_rank": 21960, "title": "Donald Trump UK visit LIVE: Protests in Newcastle for American President trip to Britain", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-12T13:37:00.000+03:00", "replies_count": 0, "uuid": "870cf32cc5ed6ed253df336cbe554a01ae0b1e8d"}, "author": "Tom Eden", "url": "https://www.chroniclelive.co.uk/news/north-east-news/donald-trump-uk-visit-live-14898859", "ord_in_thread": 0, "title": "Donald Trump UK visit LIVE: Protests in Newcastle for American President trip to Britain", "locations": [], "entities": {"persons": [{"name": "tom eden", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "tom eden trump", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "stansted airport", "sentiment": "none"}, {"name": "us", "sentiment": "none"}], "organizations": [{"name": "trump", "sentiment": "negative"}, {"name": "nato", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Trump will be with us any minute... 13:40 Tom Eden 'Trump baby' inflated ahead of visit\nHere’s the impressive ‘Trump baby’ balloon - that will be a feature of the protests - being inflated: 13:37 Tom Eden Trump branded a 'fascist' by MPs\nDonald Trump was branded a “fascist” as MPs were told the cost of policing the president’s visit would “run into the millions”.\nLabour firebrand Dennis Skinner told ministers the president’s visit would cause “mayhem” as other backbenchers raised concerns about the number of officers being seconded from their constituencies.\nThe controversial visit has prompted one of the UK’s biggest ever police operations, with thousands of officers on duty.\nDuring Mr Trump’s trip he will meet the Queen and Prime Minister Theresa May as he visits locations including Blenheim Palace, Chequers, Windsor Castle, the US ambassador’s official residence in Regent’s Park, London, and Scotland.\nMr Skinner, who is often described as “the beast of Bolsover” for his bold Commons comments, said:\n“What on earth is the Government playing at inviting this fascist Trump to come to Britain and cause all this mayhem that we’ve already heard from these benches, police from every part of the British isles.\n“The Prime Minister, does she want to hold his hand again? Is that what it’s all about? You’re making a rod for your own back.” Brexit Tom Eden Trump attacks May's Brexit plans\nUS President Donald Trump attacked Theresa May’s Brexit plans, just hours before he was due to arrive in the UK.\nHe said the British people may not get what they voted for. It follows last week’s Cabinet summit at Chequers, where Mrs May and her senior Ministers agreed plans for a “free trade zone” with the EU.\nSpeaking at a NATO summit in Brussels on this (Thursday) morning, Mr Trump said:\n“I’ve been reading a lot about Brexit over the last couple of days and it seems to be turning a little bit differently, where they are getting at least partially involved back with the European Union.”\n“The people voted to break it up. So I would imagine that’s what they’ll do, but maybe they’re taking a little bit of a different toute.\n“So I don’t know if that’s what they voted for.”\nThe US President, who arrives in the UK later today, also told reporters that he wasn’t concerned about planned protests against his visit, and insisted he was popular in the country.\nHe said: “I think it’s fine. I think they like me a lot in the UK. I think they agree with me on immigration.\n“I’m very strong on immigration.”\nApparently referring to comments he made to fellow NATO leaders, he added: “I made a point today. I said, you’ve got to stop, You’re ruining your . . . you’re going to have a lot of problems”.\nThe Government’s Brexit plans outline how the UK can continue frictionless cross-border trade with the EU in goods while setting its own tariffs for dealings with the rest of the world.\nThe proposals, hammered out at a summit of ministers at the Prime Minister’s country residence, Chequers, last Friday, have already caused outrage among many Leave supporters, and triggered the resignations of former Brexit secretary, David Davis, and ex-foreign secretary Boris Johnson, from the Cabinet.\nBut the new Brexit Secretary, Dominic Raab, has warned “carping” critics to come up with a credible alternative if they reject the exit blueprint.\nWarning that it is time to “crack on” with the exit process, he said the Chequers plan was a “credible” proposal.\n“It’s bold, it’s ambitious but it’s also pragmatic,” he told BBC Radio 4’s Today programme.\n“For those that are either criticising or carping or whatever else, they need to come back with credible alternatives.”\nForeign Secretary Jeremy Hunt, attending the Nato summit in Brussels, acknowledged that the White Paper would be the subject of “fierce discussion”.\n“You are going to have very, very lively debates in a situation like this,” he said. 13:07 Tom Eden 'Media circus' awaiting Trump's touchdown\nThere are plenty of reporters and photographer at Stansted Airport, where the US president and First Lady will be landing shortly.\nIt was believed the president would be late after calling an impromptu press conference at NATO - but people have begun reporting that Air Force One have been seen overhead. 12:42 Tom Eden Trump responds to UK protests\nDonald Trump has brushed aside news that there will be mass protests against him as he visits the UK later today. (Image: Pool Getty Images)\nAt a press conference following the NATO summit in Brussels he was asked by a reporter what he thought of the protests building up ahead of his visit.\nHe responded:\n“It’s fine, they like me a lot in the UK - They agree with me on immigration.\n“I made a point today you’ve got to stop you’re gonna have a lot of problems.\n“You see what’s going on around the world because of immigration.\n“I won the election because of my strong immigration policies.\n“I think that a lot of the people in the uk - i think that’s what happened with Brexit.\n“I said (during my Europe trip) I’m going to a few hot spots - NATO, the UK and putin - and i think Putin will be the easiest.\n“I know there’s a lot of resignation in the UK - I will say immigration is a very important thing.\n“I told them today the EU better be very careful because immigration is taking over.” 12:35 Tom Eden Trump claims he is a 'very stable genius' (again)\nDonald Trump has once again proclaimed himself to be a “very stable genius” during his impromptu press conference at the NATO summit.\nHe first made that declaration in January while defending himself against allegations he was unfit to be US president after publication of the book, Fire And Fury: Inside The Trump White House.\nAfter the damning expose of his early days in office, he also went on to claim his two greatest assets are “mental stability and being, like, really smart”. During a press conference in Brussels on Thursday following a Nato summit, Mr Trump was asked whether he would go on to change his mind and scrap the funding agreement in a tweet.\n“No, that’s other people that do that,” he replied. “I’m very consistent. I’m a very stable genius.” 12:29 Tom Eden Sunderland academic talks Trump\nAs President Donald Trump arrives in the UK, Dr Kevin Yuill, an expert in American Studies at the University of Sunderland, gives his views on everything from the ‘Trump Baby’ to Brexit under Donald.\nDuring his two-day working-visit to the country, President Trump will spend time with the Queen and Prime Minister before flying to Scotland to spend the weekend at his golf resort.\nIt is his first visit to Britain since winning the 2016 presidential election and planned protests across the UK are expected to see thousands take to the streets.\nHere Dr Yuill outlines his views on some of the topics likely to creep up during the controversial visit: The Flying Trump Baby\nLondon Mayor Sadiq Khan has allowed the “angry Trump baby”, a blimp of a caricature of Trump – orange, with tiny hands and in a nappy - to fly above the capital.\nSome have objected that it is disrespectful to the leader of the free world and endangers the famed ‘Special Relationship’ between the UK and the USA.\nOthers reply that it is a demonstration of free speech we allegedly enjoy in the UK. I say “allegedly” because it is difficult to imagine that a caricature of Obama would, well, sail through with no trouble.\nThe notoriously thin-skinned Trump has yet to mention the blimp. Brexit\nUnlike Obama, who advised people of the UK to vote remain in the EU referendum - one of the great charms of this nation is that it characteristically stuck two fingers up to the great and the good who offered helpful advice on how to vote - Trump said that Brexit was “a good thing” in 2016 and has made approving noises since then.\nBoris Johnson, in a leaked memo, thought that Trump would do a better job of negotiating Brexit: “Imagine Trump doing Brexit,” he said. “There’d be all sorts of breakdowns, all sorts of chaos. Everyone would think he’d gone mad. But actually you might get somewhere. It’s a very, very good thought.”\nGo in hard, I suspect Trump would say. Never negotiate from a position of weakness. Boris Johnson\nPerhaps because of an affinity based on similarly bizarre hairstyles, President Trump positively simpered when he said: “Boris Johnson is a friend of mine, he’s been very, very nice to me, very supportive. And I maybe will speak to him when I get over there. I like Boris Johnson, I’ve always liked him”.\nYet, Trump is anything but predictable. Who knows which female politician might take his eye if he can see beyond Boris’s blond haystack? One female politician who, after upbraiding Trump on several bizarre tweets about Britain, is unlikely to be on the favourite list: Theresa May. Record to date\nOn a more serious note, it is possible to overlook Trump’s achievements because of some of the ridiculous statements he makes.\nFor me, his biggest and best move so far was the appointment of Neil Gorsuch to succeed the late Antonin Scalia on the Supreme Court.\nIt is also too soon to know what his overtures to Kim Jong-Un will bring.\nHowever, Trump might well list his tax cuts or withdrawal from the Paris climate deal as his own personal achievements.\nHe might also list deregulation or the survival of his travel ban on Muslim countries or even the recognition of Jerusalem. It would be interesting to know what it was. World security\nSo, who is the biggest threat to world security right now?\nActually, it is probably Trump himself, but he isn’t going to say so. It is doubtful that he would publically label Putin a major threat. Trump’s least favourite leader used to be Kim Jong-Un but since their love-in earlier this year, the acrimony is fading.\nAt the moment, it is undoubtedly doe-eyed Canadian Prime Minister Justin Trudeau.\nLast month, the US and its longtime allies Europe and Canada stood on the brink of a trade war after Mr Trump threatened to impose harsh duties on steel and aluminium. Donald Trump visit Tom Eden Police's sleeping conditions 'not acceptable'\nPolice securing Donald Trump’s visit to the UK are being forced to sleep in unacceptable conditions worse than cells, the organisation representing rank-and-file officers has said. (Image: PA)\nPictures show cramped lines of camp beds filling a vast gymnasium and sleeping mats on the floor of a squash court for officers to rest on between long shifts policing the US President’s trip, starting on Thursday.\nThe Police Federation has complained of the conditions its members are facing during the operation, which will see officers from across the country enlisted at a cost of up to £10 million.\nSimon Kempton, the organisation’s deputy treasurer in England and Wales, said 300 officers are expected to sleep in the gymnasium with no hot water and restricted access to warm food.\nHe said:\n“These officers have been asked to leave their families to travel to another part of the country to help protect the public and the president and all they expect in return is to be treated with some dignity and respect.\n“What’s clear is that anyone overnight who has been arrested by the police would be put in accommodation far superior to what the officers are staying in.”\nHe said officers at that site are only averaging three to four hours’ sleep ahead of 15-hour shifts because of the conditions.\nJohn Apter, chairman of the Hampshire Police Federation, said: “There’s so much pressure on officers at the moment. Many are having rest days cancelled, working extended hours and this on top of it; do the bosses really care?\n“It hits morale. It’s tough at the moment, really tough and they don’t deserve this - it’s not right and it’s not acceptable.”\nThe controversial president’s visit has prompted one of the UK’s biggest ever police operations, with thousands of officers on duty. 12:20 Tom Eden May hoping Trump doesn't ignore Russia's actions\nTheresa May has warned Donald Trump not to ignore the “malign behaviour” of Russia when he meets President Vladimir Putin in Helsinki. (Image: AP)\nDowning Street insisted the Prime Minister welcomed Mr Trump’s decision to “engage” with the Russian leader in the Finnish capital on Monday.\nHowever No 10 also made clear that she expected him to raise issues like the Salisbury nerve agent attack on former spy Sergei Skripal and his daughter, Yulia .\nOfficials said she made her position clear at the working dinner on Wednesday at the Nato summit in Brussels.\nIn remarks released by her office, she said that when it came to dealing with Russia, it was essential to do so from a position of strength underpinned by alliance unity.\nShe said:\n“As we engage Russia we must do so from a position of unity and strength, holding out hope for a better future, but also clear and unwavering on where Russia needs to change its behaviour for this to become a reality.\n“And, as long as Russia persists in its efforts to undermine our interests and values, we must continue to deter and counter them.”\nMr Trump’s decision to meet Mr Putin was widely seen as a blow to her attempts to isolate Russia following the Salisbury incident in March.Her comments now are likely to be seen as an attempt to to deal with a difficult issue ahead of Mr Trump’s first visit to the UK as president starting Thursday.Stressing the importance of Western unity, she said it was essential for allies to work together “to raise the cost of malign behaviour whenever it occurs”.She highlighted the attack on the Skripals as an example of “a well-established pattern of Russian behaviour to undermine our democracies and damage our interests around the world”.\nShe said:\n“In recent years we’ve seen Russia stepping up its arms sales to Iran; shielding the Syrian regime’s appalling use of chemical weapons; launching cyber-attacks that have caused huge economic damage; and spreading malicious and fake news stories on an industrial scale\n“Our long term objective remains a constructive relationship with Moscow.\n“If we are to be successful in this we must keep engaging individually and as an alliance.\n“That is why I welcome President Trump’s forthcoming meeting with President Putin, open channels of communication between the US and Russia are key to managing the risks of confrontation.” 12:12 KEY EVENT 'Trump Not Welcome Banner' to be unfurled in Durham\nA union is to unveil a ‘Trump not Welcome Banner’ on the eve of the Durham Miners’ Gala .\nUnite, the UK’s largest union, has organised the banner in a show of solidarity with the demonstrations taking place simultaneously in London and other cities, including Newcastle, against the US President’s visit to the UK.\nIt will be unfurled at Durham Miners’ Association, The Miners’ Hall, on Friday afternoon. US President Donald Trump (inset) and the Durham Miners' Gala (main pic)\nUnite regional secretary for North East, Yorkshire and Humberside Karen Reay said the banner demonstrates that those attending the gala are in complete solidarity with the anti-Trump protests.\nShe added:\n“The Durham Miners’ Gala is when workers and trade unionists from across the UK gather together in camaraderie.\n“Donald Trump’s politics of intolerance, divide and division have no place in the UK and are totally rejected by workers and trade unionists.”\nThe unveiling of the banner is being supported by the Durham Miners’ Associations, the Fire Brigades Union (FBU), University and College Union (UCU), Communication Workers Union (CWU), the GMB, National Education Union (NEU), Transport and Salaried Staff Association (TSSA), train drivers union Aslef and public services union Unison.\nThe Durham Miners’ Association secretary Alan Cummings said:\n“It is important that Donald Trump and his entourage understand that throughout the length and breadth of the UK workers are opposed to his politics and his policies of intolerance.” 12:09 Trump says Brits like him a lot\nDonald Trump reckons people in the UK like him a lot:\nOkay then. KEY EVENT What will Trump's trip involve?\nAs part of the visit, Mrs Trump will meet veterans and schoolchildren in London on Friday, accompanied by the PM’s husband Philip May. (Image: PA)\nMr Trump is believed to be spending the weekend playing golf at his Turnberry resort in South Ayrshire, which he bought in 2014, although there has been no official confirmation of his plans.\nThe US president used the Nato summit to launch fierce attack on Germany, saying it was “totally controlled” by Russia, as he ratcheted up demands for Nato allies to pay more for their collective defence.\nThe menu for the dinner at Blenheim Palace includes Scottish salmon, English Hereford beef filet and vegetables, and strawberries and clotted cream ice cream.\nWhile a working lunch at Chequers will consist of Dover sole, Chiltern lamb and vegetables, and lemon meringue pie. 11:59 Theresa May's message to Trump\nAhead of Mr Trump’s visit, the PM said:\n“Our trade and investment relationship is unrivalled, we are the largest investors in each other’s economies and every day a million British people go to work for US companies in the UK and a million Americans go to work for UK companies in the US.\n“This week we have an opportunity to deepen this unique trading relationship and begin discussions about how we will forge a strengthened, ambitious and future-proof trade partnership.\n“As two nations, we are safer, more prosperous and more creative when we work together and I am looking forward to this week’s important discussions.” (Image: AP) KEY EVENT Protests to greet Trump's UK visit\nUS president Donald Trump is set to touch down in Britain for a highly controversial visit after sparking a new firestorm on the international stage.\nFresh from a fierce row with American allies at a Nato summit, Mr Trump begins a four day trip to the UK that is expected to leave taxpayers with a police and security bill of up to £10 million.\nTheresa May will host Mr Trump, and his wife Melania, at a lavish dinner at Blenheim Palace on Thursday evening, just days after the US president said the UK was in “turmoil” following the Cabinet resignations triggered by the Prime Minister’s Brexit plans.\nAfter spending the night at the US ambassador’s official residence in Regent’s Park, London, Mr Trump will join the PM at a military base on Friday to observe a joint counter-terrorism exercise involving UK and US special forces.\nThe two leaders will hold talks at the Prime Minister’s country residence of Chequers where Russia, Brexit and the Middle East will top the agenda.\nMr Trump will then travel to Windsor Castle to meet the Queen before heading to Scotland for a private part of the four-day visit, ahead of travelling to Helsinki for a summit with Russian president Vladimir Putin.\nOpponents have threatened mass protests against the visit, but Mr Trump is expected to avoid areas such as central London where demonstrators could gather.\nMrs May will be seeking to improve her often publicly strained relationship with he US president as she pushes for a post-Brexit trade deal with America.\nMr Trump raised eyebrows when he went out of his way to praise Boris Johnson after resigning as foreign secretary, while insisting it was up to the British people whether Mrs May remained in office or not.\nThe US president also suggested his summit with the Russian president could prove to be the easiest part of his European tour compared with the Nato meeting and UK visit.\nAnd tension could be sparked as Mrs May expects the US president to remember the “malign behaviour” of Russia when he meets Mr Putin.\nDowning Street made it clear that Mrs May wants the US leader to raise issues such as the Salisbury nerve agent attack on former spy Sergei Skripal and his daughter Yulia at the meeting. More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14898859;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-07-12T13:37:00.000+03:00", "crawled": "2018-07-12T15:33:18.024+03:00", "highlightTitle": ""}