{"organizations": [], "uuid": "81402121ffd75bfe552f241530558cfdffaf9a66", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14619352.ece/ALTERNATES/s1200/President-Trump-Attends-National-Day-Of-Prayer-Event-In-The-Rose-Garden.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/news-opinion/theresa-rolling-out-red-carpet-14878633", "country": "GB", "domain_rank": 21960, "title": "Why Theresa May is rolling out the red carpet for Donald Trump", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-08T07:00:00.000+03:00", "replies_count": 0, "uuid": "81402121ffd75bfe552f241530558cfdffaf9a66"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/news-opinion/theresa-rolling-out-red-carpet-14878633", "ord_in_thread": 0, "title": "Why Theresa May is rolling out the red carpet for Donald Trump", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "negative"}, {"name": "sadiq khan", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "us", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "north america", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Why Theresa May is rolling out the red carpet for Donald Trump There will be protests when the US President visits the UK, but he doesn't care Share President Donald Trump (Image: Getty Images North America) Share Get daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nDonald Trump arrives in the UK on Thursday and he’ll be made very welcome by the Queen and Theresa May - but not by everyone.\nA major demonstration is planned in London for Friday. And smaller demonstrations are expected in other parts of the country.\nThe US President won’t be going anywhere near the protestors, of course.\nBut he might still be aware something is up, after London mayor Sadiq Khan agreed to allow a six-meter balloon in the shape of a baby Trump wearing a nappy to fly over Westminster.\nIt will fly 30m high on Friday morning. Mr Trump is staying overnight at the residence of the US ambassador in London’s Regent’s Park on Thursday night, so there’s a chance he may see it as he gets in his car on Friday morning and heads off to meet the Prime Minister.\nWill he care? Probably not.\nAfter all, he’s getting the full red carpet treatment.\nThere’s a black tie dinner at Blenheim Palace, a grand country house and birthplace of Winston Churchill, on Thursday night.\nOn Friday there’s a summit with the Prime Minister at her country house, Chequers, before he heads off to Windsor Castle to meet the Queen.\nThe First Lady, Melania Trump, gets her own series of visits - accompanied by Philip May, the Prime Minister’s husband.\nAnd Mr Trump even gets to head off to Scotland, to play golf. Read More Theresa May urged to take on Donald Trump when he visits the UK - with protests planned\nNow, this might be considered a bit cheeky. Because he will, of course, be playing on one of the two golf courses he owns in Scotland (in fact, he may pay a visit to both of them - the details haven’t all been released).\nSo the trip doubles as a chance to promote the Trump brand, which is nothing to do with his role as US President.\nPolice officers from England have been drafted in to help their Scottish colleagues and ensure the President is kept safe while he practices his swing.\nNot everyone will join the protests.\nA London pub is being renamed The Trump Arms, in honour of the President’s visit.\nIt’s just one example, but there are many people who feel it’s right to welcome the US President.\nAnd Theresa May is one of them. Read More Nursery schools fear they'll be forced to close if they don't get Government funding\nWhy? Well, consider what’s going to be on the agenda when they meet.\nThere are two main issues. One is defence, and how the UK and US can continue working closely together.\nThe second is trade, and what sort of trade deal might be possible after Brexit.\nThose are issues where the UK can only benefit from having a good relationship with the US - whoever the President is. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-07-08T07:00:00.000+03:00", "crawled": "2018-07-08T09:25:54.035+03:00", "highlightTitle": ""}