{"organizations": [], "uuid": "485e4d3d9626cd6e8996f1e9c4b7fcaeb10d3381", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1815077.ece/ALTERNATES/s1200/120720_-_Steve-Greenwell-PF-1002JPG.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/qdos-founder-steve-greenwell-sunday-1815089", "country": "GB", "domain_rank": 48128, "title": "QDOS founder Steve Greenwell on why Sunday Times ranked his firm one of the best in Britain", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-24T14:00:00.000+03:00", "replies_count": 0, "uuid": "485e4d3d9626cd6e8996f1e9c4b7fcaeb10d3381"}, "author": "leicestermercury", "url": "https://www.leicestermercury.co.uk/news/business/qdos-founder-steve-greenwell-sunday-1815089", "ord_in_thread": 0, "title": "QDOS founder Steve Greenwell on why Sunday Times ranked his firm one of the best in Britain", "locations": [], "entities": {"persons": [{"name": "steve greenwell", "sentiment": "negative"}, {"name": "justine halifax", "sentiment": "none"}, {"name": "peter fothergill", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "troon way business centre", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "qdos", "sentiment": "negative"}, {"name": "sunday times", "sentiment": "negative"}, {"name": "britain news qdos", "sentiment": "negative"}, {"name": "qdos group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News QDOS founder Steve Greenwell on why Sunday Times ranked his firm one of the best in Britain “I’m not sure why we had a referendum when people didn’t know what they were voting for\" Share Steve Greenwell, Chairman of the Qdos Group, at Troon Way Business Centre (Image: Peter Fothergill) Share Get Business Thank you for subscribing!\nJustine Halifax meets the chairman of one of the fastest-growing businesses in Leicestershire and hears his strong views on Brexit....\nQdos Group in Leicester has certainly got a lot to boast about. It was recently picked out as the company with the highest profit margin in the UK on the prestigious Sunday Times BDO Profit Track 100 league table.\nOn top of that, the Thurmaston insurance and business support specialist – which has big overseas expansion plans – was 55th in the same national list for profits growth, having seen a 70 per cent rise in profits over three years.\nIn fact it was the only insurance provider to appear in the list.\nThe Leicestershire business has more than doubled in size in the last six years to report a most recent turnover of £27.5 million, with £7.1 million of profits.\nAnd that’s not all.\nFor a second consecutive year, the group was recognised in the London Stock Exchange Group’s 2017 list of 1,000 companies to inspire Britain and won a Queen’s Award for Innovation in the same year.\nSo, how has it achieved such phenomenal success in such a short space of time?\nAnd what’s next in the pipeline for the group which provides services across insurance, accounting, tax consulting, HR, health and safety consulting and legal specialisms? Qdos Group chaiirman Steve Greenwell with board members (Image: Qdos Group)\nAccording to company founder Steve Greenwell, its success has come from being innovative and by heavily investing “multiple millions” in technology.\nThis has served to make the business more efficient – with much quicker systems for clients than similar providers, he said – and more profitable.\nAnd, when it comes to the next steps the group, whose clients include the British Chambers of Commerce, is set to undergo a rebrand as it continues to invest and expand, moving into “virgin” overseas territories as it goes.\nFollowing the recent “strategic sale” of one of its nine businesses, Qdos Contractor, to insurance firm Tokio Marine HCC, the company is rebranding as “Vantage” – a name it already uses in some of its younger businesses.\nSteve will continue to lead the eight remaining companies, which he revealed should deliver a £15 million turnover in the next 12 months, growing to £25 million in three years – with an expected 30 per cent profit margin.\nLeicester-born Steve previously worked for Coopers Deloitte in Nottingham, and for HMRC across Leicester, before going it alone.\nNow aged 60, he founded the Qdos Group in 1990 and became group chairman in 2013, when there was a management buyout of the business.\nSteve said: “In 2013 we had the opportunity for a new investor to come on board.\n“That led to the creation of a four-year plan that culminated in 2017.\n“So, last year’s achievements came about on the back of the hard work done in those four years as we changed what we did as a business, which back then was a little bit more long-winded and more traditional.\n“In 2013 the shareholders weren’t so focused on technology and were more traditional.\n\"So, we took the buyout opportunity to revolutionise the business to be very efficient and more profitable.\n“Digital marketing is now very much a part of how we get new business and we have a lot of bespoke IT systems through which we can generate leads.” Qdos chairman Steve Greenwell pictured with Andrew and Ashwell director Malcolm Grayson when the business acquired new premises in Thurmaston (Image: Publicity Picture)\nThe cricket fan, whose wife, son, 33, and daughter, 31, are all group directors, added: “Without sounding too confident, we never thought the four-year plan wasn’t going to work, we expected it to achieve its aim.\n“We made significant investment of £3-4 million in the last four years, in technology and digital marketing changes – so would have been extremely disappointed if it hadn’t paid off.\n“We’re proud that despite going through difficult times, like the recession, and now facing the years of Brexit, we’ve still managed to grow a business at a rapid rate.”\nAs part of the sale of Qdos Contractor there will be a restructure of the remaining firms, but no jobs will be lost.\nAnyone not moving with the sold business will remain in Thurmaston.\nThere are 110 staff employed in Leicester – 90 per cent of the total employed by the business – and, as it expands, the group plans to continue its policy of hiring “young, ambitious, entrepreneurial, local talent to help drive innovation and promote growth”.\nHe said: “We’re extremely excited about the businesses left in the group.\n“With our consultancy business we’ve launched new products with key clients, and this is an area we’re looking to significantly develop.\n“Two and a half years ago we set up one of our Vantage-branded companies, which sells fee protection insurance to accountants, and during that time we have become the third or fourth supplier of that service in the UK.\n“We’ve put a lot of time and effort into growth and we’re now starting to come out on the other side of that and see the results.\n“So, in the next three or four years we expect that to continue to do really well. Read More\n“We’re also now selling into Europe, which is a virgin area for us, and have a dozen clients in Belgium.\n“And our accountancy business is also focusing on developing its solutions.\n“We’re excited about the growth opportunity of our remaining businesses and we think will hit £15 million, excluding the contracting business when that goes, in the next 12 months.\n“In the next two years we think that will be closer to £20 million and we’ll push for £25 million the year after, so we expect to see rapid growth in the coming years also and we expect a 30 per cent profit margin from that.\n“I’m looking forward to working with the great team we have in place to take the business to the next level.”\nWith the firm expanding further into Europe, what were his concerns over Brexit?\nSteve – who confirmed the firm’s headquarters would stay in Leicester as it was a great place to do business, had great transport links, a diverse employment pool and cheap office space rates – said: “I voted to remain.\n“I can’t see why we would want to change something that was working effectively.\n“I’m not sure why we had a referendum when people didn’t know what they were voting for and I still can’t see why we’re still going through with it. Read More Barratt Developments expects record profits as average selling price up £14,000 to £289k\n“So far, touch wood, we haven’t noticed any adverse effect from a business perspective and don’t anticipate any – we’re very much focused on British jobs with our UK businesses.\n“But we’ll just need to look at what changes with registry as we currently have passports to sell regulated products in Europe.\n“We haven’t currently got an office in Belgium, but we’ve made provision for that in case.\n“From a UK perspective I do have concerns about Brexit. Read More Oscar-winning lens company Cooke Optics sold\n“I don’t know whether, or not, the effects on jobs internally in the UK could be catastrophic with companies potentially pulling out of the UK.\n“But I think we should probably be encouraging the Government to give lower corporation taxes to companies in the UK, and the likes of coffee shops should give us greater revenues rather than peanuts.\n“Although I don’t anticipate the business will have problems it’s about keeping your head in the game and having a solution in place if we do.”\nThere are 110 staff employed in Leicester – 90 per cent of the total employed by the business – and, as it expands, the group plans to continue its policy of hiring “young, ambitious, entrepreneurial, local talent to help drive innovation and promote growth”.\nHe said: “We’re extremely excited about the businesses left in the group.\n“With our consultancy business we’ve launched new products with key clients, and this is an area we’re looking to significantly develop.\n“Two and a half years ago we set up one of our Vantage-branded companies, which sells fee protection insurance to accountants, and during that time we have become the third or fourth supplier of that service in the UK.\n“We’ve put a lot of time and effort into growth and we’re now starting to come out on the other side of that and see the results.\n\"So, in the next three or four years we expect that to continue to do really well.\n“We’re also now selling into Europe, which is a virgin area for us, and have a dozen clients in Belgium.\n“And our accountancy business is also focusing on developing its solutions.\n“We’re excited about the growth opportunity of our remaining businesses and we think we will hit £15 million, excluding the contracting business when that goes, in the next 12 months.\n“In the next two years we think that will be closer to £20 million and we’ll push for £25 million the year after, so we expect to see rapid growth in the coming years also and we expect a 30 per cent profit margin from that.\n“I’m looking forward to working with the great team we have in place to take the business to the next level.”\nSteve confirmed the firm’s headquarters would stay on the outskirts of Leicester as it was a great place to do business, had great transport links, a diverse employment pool and cheap office space rates. Read More Dunelm sales hit new milestone\nBut with the firm expanding further into Europe, what are his concerns over Brexit?\nSteve said: “I voted to remain. I can’t see why we would want to change something that was working effectively.\n“I’m not sure why we had a referendum when people didn’t know what they were voting for – and I still can’t see why we’re still going to go through with it.\n\"So far, touch wood, we haven’t noticed any adverse effect from a business perspective and don’t anticipate any – we’re very much focused on British jobs with our UK businesses.\n“But we’ll just need to look at what changes as we currently have passports to sell regulated products in Europe.\n“We haven’t currently got an office in Belgium, but we’ve made provision for that in case.\n“From a UK perspective I do have concerns about Brexit.\n“I don’t know whether, or not, the effects on jobs internally in the UK could be catastrophic with companies potentially pulling out of the UK.\n“But I think we should probably be encouraging the Government to give lower corporation taxes to companies in the UK, and the likes of coffee shops should give us greater revenues rather than peanuts.\n“Although I don’t anticipate the business will have problems it’s about keeping your head in the game and having a solution in place just in case.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}"], "published": "2018-07-24T14:00:00.000+03:00", "crawled": "2018-07-24T14:24:53.059+03:00", "highlightTitle": ""}