{"organizations": [], "uuid": "35d5080630aa66d22997d2f669031182fa56f3d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1759657.ece/ALTERNATES/s1200/Harry-Maguire-lines-up-with-his-England-team-mates-before-the-Sweden-match.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/leicester-news/why-england-croatia-world-cup-1767280", "country": "GB", "domain_rank": 48128, "title": "Why England's World Cup team symbolises our modern national identity - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.034, "site_type": "news", "published": "2018-07-11T03:00:00.000+03:00", "replies_count": 0, "uuid": "35d5080630aa66d22997d2f669031182fa56f3d3"}, "author": "Jacob Jarvis", "url": "https://www.leicestermercury.co.uk/news/leicester-news/why-england-croatia-world-cup-1767280", "ord_in_thread": 0, "title": "Why England's World Cup team symbolises our modern national identity - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "harry maguire", "sentiment": "none"}, {"name": "john williams", "sentiment": "none"}], "locations": [{"name": "leicestershire live why england", "sentiment": "none"}, {"name": "england", "sentiment": "none"}], "organizations": [{"name": "three lions", "sentiment": "negative"}, {"name": "university of leicester", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Why England's World Cup team symbolises our modern national identity Three Lions have given us 'reason to celebrate in uncertain times' Share Harry Maguire lines up with his England team-mates before the Sweden match. Share Get Daily updates directly to your inbox + Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nThe country's World Cup squad \"symbolises a modern English identity\" in a tournament which has given the nation a lift in uncertain times, according to an expert on football's links to society.\nJohn Williams, an academic and associate professor at the University of Leicester , shared with Leicestershire Live his take on the tournament and its impact thus far on the city, and the country.\nHe said: \"It [ the World Cup ] has given people a lift, a powerful celebratory focus.\n\"We are a little uncertain about our national future - Brexit and so on - so here is very positive idea about who we are. The England team symbolises a modern English national identity: a multi-racial English team that works hard for each other, generally has the right attitudes, and plays in a sporting way. Read More A fan's view of Russia 2018: The best World Cup ever\n\"This, and the behaviour of our fans, is adding to a sense that we have matured as a football nation and as a people.\n\"I think there is real national pride in how England has done so far. This is quite unusual in major finals - back to the positive vibe of 1996.\"\nAs have many other supporters, John likened the situation in Russia and England's success to Leicester City's triumphant Premier League season two years ago. Could this be 2016 again?\nHe said: \"Here in Leicester , local people are beginning to get that 'Could this be 2016 again?' feeling. Then, all the top PL (Premier League) clubs had their problems and Leicester City completely unexpectedly won the title. Read More Harry Maguire picked out for praise by Michael Ballack\n\"Much the same is happening in Russia - Germany, Spain, Argentina, Brazil all gone. Is it the World Cup year of the underdog - perhaps? And Leicester has two key players in the squad - Maguire and Vardy - so there is local pride too.\"\nJohn believes that lower expectations than at previous tournaments in recent years of what the team could achieve was allowing excitement to build nationwide.\n\"Like all World Cups, it has captured the public's imagination,\" he said.\n\"Unlike recent ones, though, England has not carried high expectations this time and has also managed to win the first match and qualified for the KO [knock out stages] after just two games. Untold riches.\n\"So, there has been no public hand-wringing and, pressure off, gradually excitement is rising.\" Surpassed expectations\nNow, even if England were to not make the final of the competition, the success so far will have \"surpassed all expectations\" for fans, said John. Read More England kitman reveals race to ensure Harry Maguire was kitted out for Sweden\nBut if England went on to win the tournament, he added, it would be a\"huge boost\" to the country and the Premier League.\n\"Pressure is off. There will be disappointment, of course [if England are knocked out], but England has surpassed all expectations - QFs [quarter finals] were acceptable.\n\"If we win, it will offer a huge national boost and also a boost for the Premier League, especially if the final is v Belgium. Most of the players will then be PL products. But it may also reduce tensions between the FA and the PL - it might stop those claims that English players are being 'blocked' by foreign imports.\" Read More ", "external_links": [], "published": "2018-07-11T03:00:00.000+03:00", "crawled": "2018-07-11T13:35:33.000+03:00", "highlightTitle": ""}