{"organizations": [], "uuid": "e36e865eee0a84c15e7a8f8cbc60c32db752f245", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14948052.ece/ALTERNATES/s1200/0_The-North-of-England-Institute-of-Mining-and-Mechanical-Engineers-Newcastle-Andrea-Leadsom.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/andrea-leadsom-brexit-success-north-14948012", "country": "GB", "domain_rank": 21960, "title": "Andrea Leadsom: 'Brexit will be a success - and North East could vote Tory'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-24T20:16:00.000+03:00", "replies_count": 0, "uuid": "e36e865eee0a84c15e7a8f8cbc60c32db752f245"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/north-east-news/andrea-leadsom-brexit-success-north-14948012", "ord_in_thread": 0, "title": "Andrea Leadsom: 'Brexit will be a success - and North East could vote Tory'", "locations": [], "entities": {"persons": [{"name": "mrs leadsom", "sentiment": "neutral"}, {"name": "andrea leadsom", "sentiment": "neutral"}, {"name": "brexit", "sentiment": "neutral"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "united kingdom", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "tory' farming", "sentiment": "neutral"}, {"name": "eu", "sentiment": "none"}, {"name": "tories", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Farming industry\nAsked if she thinks Brexit will be a success for the North East, Mrs Leadsom said: “I just loved coming to the North East to see how vibrant it is, it’s a real emerging success story with a very bright future.\n“And I’m absolutely confident that in all circumstances Brexit is going to be superb for the United Kingdom, I have no doubt about that.\n“When you look at where our economy is going, all of the incredible advances in [science and technology], there’s an enormously bright future that awaits us with higher skilled jobs, more interesting things for people to do.\n“Once we’ve got back control of our borders we’ll be able to decide who comes to this country, what kind of skills we want, we’ll be able to offer more opportunity on a reciprocal basis with countries around the world and yes, I think the North East will be pleased.” Andrea Leadsom MP in Newcastle (Image: Newcastle Chronicle)\nApart from Newcastle, every area of the North East voted to leave the EU in June 2016.\nDespite that, the Tories failed to produce a significant electoral breakthrough in the region in the 2017 General Election despite confidence Labour could falter in traditional heartlands.\nAsked if Brexit could be successful enough to see North East voters turn blue, Mrs Leadsom said: “I think that will follow, I genuinely think that when people see that we are delivering for the North East, electoral success will follow.”\nShe added: “The Northern Powerhouse is a Conservative Government’s idea, it’s put enormous devolution power and money back into the North East, the North East is doing incredibly well.\n“Employment is up, skills are up, real wages are rising.\n“Things are going well and I think they’ll get even better and yes, I would hope people will recognise that it’s a Conservative Government that helps you get jobs, helps you look after yourself and your family.\n“And yeah, I think we can see a Tory breakthrough.” Andrea Leadsom MP in Newcastle (Image: Newcastle Chronicle)\nMrs May launched an ambitious attempt to get her divided ministers to fall in line behind her plan for Brexit at a marathon meeting at Chequers, the Prime Minister’s country retreat, on July 6.\nBoris Johnson and David Davis, the two most senior Brexiteers in her cabinet, resigned shortly after, saying they were unable to support the strategy which hardline Leavers say is not radical enough.\nDespite a series of walk-outs from less senior figures and reports she is privately unhappy with the Chequers deal, Mrs Leadsom said North East Leave voters should support the Prime Minister’s strategy. Read More Theresa May's cabinet are in the North East - but how Northern are they?\nShe said: “How I measure this is I look at what are the red lines that I and other 17.4 million people who voted for Brexit signed up to.\n“They were: stopping free movement; taking back control of our laws; stopping paying our EU membership fees; getting out of the single market and customs union; and getting out of the common agricultural policy and the common fisheries policy.\n“So when I look at the Chequers deal I measure it against those yardsticks and say to myself ‘are we still able to do all of those things’ and the answer is ‘yes, we are’.\n“Really importantly we are able to negotiate our own free trade deals with the rest of the world, which is of course the big win from leaving the EU, the ability to embrace global trade and put the UK at the front of the charge.” Read More Theresa May's deal may not give us the Brexit we voted for, warns Anne-Marie Trevelyan\nWith Parliament breaking up for summer recess, senior ministers are travelling the world to sell the Chequers white paper and explore future trade opportunities.\nCabinet Office minister David Lidington, the de-facto deputy prime minister, will head to Paris while Foreign Secretary Jeremy Hunt is due in Berlin.\nTheresa May will meet the emir of Qatar at Downing Street in talks likely to cover future trade opportunities, while International Trade Secretary Liam Fox is heading to the US to meet with business leaders and officials. Like us on Facebook", "external_links": [], "published": "2018-07-24T20:16:00.000+03:00", "crawled": "2018-07-24T21:52:07.013+03:00", "highlightTitle": ""}