{"organizations": [], "uuid": "ed26fb919888c389dd5289fa8b8dee21a2c039c0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13381540.ece/ALTERNATES/s1200/IBP_NEC_241116lifesavers_02JPG.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14953617", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Virgin Money profits jump 10% in half year results", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-07-26T09:52:00.000+03:00", "replies_count": 0, "uuid": "ed26fb919888c389dd5289fa8b8dee21a2c039c0"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-14953617", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Virgin Money profits jump 10% in half year results", "locations": [], "entities": {"persons": [{"name": "jones", "sentiment": "none"}, {"name": "m. grolet", "sentiment": "none"}, {"name": "coreena ford baker", "sentiment": "none"}, {"name": "grolet", "sentiment": "none"}, {"name": "cedric grolet", "sentiment": "none"}, {"name": "xeniya", "sentiment": "none"}, {"name": "xeniya jones", "sentiment": "none"}], "locations": [{"name": "ukraine", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "kiev", "sentiment": "none"}, {"name": "jesmond", "sentiment": "none"}], "organizations": [{"name": "london stock exchange", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's the FTSE latest?\nThe FTSE-100 index at 8:15am was down 1.15 at 7657.11.\nThe pound at 8am was 1.3195 dollars compared to 1.3149 dollars at the previous close. The euro at 8am was 0.8890 pounds compared to 0.8881 pounds at the previous close. London Stock Exchange (Image: PA) 8.40 Coreena Ford Baker inspired by world's best pastry chef creates luxury cakes in Newcastle\nA pastry chef who travels the world perfecting her culinary skills has l aunched a luxury dessert business in Newcastle.\nXeniya Jones is now making high-end sweets and cakes from her home in Jesmond after learning her skills from some of the industry’s top pastry chefs.\nShe recently returned from her second trip to Kiev, Ukraine, where she was taught by French chef Cedric Grolet, who has been named the world’s best pastry chef four years in a row.\nMr Grolet is known for his sculpted fruits cakes, which are encased in chocolate and look like real fruits.\nMs Jones is now bringing luxury cakes – including fruit cakes similar to M. Grolet’s – to the North East after launching her own business, Sweet Atelier by Xeniya Savi.\nThe business sells a range of sweet treats such as mousse cakes, modern honey cakes, macarons, and biscuit cakes.\n“I want to bring the confectionary market to a higher level in the North East,” said Ms Jones. “It is very traditional what people eat here, like cupcakes, and people don’t know much about modern pastry. There are not many modern cakes here.” Xeniya Jones has travelled the world to learn how to create luxury desserts and pastries (Image: Sweet Atelier) 8.35 Coreena Ford Royal Dutch Shell shares fall despite 37% rise in earning\nOil giant Royal Dutch Shell has posted a 37% rise in underlying earnings on a current cost of supply basis to $10.1bn (£7.7bn) for the six months to June 30.\nShell said underlying earnings rose 30% to $4.7bn (£3.6bn) in the second quarter, but this was lower than expected in the City.\nIt announced a share buy back programme of at least $25bn (£18.9bn) over the next 18 months. Shares fell 2% in morning trading.\nBen van Beurden, chief executive of Shell, said:\nToday we are taking another important step towards the delivery of our world-class investment case, with the launch of a 25 billion US dollar share buyback programme.\nThis move complements the progress we have made since the completion of the BG acquisition in 2016. A Shell logo on a petrol pump 8.28 KEY EVENT Metrocentre and Eldon Square owner Intu to continue investing despite challenging times\nThe chief executive of Eldon Square and Metrocentre owner Intu Properties has highlighted the group’s resilience in tough trading conditions, thanks to its winning destinations.\nDavid Fischel said the UK economy has been sluggish in the pre-Brexit period, with sentiment towards retail and retail property being extremely negative, fuelled by a number of retailers, in particular New Look and House of Fraser, and restaurant chains entering high profile CVAs or administrations.\nHowever, all the House of Fraser stores in Intu centres will reopen, with just a small rent reduction in one, with closures instead coming in secondary locations.\nHe said the direct financial impact on intu from CVAs and administrations has been minimal, but they have dampened the retail property investment market with property valuations decreasing by 5.6%.\nDespite the current struggles within the sector, he said Intu is continuing to invest.\nHe said: “We have continued to invest in our centres. We look forward to the opening of the £180m intu Watford extension in October, upgrading the centre to a top-20 UK destination.\n“We will follow with the opening of the £72m intu Lakeside leisure extension in the first half of 2019, greatly enhancing the overall family destination status of this top-five UK asset. We have committed to the £72m enclosure of Barton Square at intu Trafford Centre, anchored by Primark, and expect to commit to the £81m redevelopment of intu Broadmarsh in the second half of 2018.\n“We operate in many of the top UK retail destinations where retailers want to maintain their best stores and as such we have been relatively unaffected by the problems faced by certain retailers.\n“This is in contrast with the media’s continual focus on the issues facing retail and its impact on the UK high street, in particular those towns with many stores closing.\n“The administrations and CVAs in the period related to around 5% of our passing rent. The majority of these (around 80%) have had minimal impact with the retailers keeping the stores open on the existing rent or with a small reduction. Of the remainder, 10% are trading on discounted rents and 10% have closed.\n“This highlights the quality of our centres and catchments and their ability to deliver profitable sales for retailers as part of their multichannel offer.”\nDuring the six months to June 30 occupancy levels remained high at 97%.\nLike-for-like net rental income grew by 1.3% in the period, driven by new lettings and rent reviews, despite a 0.9 per cent hit from tenant failures. Intu Eldon Square (Image: Tony Hall Photography) 8.13 Coreena Ford Sky chalks up jump in earning amid Fox and Comcast bidding war\nPay TV giant Sky has reported a 7% rebound in annual earnings and cheered its global appeal as it remains at the centre of a takeover battle between suitors 21st Century Fox and Comcast.\nThe group thanked the global success of hit shows such as Patrick Melrose, starring Benedict Cumberbatch, for helping operating profits of £1.03 billion for the year to June 30, up from £964 million the previous year.\nPre-tax profits rose 7.6% to £864 million on like-for-like revenues 5% higher at £13.6 billion.\nIt said it saw customer growth of 39% in the final three months, taking its total reach to more than 23 million households across Europe.\nIn the UK and Ireland, Sky grew underlying earnings by 9% to £2 billion, with revenues 4% higher at £8.9 billion. It added 270,000 new customers in the UK and Ireland over the year, including 20,000 in the fourth quarter.\nAdvertising revenues in the UK rose 6% while its rate of “churn” - customers quitting the group - fell to its lowest for a decade at 10.3% after it invested in original content.\nIt added that this focus on content saw viewing of the group’s original dramas jump 50% in the UK last year.\nJeremy Darroch, group chief executive of Sky, said: “We’ve grown every year since we launched in 1989 and we’re not slowing down. “Today Sky is bigger and doing more for customers than ever before - and we’re proud that is being recognised globally.” A Sky HD TV remote control (Image: Chris Radburn/PA Wire) 8.05 KEY EVENT Virgin Money half year profits leap 10%\nThe chief executive of North East challenger bank Virgin Money has hailed a strong start to the year with a 10% leap in underlying profits.\nThe Newcastle headquartered firm has issued results for the half year to June 30, toasting growth as a result of its customer-focused strategy.\nUnderlying profit before tax increased by 10% to £141.6m, while underlying total income increased by 5% to £343.0m.\nJayne-Anne Gadhia, chief executive said: “I am delighted to report that our customer-focused strategy of growth, quality and returns continued to drive strong financial and operational performance during the first half of the year.\n“We also made good progress in delivering on our strategic initiatives.\n“We continue to maintain a strong balance sheet, as shown in our common equity tier 1 ratio of 16.3 per cent. This benefited from recent changes to our capital models to ensure they fully reflected the excellent credit quality of our lending portfolios.”\nMrs Gadhia said the firm’s SME savings franchise gathered “real momentum” in the period and is on track to deliver £500m of new deposits by the end of 2018.\nThe development of its digital banking platform is also progressing well, Mrs Gadhia said.\nMrs Gadhia added:\nI am delighted that we have continued to improve our gender pay gap, which reduced by a further 9% over the last year.\nWe remain committed to achieving 50:50 gender balance throughout the company by the end of 2020.\nThe recommended offer made by CYBG for Virgin Money in June reflects confidence in our strategy, our track record of delivery and the complementary models of the two businesses and will accelerate the delivery of our strategic objectives. Virgin Money Chief Executive Jayne-Anne Gadhia (Image: PA) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/14953617;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-07-26T09:52:00.000+03:00", "crawled": "2018-07-26T15:26:09.003+03:00", "highlightTitle": ""}