{"organizations": [], "uuid": "a7d37d00dd2d1337c842e89fa44eca142ca07604", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14465105.ece/ALTERNATES/s1200/IBP_NEC_270318pride_63JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/most-influential-2018-utoz-15141017", "country": "GB", "domain_rank": 21960, "title": "Most Influential List of 2018: The movers and shakers from U to Z", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-14T02:01:00.000+03:00", "replies_count": 0, "uuid": "a7d37d00dd2d1337c842e89fa44eca142ca07604"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/most-influential-2018-utoz-15141017", "ord_in_thread": 0, "title": "Most Influential List of 2018: The movers and shakers from U to Z", "locations": [], "entities": {"persons": [{"name": "graham wylie", "sentiment": "negative"}, {"name": "roger whiteside", "sentiment": "none"}, {"name": "greggs", "sentiment": "none"}, {"name": "waddell", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle chronicle", "sentiment": "negative"}, {"name": "ne1 ltd", "sentiment": "none"}, {"name": "army", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lifetime Achievement winner Graham Wylie (Image: Newcastle Chronicle) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nWelcome to the 2018 edition of The Most Influential People in the North East.\nWe have homed in on those individuals who really have the capacity to shape the future of the North East.\nIn this section we feature entrepreneur, philanthropist and businessman Graham Wylie as well as Roger Whiteside the Chief Executive of Greggs.\nOur influential panel of experts have identified those making a really important contribution to the North East economy - as well as those in other areas of public life who have a key role to play. Time Line Most Influential 2018: U-Z ADRIAN WADDELL Chief executive, NE1 Ltd, Newcastle\nMr Waddell, a former Army officer, became chief executive in March 2018 and now heads the BID company concerned with making sure Newcastle achieves its potential as a modern European regional capital city. The organisation is currently seeking a renewal from its members, and is working on the regeneration of the Bigg Market. It is also assisting Newcastle City Council on plans to transform the city’s retail heart with upgrades to the Northumberland Street and Blackett Street areas. JOHN WATERWORTH Chief Executive, Parkdean Resorts, Newcastle\nMr Waterworth has been chief executive of Parkdean since its creation 19 years ago, and has more than 30 years’ experience in the leisure industry. He has created the UK’s first truly national holiday park business which now boasts 73 locations – including five in the North East – generating £100m annually before tax. Mr Waterworth currently sits on a number of national caravan committees, is chairman of the British Graded Holiday Parks Scheme Committee, and a member of the Government-backed Tourism Industry Council. PROF ANDREW WATHEY Vice-chancellor and chief executive, Northumbria University, Newcastle\nIn post since 2008, Prof Wathey is leading at a time of great change and expansion for Northumbria, which attracts 35,000 scholars from around 140 countries. Awarded a CBE in 2016 for services to higher education, he is among an elected member of the CBI regional council, and on the boards of the North East LEP, NewcastleGateshead Initiative and the Quality Assurance Agency. He chairs the UK-Wide Standing Committee for Quality Assurance and is a member of the Council of the All Party Parliamentary Universities Group. IAIN WATSON Director, Tyne and Wear Museums and Archives\nMr Watson has worked in the cultural sector for more than 30 years, and is director of what is one of the UK’s largest regional museum and archive services, looking after nine museums and galleries across Tyneside. He is committed to delivering a world class service and played an important part in helping bring the Great Exhibition of the North to the region in 2018. Mr Watson is currently vice-chair of the National Museum Directors’ Council, on the board of the Museums Association, a member of the advisory board for ArtUK. HUGH WELCH Senior Partner, Muckle, Newcastle\nMr Welch has played a major role in Muckle’s development as one of the region’s leading corporate law firms. Muckle’s strategy is very much focused on helping local companies and promoting the region, and this corporate responsibility is embedded within its business plan. To this end, Mr Welch has been chairman of the Community Foundation serving Tyne and Wear and Northumberland and is a trustee of several charitable organisations. A keen marathon and ultra-runner, he has participated in races around the world and set-up Muckle Runners. LINDSEY WHITEROD Chief executive, Tyne Coast College\nTyne Coast College was formed in 2017 from the merger of South Tyneside College and TyneMet in North Shields, with the aim of strengthening their position in the further education arena. Ms Whiterod was chief executive of South Tyneside where her understanding of the link between education, training and the workplace to influence economic growth, was central to the college’s rapid rise in standards.She was made an OBE for services to education in 2013 and a CBE in 2018. ROGER WHITESIDE Chief executive, Greggs, Newcastle\nWith almost 1,900 stores nationally, Greggs is the leading bakery food-on-the-go retailer in the UK. Mr Whiteside has been chief executive of the region’s best known business since 2013, having begun his career at Marks and Spencer. He went on to be part of the founding team at Ocado, and chief executive of both the Thresher Group and Punch Taverns. Greggs expects to have opened 100 new stores by the end of 2018, and is continuing to extend its heathier options and hot food and drinks offering. HELEN WHITFIELD Chief operating officer, NBS\nMs Whitfield grew up in Blaydon and worked at Ernst and Young before in 1988 joining NBS, a global provider of construction information and knowledge management services. She has been instrumental in growing the business, which employs more than 200 people in the UK, has bases in Australia and Canada, an annual turnover in excess of £23m, and customers across the globe. The business is the commercial arm of the Royal Institute of British Architects (RIBA), which recently secured a £31.8m investment from LDC to expand in the UK and overseas. JOHN WIDDOWSON Principal and chief executive, New College Durham\nMr Widdowson began his career as a lawyer, but has worked in further and higher education for more than three decades, the last 20 of them as principal of New College Durham. Mr Widdowson has just been appointed the new chair of the WEA. He is also chair of the Mixed Economy Group of Colleges, and is a past president of the Association of Colleges. In 2010 he was awarded a CBE for services to further and higher education. PAUL WILDSMITH Managing Director, Darlington Borough Council, Darlington\nHaving spent 20 years as Darlington Borough Council’s chief financial officer, Mr Wildsmith has just moved up to the top job after the retirement of chief executive Ada Burns. Following a restructure, Darlington is now being headed up by three directors, with Mr Wildsmith taking on the role of managing director and retaining oversight of the finances. He grew-up in Darlington where his family ran a grocery store and studied accountancy at what was Teesside Polytechnic before moving into local government. Dr PAUL WILLIAMS Labour MP for Stockton South\nThe Stockton-based GP was relatively unknown before the 2017 General Election - he was only chosen as Labour’s candidate just over a month beforehand. A keen triathlete, he moved to Stockton after a four-year stint in Uganda. One of his main pledges is to tackle health inequalities in his constituency, GP waiting times and provide safer, more efficient A&E departments. He serves on Parliament’s Health and Social Care and Joint Draft Health Service Safety Inspection Bill committees. ROB WILLIAMSON Chief executive, Community Foundation, Newcastle\nMr Williamson is the CEO of the Community Foundation, one of a network of 48 across the UK. He took over as chief executive of what was The Community Foundation Tyne and Wear and Northumberland in 2009, having previously been the director of policy and communications at the Northern Rock Foundation. Eight years ago the fund sat at £33m, but this has now swelled by £46m. He is vice-chair of UK Community Foundations, a fellow of the RSA, and a member of both the BBC’s Charity Appeals Advisory Committee and the IPPR’s commission on civil society in the North. PHIL WILSON Labour MP for Sedgefield\nThe County Durham born politician is now in his third term in Parliament and is a passionate opponent of Brexit. Currently sitting on the influential Panel of Chairs committee, the Defence Committee and the Defence Sub-committee, Mr Wilson has worked in the civil service, where he was a lay-trade union official. A former Opposition Assistant Whip, he is interested in regional development, sustainable communities, and education. LUCY WINSKELL Pro vice-chancellor (Employability and Partnerships), Northumbria University, Newcastle\nPreviously a litigation lawyer, Ms Winskell has held a number of non-executive roles regionally, nationally, and internationally, and was awarded an OBE in 2014 for services to the North East economy and higher education. She leads Northumbria’s relationships with local government and public bodies, shaping its contribution to regional economic, cultural and social development.. She is chairman of the board of the North East England Chamber of Commerce, and sits on the boards of the British Chambers of Commerce, Live Theatre and the Centre for Life. She is also chair of the Heritage Lottery Fund North East committee. GRAHAM WYLIE Entrepreneur, philanthropist and businessman, Newcastle\nThe multi-millionaire co-founder of Sage, Mr Wylie is one of the North East’s best known entrepreneurs. His contribution to the area has been acknowledged with honorary doctorates from both Newcastle and Northumbria Universities, as well as a CBE. He is the founder of Technology Services Group (TSG), and Close House in Northumberland, and is behind the pioneering Graham Wylie Foundation, with its pledge to give 100% of all donations to charity. Wylie was instrumental in helping NewcastleGateshead win its bid to host the 2019 World Transplant Games. JOY YATES Editorial Director, Johnston Press North East, Sunderland\nGroup editor for daily titles the Sunderland Echo, Shields Gazette and Hartlepool Mail, Ms Yates is also editorial director for the JP North East publishing unit, which includes the Northumberland Gazette and Berwick Advertiser. She is on the Society of Editors board of directors and is a former chair of the Society of Editors Northern Region. Ms Yates is also a member of the National Council for the Training of Journalists accreditation board and an industry advisor for Sunderland University. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-14T02:01:00.000+03:00", "crawled": "2018-09-14T04:57:30.001+03:00", "highlightTitle": ""}