{"organizations": [], "uuid": "b90421d84cba093581caf066f44a5f9b783c989d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1799154.ece/ALTERNATES/s1200/0_Untitled-1.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/news-opinion/another-referendum-after-which-can-1997034", "country": "US", "title": "Another Referendum, after which, can we please be left to get on with our lives?", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-12T16:13:00.000+03:00", "replies_count": 0, "uuid": "b90421d84cba093581caf066f44a5f9b783c989d"}, "author": "Ben Bradshaw", "url": "https://www.devonlive.com/news/news-opinion/another-referendum-after-which-can-1997034", "ord_in_thread": 0, "title": "Another Referendum, after which, can we please be left to get on with our lives?", "locations": [], "entities": {"persons": [{"name": "ben br", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "ben bradshaw", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Another Referendum, after which, can we please be left to get on with our lives? Ben Bradshaw MP says he'd put money on another referendum on Brexit as the parliamentary arithmetic means that no Brexit deal can get through the Commons Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nBEN BRADSHAW IS THE LABOUR MP FOR EXETER AND HAS BEEN SINCE 2010 For fans of political drama, the next few months promise to be the best box office for years. The majority of people, whose engagement with politics is occasional and fleeting, will be tempted to tune out. But, how this drama unfolds will have an immediate impact on all of our lives as well as long term consequences for decades to come. Read More Will the Government get a Brexit deal? Will Parliament back it? What happens if it doesn’t? Will there be another general election or referendum? Will Tory MPs try to oust Theresa May? Ben Bradshaw MP Let me try to answer those in turn. Read More Exeter being asked to support a People's Vote on the final Brexit deal The chances are there will be some sort of deal. It won’t be Chequers. It will either be like the relationship Norway has with the EU – a softer Brexit, or it will be like Canada – a hard Brexit. The problem for Mrs May, is I can’t see either getting a majority in Parliament. There is a third possibility – a fudge or a “blind Brexit”. That would involve “parking” the UK in a Norway type relationship for the transition, while negotiating the terms of a harder departure by the end. But I don’t think a majority of MPs would support that either. It would put the country in limbo, with no clear outcome, while prolonging the uncertainty, which the public are already fed up with. Read More We are running out of time to solve Britain’s self-inflicted Brexit crisis If Mrs May can’t get a deal through Parliament, she could call a general election. But that would require Tory MPs to vote for one. A general election fought on the terms of Brexit would tear the Tory Party apart. So they’re not going to do that. Some hard Brexiteers claim that the only alternative to a deal is to crash out without one. But there’s a huge majority in the Commons against “no deal” and I would expect Parliament to find a mechanism to prevent this. Prime Minister Theresa May (Image: Jonathan Brady/PA Wire) The only rational way out in such circumstances would be for the Prime Minister to say to the public: “I’ve tried my best. But Parliament has rejected my deal and will not support no deal. You, the people, started this process off, I am now asking you to resolve it.” Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-09-12T16:13:00.000+03:00", "crawled": "2018-09-12T16:30:06.010+03:00", "highlightTitle": ""}