{"organizations": [], "uuid": "48cb4b9786d2911248375f9d2a9f407782511c08", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article843255.ece/ALTERNATES/s1200/Flybe.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/flybe-slashes-ticket-prices-flash-1975702", "country": "GB", "title": "Flybe slashes ticket prices in flash sale", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-06T11:18:00.000+03:00", "replies_count": 0, "uuid": "48cb4b9786d2911248375f9d2a9f407782511c08"}, "author": "Neil Shaw", "url": "https://www.devonlive.com/news/devon-news/flybe-slashes-ticket-prices-flash-1975702", "ord_in_thread": 0, "title": "Flybe slashes ticket prices in flash sale", "locations": [], "entities": {"persons": [], "locations": [{"name": "milan", "sentiment": "none"}, {"name": "amsterdam", "sentiment": "none"}, {"name": "berlin", "sentiment": "none"}, {"name": "venice", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "biarritz", "sentiment": "none"}, {"name": "palma de mallorca", "sentiment": "none"}, {"name": "blue islands", "sentiment": "none"}, {"name": "mallorca", "sentiment": "none"}, {"name": "malaga", "sentiment": "none"}], "organizations": [{"name": "stobart air", "sentiment": "none"}, {"name": "faro share neil shaw head of digital", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Flybe slashes ticket prices in flash winter sun sale Destinations include Amsterdam, Berlin, Milan, Venice, Palma de Mallorca, Biarritz, Malaga and Faro Share Neil Shaw Head of Digital, live and trending for PlymouthLive, DevonLive and CornwallLive 09:18, 6 SEP 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nFlybe, the Exeter-based regional airline, has announced a limited time seat sale with discounts of up to 20 percent on one million seats across 284 routes throughout the UK and Europe.\nDestinations include Amsterdam, Berlin, Milan and Venice. Booking is available through to midnight on 18 September 2018 at www.flybe.com/sale and effective for travel between 2 October 2018 and 16 June 2019.\nThis travel period covers the upcoming UK half terms, Christmas and New Year, the 2019 Easter holiday period and through to mid-June. Read More Exeter ranked in top five airports in UK by Which?\nAlso included in many of the routes on sale are those to Palma de Mallorca, Biarritz, Malaga and Faro.\nFlybe’s ‘Mega Seat Sale’ also features a selection of routes operated by two of its franchise partners, Stobart Air and Blue Islands. Why can't Flybe make a profit?\nIf you've ever flown from Exeter airport, the chances are you've flown with Flybe.\nThe city is proud to have its very own airline - it is one of the region's biggest companies, employing more than 2,000 staff.\nThis morning, figures for Year End 2017/18 revealed that Flybe has cut its pre-tax losses from £48million to £9million as revenue increased by six per cent.\nHowever, it posted adjusted loss before tax of £19.2m in the year to March 2018, up from £6.7m in the prior year.\nChief Executive Christine Ourmières-Widener, who has been in post for just over a year, said operations have improved over the last year despite the loss increase.\nShe has been transforming the business, cutting less-profitable routes and implemented an IT systems overhaul.\nWhile losses have widened, Flybe's revenue has risen 8.3% to £732.0m.\nAnd it is making more from every seat - 10.1% higher at £53.79.\nWe look at the reasons why Flybe isn't making a profit:\n1. Passengers are feeling the pinch\nJust like the high street, Flybe is at the mercy of the consumer. It means things like the 'Beast from the East' puts people off flying or means flights are cancelled. And if consumers are losing jobs or feeling the pinch because of rising household bills, the first thing to drop off the budget is a trip abroad.\n2. Brexit\nThe risks associated with Brexit and what regulation will look like for the aviation industry is a worry. Will there be additional tariffs and visas to think about. Air passenger duty continues to concern airlines - especially Flybe which has a lot of routes and partnerships with other airlines in mainland Europe.\n3. Cost of fuel and the impact of the dollar\nCar drivers will sympathise with this one. Flybe buys its fuel in dollars and the average market price in US Dollar was up 19.1 per cent at $560. Currency is a changeable beast and policy makers like President Trump can and does affect the price.\nWatch below as a Flybe plane lands at Belfast Airport on one engine Video Loading Click to play Tap to play The video will start in 8 Cancel Play now (Image: Flybe)\n4. Planes are expensive\nCapital investment from the outset is high and Flybe has been reducing the number of plane sit has from a peak of 85 in May last year to ensure that they are running at peak profitability. It needs to make sure that its planes are full to be most efficient. It is also cancelling its unprofitable routes.\nAviation is heavily regulated and the airline spends a lot on maintenance.\nIt has also overhauled its IT and digital systems to make sure that customers can book their flights on their mobile devices. Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-09-06T11:18:00.000+03:00", "crawled": "2018-09-06T12:20:03.010+03:00", "highlightTitle": ""}