{"organizations": [], "uuid": "4882c4779fed535cc93cc6ef061e341de9878b91", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10273650.ece/ALTERNATES/s1200/JS51556956.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/uk-driving-licences-could-invalid-15148532", "country": "GB", "domain_rank": 21960, "title": "UK driving licences could be invalid in Europe under no-deal Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-13T18:32:00.000+03:00", "replies_count": 0, "uuid": "4882c4779fed535cc93cc6ef061e341de9878b91"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/uk-driving-licences-could-invalid-15148532", "ord_in_thread": 0, "title": "UK driving licences could be invalid in Europe under no-deal Brexit", "locations": [], "entities": {"persons": [{"name": "carolyn fairbairn", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "european union", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "invalid email travellers", "sentiment": "none"}, {"name": "cbi", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nTravellers could find their UK driving licence no longer allows them to drive in the European Union if there is a no-deal Brexit, the Government has warned.\nDrivers could need International Driving Permits (IDP) if the EU does not agree to recognise UK licences, according to new guidance.\nAnd they may be turned away at borders or face enforcement action if they have not obtained the correct documents.\nIt’s one of a number of concerns raised by the latest set of documents published by the Government to prepare businesses and members of the public for the possibility of leaving the EU without a deal. UK driving licence\nThe Brexit papers make it clear that companies would be hit with a “sledgehammer” in the event of a no-deal, business group the CBI warned.\nDirector general Carolyn Fairbairn said: “Extra costs, duplication of certification and interruptions to data flows would damage the economy, with a knock-on impact for living standards.”\nThe Government has also warned that mobile phone bills for customers living near the border in Northern Ireland could spike after Brexit.\nConsumers and businesses would need to be aware of “inadvertent” data roaming - where a stronger signal from the Republic kicks in.\nIt comes after Brexit Secretary Dominic Raab urged phone companies not to impose roaming charges on customers if Britain crashes out of the European Union. Exiting the European Union Secretary Dominic Raab (Image: PA)\nWhich? chief executive Peter Vicary-Smith said: “Two-thirds of people think it is important that free roaming exists when travelling in the EU , so the news that we could face the return of sky high charges to use our phones abroad will come as a real blow.\n“If the Government is to deliver a Brexit that works for consumers, it needs to not only maintain free roaming across the EU, but also look to extend the benefit of free roaming for people visiting countries worldwide.”\nVodafone, Three, EE and O2, which cover more than 85% of mobile subscribers, have said they have no current plans to change their approach to mobile roaming once the UK leaves. Read More Transport Secretary Chris Grayling urged to resign over East Coast Main Line fiasco\nThe Government will legislate to introduce a cap on charges if there is a no-deal scenario.\nIt would set a £45 per monthly billing period limit and force companies to send alerts when 80% of that had been reached.\nMr Raab told BBC Radio 4’s Today programme: “We’ve had some good news from businesses like Vodafone and Three. Brexit Secretary, Dominic Raab (Image: Getty Images Europe)\n“They have publicly said they wouldn’t introduce any roaming fees for UK consumers travelling on the continent.\n“What we have said is we would like to see other companies following suit, but, in any event, we would legislate for a limit on roaming charges to make sure in a no-deal scenario that we protect British consumers.”\nBut the UK Government said it will guarantee funding for all projects receiving grants from the EU’s Regional Development Fund programme.\nThe Treasury announced in July this year that it would guarantee funding obtained through EU programmes up to the end of 2020 if Britain leaves without a withdrawal agreement. Read More See Jacob Rees-Mogg and his family get ambushed by protesters as North East MP offers support\nIn a no-deal preparation notice, the Department for Business, Energy and Industrial Strategy confirmed this promise, adding: “Organisations should continue applying for and delivering funding under current arrangements with confidence that the funding guarantee applies if there is no negotiated agreement between the UK and the EU.”\nAnd the Home Office published assurances that a no-deal Brexit will not alter the terms of the Common Travel Area which allows British and Irish citizens to live, work and receive welfare benefits in one another’s countries.\nIt confirmed that the Common Travel Area, which dates back to the 1920s, would remain in place in the case of the UK leaving the EU without a deal.\n“If you are an Irish citizen you would continue to have the right to enter and remain in the UK, as now,” said the paper. “You are not required to do anything to protect your status.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-13T18:32:00.000+03:00", "crawled": "2018-09-13T20:00:59.015+03:00", "highlightTitle": ""}