{"organizations": [], "uuid": "0e18816503953894031c1ae48d035d5e786eddb8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13498313.ece/ALTERNATES/s1200/jennings.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-motor-group-jennings-15106962", "country": "GB", "domain_rank": 21960, "title": "North East motor group Jennings set to be sold to automotive giant Lookers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-03T19:13:00.000+03:00", "replies_count": 0, "uuid": "0e18816503953894031c1ae48d035d5e786eddb8"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-motor-group-jennings-15106962", "ord_in_thread": 0, "title": "North East motor group Jennings set to be sold to automotive giant Lookers", "locations": [], "entities": {"persons": [{"name": "jennings", "sentiment": "negative"}], "locations": [{"name": "washington share nas khan - md", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "lookers north east", "sentiment": "negative"}, {"name": "kia", "sentiment": "none"}, {"name": "harley-davidson", "sentiment": "none"}, {"name": "jennings group", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "jennings motor group", "sentiment": "none"}, {"name": "benfield motors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East motor group Jennings set to be sold to automotive giant Lookers Reports say Lookers is close to a deal for Jennings, which is based in Washington Share Nas Khan - MD of the Jennings Motor Group Get business updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nOne of the region’s best known motor dealers is set to become the latest acquisition for the country’s biggest car dealership chain, reports say.\nLookers plc is reported to be close to announcing a deal to buy Washington-based Jennings Group, which has bases around the North East.\nLookers is the country’s largest motor dealer with sales of £4.6bn and is well-known in the North East after its £87m acquisition of Newcastle’s Benfield Motors three years ago.\nThe company has a policy of growth through acquisition and it is understood that it will buy almost all of Jennings’ network of 16 dealerships, most of which are in the North East. Reports detailing the deal said it would not include Jennings’ Kia franchise in Washington and its Harley-Davidson outlets.\nBoth companies were staying tight-lipped on the reported deal, with a spokesman for Lookers saying: “I can’t say anything at this stage. Nothing has been confirmed as yet.”\nBut if the deal was to go through, it is likely to see the end of the Jennings brand, which dates back more than a century.\nThe Jennings group was founded in Morpeth, Northumberland, in 1890 by Septimus Jennings, and grew steadily over the 20th century, mainly as a Ford dealer. The Jennings family remained involved in running the group until the 1990s.\nCurrent managing director Nas Khan took charge of the group in a management buy-out in 2005 and he has become a well-known figure in the North East business world, being appointed an OBE for services to charity and business in 2017 and being named Teesside Business Executive of the Year in 2015.\nJennings - which has outlets in Middlesbrough, Stockton , Gateshead, Washington, Sunderland, South Shields and Leeds - has partnerships with Ford, Kia, Mazda, Seat, Mitsubishi and Harley-Davidson.\nIn May, the company reported a 3% increase in turnover to £216m with a 9% increase in operating profits.\nBut in company accounts, Mr Khan pointed to a slowdown in the car market, saying “there was a feeling the market was beginning to tighten” and reporting that it had cancelled plans for a new dealership in Stockton.\nHe said: “We have decided not to go ahead with the Stockton development as a Ford store. As in my report last year, due to the uncertainty caused by Brexit, diesel cars, the slow-down of the new market etc, we did not feel that spending close to £6m was the right thing to do.”\nThe automotive sector has been experiencing turbulence as a combination of factors, especially doubts over the future of diesel vehicles and a squeeze on consumer spending, have hit sales.\nLast week the Society of Motor Manufacturers and Traders reported that the number of cars built in the UK had fallen 11% in the last year, in part due to “uncertainty” in the UK market. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-03T19:13:00.000+03:00", "crawled": "2018-09-03T21:14:11.019+03:00", "highlightTitle": ""}