{"organizations": [], "uuid": "a2dbeeb043aa7cd3f0bd11d978a0f88f33ae0a96", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15193410.ece/ALTERNATES/s1200/0_Anna-Soubry-arrives-at-Broxtowe.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/peoples-vote-rally-march-sunderland-15193320", "country": "GB", "domain_rank": 21960, "title": "People's vote rally and march in Sunderland to be led by Tory 'rebel' Anna Soubry", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-24T20:00:00.000+03:00", "replies_count": 0, "uuid": "a2dbeeb043aa7cd3f0bd11d978a0f88f33ae0a96"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/news/north-east-news/peoples-vote-rally-march-sunderland-15193320", "ord_in_thread": 0, "title": "People's vote rally and march in Sunderland to be led by Tory 'rebel' Anna Soubry", "locations": [], "entities": {"persons": [{"name": "anna soubry", "sentiment": "negative"}, {"name": "louise brown", "sentiment": "none"}, {"name": "brexiters", "sentiment": "none"}], "locations": [{"name": "sunderland", "sentiment": "none"}, {"name": "market square", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "news people's", "sentiment": "neutral"}, {"name": "sunderland", "sentiment": "none"}, {"name": "nottingham post", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News People's vote rally and march in Sunderland to be led by Tory 'rebel' Anna Soubry The former Minister and critic of 'hardline Brexiters' in her party will take part in the event on October 6 Share Conservative MP Anna Soubry (Image: Nottingham Post) Get daily\nA march and rally backing calls for the country to have the final say on any Brexit deal is to take place in the North East led by Tory ‘rebel’ Anna Soubry.\nThe ‘People’s Vote’ event, organised by NE4EU, is being staged on October 6 in Sunderland which was the first place in the UK to declare for Leave after the European Referendum result in June, 2016.\nIn the run up to the event, the campaign group recently set up its unofficial ‘Brexitometer’ in the city’s Market Square in which passers-by were invited to indicate how they thought the process was going.\nUsing coloured stickers, the vast majority indicated they thought it was not going well and was bad for jobs and for Sunderland, while the majority said the people should have a final say on the deal.\nNE4EU spokesperson Louise Brown who is from Sunderland said: “Whichever way you voted in the referendum, no-one did so to be worse off and have food and medicine shortages. Brexitometer in Sunderland\n“Many of us in NE4EU are from Sunderland and are terrified at the way the government is handling the Brexit negotiations. We are particularly worried about the impact on local jobs especially with Nissan, who are so important to our economy, clearly stating they need the UK to stay in the Single Market to stay profitable.” Read More Theresa May Brexit announcement RECAP: Prime Minister demands 'respect' from EU in bombshell Downing Street speech\nFormer Minister, Ms Soubry, is a critic of those in her party she sees as hardline Brexiteers. Other speakers will include Labour MP for Sedgefield Phil Wilson and representatives of the local NHS and businesses.\nThe march will assemble at 1.30pm at the Mowbray Park war memorial and proceed to Keel Square in the city centre for the rally.\nOrganisers NE4EU say they are responding to a growing realisation on Wearside that Brexit is turning out to be a bum deal that will seriously damage jobs, prosperity, and public services in the North East.\nThey cite strong evidence the Sunderland public is changing its mind as what they describe Theresa May’s Bad-Deal or No-Deal Brexit looms, including the results of their ‘Brexitometer’ poll. Read More Brexit could damage access to NHS services 'for decades to come'\nMs Brown said: “Following successful marches and rallies in Newcastle, and given a dramatic change in local public opinion, we encourage all Wearsiders and all those from across the North East who are concerned about Brexit and who want a People’s Vote to take part in our largest Sunderland event to date.\n“Time is running out for Theresa May to get a deal and all the signs from Salzburg are that she can’t. The time is now for the people to speak up and have their say. The consequences of Theresa May’s Bad Deal or No Deal to Sunderland and the North East will be devastating.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-24T20:00:00.000+03:00", "crawled": "2018-09-24T20:37:31.025+03:00", "highlightTitle": ""}