{"organizations": [], "uuid": "a8824719735dd631d4e4b19bcd0b4fe9235bef0f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15117032.ece/ALTERNATES/s1200/1_GWR_-NJL_210916cherry_01.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/small-businesses-unprepared-chaotic-no-15167229", "country": "GB", "domain_rank": 21960, "title": "Small businesses unprepared for 'chaotic no deal Brexit' according to new study", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-18T14:58:00.000+03:00", "replies_count": 0, "uuid": "a8824719735dd631d4e4b19bcd0b4fe9235bef0f"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/small-businesses-unprepared-chaotic-no-15167229", "ord_in_thread": 0, "title": "Small businesses unprepared for 'chaotic no deal Brexit' according to new study", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "mike cherry", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "fsb", "sentiment": "negative"}, {"name": "federation of small businesses", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Small businesses unprepared for 'chaotic no deal Brexit' according to new study FSB national chairman Mike Cherry says the study shows firms are not prepared with just six months left to go Share Mike Cherry, chair of the Federation of Small Businesses (Image: Handout) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nSmall businesses are unprepared for a “chaotic no deal Brexit” according to latest research by a business organisation.\nJust one in seven small businesses have starting planning for a no deal Brexit, the new study by the Federation of Small Businesses (FSB) has revealed.\nThe research shows that 41% believe that a no deal Brexit will have an impact on their business but haven’t yet started planning for the possibility and a mere 10% believe that a no deal Brexit will have a positive impact on their ability to do business. Read More Quayside building to be turned into hotel and bistro with secret gardens\nIt reveals that 48% believe that a no deal Brexit will have a negative effect on their ability to do business – a figure which soars to 66% for small firms that trade with the EU and to 61% for those that employ a staff member from the EU.\nThe research also exposed the actions those small firms, who will be impacted by Brexit, intend to take between now and the time the UK leaves the EU in preparation for a no deal Brexit. In all, 35% of small businesses say that they would postpone major business decisions or innovations, while 21% say they would cut staff or expenditure. Read More Teenager wow America's Got Talent judges\nFSB National Chairman Mike Cherry said: “Looking at this research it is obvious that our small firms are not prepared or ready for a chaotic no deal Brexit and the impact that it will have on their businesses.\n“If you sell your products to the EU, buy goods from the EU or if your business relies on staff from the EU, you now see this outcome as a clear and present threat to your business.\n“It is deeply troubling that the prospect of a no deal Brexit is seeing many small firms shelving business decisions, pausing investment and more drastically, thinking about cutting staff. These businesses are the growth engines of the UK economy and it is critical that the Government listens to their worries. Read More Notonthehighstreet founder to speak at Newcastle conference Venturefest\n“At this stage, it is understandable that some small businesses haven’t starting preparing as they aren’t actually aware of what they are planning for. What we need now is the Government to work with the small business community to ensure that they are adequately prepared and supported if a no deal Brexit becomes a more likely outcome in the coming weeks.\n“The concern is that with only six months to go before exit day, we are now in a race against the clock to avoid a situation where we crash out of the EU causing significant damage to our smallest businesses. This must be avoided at all costs.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-18T14:58:00.000+03:00", "crawled": "2018-09-19T01:56:38.006+03:00", "highlightTitle": ""}