{"organizations": [], "uuid": "9012464b996d3e9d47d78534380c7f317d992c88", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15167887.ece/ALTERNATES/s1200/0_greg-stone-nick-forbes.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/overstretched-newcastle-council-staff-dont-15167823", "country": "GB", "domain_rank": 21960, "title": "Overstretched Newcastle council staff don't have time for Brexit 'navel-gazing', leader says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-18T18:00:00.000+03:00", "replies_count": 0, "uuid": "9012464b996d3e9d47d78534380c7f317d992c88"}, "author": "Daniel Holland", "url": "https://www.chroniclelive.co.uk/news/north-east-news/overstretched-newcastle-council-staff-dont-15167823", "ord_in_thread": 0, "title": "Overstretched Newcastle council staff don't have time for Brexit 'navel-gazing', leader says", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nOverstretched council staff don’t have time for “navel-gazing” over how Newcastle will be hit by Brexit , according to the city’s Labour leader.\nCouncillor Nick Forbes told his cabinet on Monday that Newcastle City Council can’t afford the luxury of asking its staff to “second guess” what a post-Brexit Tyneside will look like, while facing ever-increasing pressures on frontline services.\nHis comments came after the authority was criticised by the Liberal Democrat opposition for not carrying out a Brexit risk assessment for the city.\nThe council leader blamed a lack of clarity or financial support from the Government for the lack of planning, with just six months to go until Britain leaves the European Union. Lib Dem councillor Greg Stone (left); Coun Nick Forbes (right)\nCoun Forbes said: “I have been involved with the Brexit task force that the Government has established. The parameters of the potential ranges of the impact of Brexit are so broad that at the moment it is impossible for the local authority to make any meaningful guesses on what we will be dealing with.”\nHe added: “I really don’t know what the council could second guess. The parameters are so broad at the moment.\n“We may have a better idea after the ministerial summit in October.\n“But at the moment we can’t guess and we don’t have the luxury of having hundreds of staff to be running around asking these navel-gazing questions.” Read More Small businesses unprepared for 'chaotic no deal Brexit' according to new study\nLib Dem councillor Greg Stone said it was “a concern, to say the least” that Brexit planning did not form part of the council’s corporate plans.\nThe opposition councillor also claimed that a risk assessment could be developed “fairly easily” by looking at those produced by other local authorities.\nIt was revealed in August that the only North East council carrying out any Brexit study was Northumberland, which had commissioned a report into how the rural economy might be affected. Read More MPs warn Theresa May her current Brexit plans won't save the car industry\nCoun Forbes, who pledged to press the Government for more clarity on the impact of Brexit on local councils, added: “When we have an idea of what kind of scenario we face, we will be able to do a risk assessment.\n“It seems to be that Coun Stone is doing some grandstanding, and we have better things to do like get on with delivering day to day services.”\nBy 2020, the cash-strapped council will have lost £283m from its budget in 10 years. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-18T18:00:00.000+03:00", "crawled": "2018-09-19T00:17:59.003+03:00", "highlightTitle": ""}