{"organizations": [], "uuid": "eefddefde1d43a67506182962d242776acc9b642", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15208645.ece/ALTERNATES/s1200/0_asr_comm1.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/special-features/bradley-hall-celebrates-outstanding-year-15208520", "country": "GB", "domain_rank": 21960, "title": "Bradley Hall celebrates 'outstanding year' in commercial property market", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-27T16:53:00.000+03:00", "replies_count": 0, "uuid": "eefddefde1d43a67506182962d242776acc9b642"}, "author": "Mike Hughes", "url": "https://www.chroniclelive.co.uk/special-features/bradley-hall-celebrates-outstanding-year-15208520", "ord_in_thread": 0, "title": "Bradley Hall celebrates 'outstanding year' in commercial property market", "locations": [], "entities": {"persons": [{"name": "bradley hall", "sentiment": "positive"}, {"name": "tyne", "sentiment": "none"}, {"name": "tim aisbitt", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "advertorial bradley hall", "sentiment": "positive"}, {"name": "bradley hall", "sentiment": "none"}, {"name": "estates gazette", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Advertorial Bradley Hall celebrates 'outstanding year' in commercial property market Head of agency, Tim Aisbitt, comments the exciting activity which is continuing to shape our region following a record nine months for the firm Share Tim Aisbitt, Associate Director at leading North East property firm Bradley Hall (Image: Handout) Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThis year has been an outstanding period for Bradley Hall’s agency team. We’ve further grown as one of the leading property firms in the North East, welcomed a range of new clients and completed on a variety of high-profile deals.\nOur achievements did not go unnoticed, and we were honoured to be named as the top retail agent in the North East by Estates Gazette for our work throughout 2017. Estates Gazette also recently named us as the highest-placed non-national agent for office deals in Newcastle upon Tyne following an increase of 400% in transacted office space in the past year.\nThis period of growth and success encourages our opinion that the North East commercial property market is continuing to thrive despite economic challenges and the ever-increasing changes in business property needs across all sectors. Undeterred by Brexit , the North East is performing exceptionally well. As a region we’re developing and implementing a range of exciting new projects and welcoming millions of pounds of inward investment. Read More Thinking about purchasing a business? Not sure where to start? Expert advisers at Christie & Co are ready to help\nDespite evolving working styles, the office market continues to perform well, as prime rents increase. Landlords are adapting to provide a different type of space for their tenants as flexible working becomes a more established option and improved connectivity increasingly changes the way we work.\nThe region’s leisure and hospitality sectors are continuing to perform well in what is a highly-competitive market, with the number of bars and restaurants growing by 15.7% over the last five years. We’re proud to work with some of the region’s leading operators in this industry, including on the highly anticipated STACK Newcastle, a contemporary and creative social hub in the centre of Newcastle created by Danieli Holdings.\nOur licenced and leisure department has expanded thanks to the many opportunities and heightened activity in this sector. We have recently recruited David Gibson to head up and further strengthen this area of the business, following over 40 years of experience in the industry.\nEntertainment projects, including The Unnatural History Museum from Dinosauria Ltd, are also boosting the region’s profile. Bradley Hall acted on behalf of Dinosauria Ltd in agreeing the long-term lease with Gateshead Council on Gateshead’s Old Town Hall. The overall project, which will also see a further two phases to include a themed restaurant, brewery and bar, will create 200 jobs.\nPositive investment and employment opportunities are also on the horizon in the Tees Valley as billion-pound business Amazon is set to launch a £120m fulfilment centre in Darlington, creating as many as 3,000 jobs.\nAlthough we may have an uncertain economic climate, businesses are still looking to grow their operations, especially in the office and industrial sectors. It can certainly be said that there will continue to be a retail revolution and retailers of every size must adapt to the changing landscape. There is no doubt that the consumer now demands more, and it is vital that changes reflect consumer loyalty and offer a shopping experience. Retail property in the traditional sense will see greater modification and urban stakeholders need to consider how changes in the way we shop will continue to impact upon their ability to offer vibrancy and attract footfall. Read More A new role for Mike Ashley as House of Fraser rescue challenges landlords\nThe current activity in the commercial property market is encouraging for businesses and investors of all sizes. Investors from both the south of England and overseas have a continued appetite for the region due to attractive yields. Not only that, the North East will continue to be a secure area to invest in post-Brexit thanks to exciting on-going opportunities, a strong and skilled local workforce and a vibrant start up sector.\nThe current theme in the North East is innovative thinking – the region’s local authorities and businesses of all sizes are not standing still, which is encouraging to see. Collectively, individuals and businesses are moving forward towards creating an even more vibrant, modern and exciting place to live, work or visit and we must continue to have the confidence to promote our fantastic region on a national and international level. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-27T16:53:00.000+03:00", "crawled": "2018-09-27T17:18:40.045+03:00", "highlightTitle": ""}