{"organizations": [], "uuid": "cfd2d3626c4889193a9d033219b0d9bf06ecd945", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1963565.ece/ALTERNATES/s1200/1_WLL-JOHNSTON-PHOTOGRAPHY.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/leicester-businessman-paul-rowlett-bust-1963583", "country": "GB", "domain_rank": 48128, "title": "Leicester businessman Paul Rowlett - from bust to a multi-million pound firm and Las Vegas spin-off - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.019, "site_type": "news", "published": "2018-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "cfd2d3626c4889193a9d033219b0d9bf06ecd945"}, "author": "Justine Halifax", "url": "https://www.leicestermercury.co.uk/news/business/leicester-businessman-paul-rowlett-bust-1963583", "ord_in_thread": 0, "title": "Leicester businessman Paul Rowlett - from bust to a multi-million pound firm and Las Vegas spin-off - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "charles alexander", "sentiment": "negative"}, {"name": "paul rowlett", "sentiment": "negative"}, {"name": "jen", "sentiment": "none"}, {"name": "justine halifax", "sentiment": "none"}, {"name": "charles alexander distribution", "sentiment": "none"}, {"name": "paul", "sentiment": "none"}], "locations": [{"name": "leicester", "sentiment": "none"}, {"name": "las vegas", "sentiment": "none"}], "organizations": [{"name": "leicestershire", "sentiment": "negative"}, {"name": "invalid email", "sentiment": "none"}, {"name": "ex-navy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Paul Rowlett of Charles Alexander Distribution/Everything Branded (Image: Will Johnston Photography) Get Business updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nLeicester-born Paul Rowlett left school with one GCSE but is now the head of a multi-million pound promotional products enterprise. Justine Halifax speaks to him...\nA decade ago, ex-Navy serviceman Paul Rowlett was staring homelessness in the face. Despite trying to find employment after losing two sales jobs following the recession, he was out of work and on benefits with a repossession order on his home.\nPaul said: “I’ll be honest, life was tough, but I feel it made me stronger, as I’ve seen life from all sides – financially and emotionally.”\nWith the support of his now wife Jen, a former teacher, he picked himself up.\nUsing a loan from a friend and a free laptop that came with a mobile phone contract, he founded city-based distributor Charles Alexander Distribution and launched his flagship online brand, EverythingBranded.co.uk – with the strapline that: “One name says it all – we brand everything”.\nEight years on, he’s standing proud at the helm of a multi-million pound enterprise, which supplies promotional products to an ever-growing client list – including Samsung, Tetley, Bisto, Asda, Greggs, Lufthansa, AA, ITV, the NHS, and several universities and councils.\nAnd last year Charles Alexander Distribution took on 14,000 sq ft in Peat House, opposite Leicester Railway Station. Las Vegas at the Hansom Rooms (Image: PA)\nWithin just a year of the venture’s birth, in 2010, it had secured preferred supplier status for schools in Leicestershire as well as being a preferred supplier for Queen’s Jubilee products on Leicester City Council’s website.\nBy 2013, turnover had surpassed £2 million and the company was winning awards.\nAfter being encouraged to explore the US market in 2015, Paul went on to add EverythingBranded USA to his portfolio, which started trading “properly” at the beginning of last year.\nDespite being a traditionally difficult market for British firms to compete in, within one year the new USA arm, employing 40 UK sales staff, proved a success by achieving more than $6 million in sales. Read More Liz Hurley and Susannah Constantine launch new shopping village The Engine Yard at Belvoir Castle\nHaving built up his enterprise from scratch, Paul is proud of what he’s achieved, but has no plans to rest on his laurels, admitting: “If you ask anyone who knows me, I get bored very easily. I need to be busy.”\nInstead he’s going after an even bigger share of the multi-billion dollar US promotional gifts market by opening a new HQ and sales centre in Las Vegas, which is predicted to reap a $100 million turnover within a few years.\nFor this year, Paul says the group is now “on track to reach combined sales of $35 million for the whole of 2018”. Paul Rowlett is branching into the US (Image: Will Johnston Photography)\nBut, even once that’s achieved, his business growth ambitions won’t cease.\nThe ex-Navy heavyweight champion boxer, whose wife also works for the group, revealed: “We are forecasting that sales from all our brands will easily exceed £17 million for 2018.\n“All forecasts are calculated, and not just picked out of fresh air, so while this level of growth seems very large to most, I’m extremely confident we’ll achieve it.\n“We hope that by bringing the best of British products and services to American soil, we can claim a bigger piece of the fast-growing promotional products industry, which up until now, has been largely dominated by American companies. Read More 775 new flats could be built in Waterside area as regeneration continues\n“Establishing a headquarters in Las Vegas strengthens our position to increase market share.\n“The great thing is that I have the team to make it happen – the most important thing in any growth plan. We also have a target to increase staffing from 130 to just over 200 by the end of 2019.\n“Going forward, our ultimate target is to break $100 million by early 2021, with a staff of up to 260 people.\n“While our $100 million financial goal is a great target to have, we have got so many more goals in sight, including adding more profit centres and exploring new print sector markets. (Image: Will Johnston Photography)\n“Ultimately USA is not the end of our ambitions. The next few years will certainly be exciting.”\nHe said the group had already “taken a hit” from Brexit – but revealed an unusual tactic he’d employed to manage it.\n“I’ve mixed feelings on Brexit,” said Paul, who spends weekends travelling with Jen and their two King Charles Cavalier spaniels.\n“While I understand why some people voted out, I personally don’t think it will change very much at all. There are so many concessions being put into the exit plan it seems pointless.\n“From a business point of view, we took quite a big hit on our imports, due to the dollar rate crashing, as we pay when goods land from the Far East. Read More TK Maxx homeware brand Homesense is finally coming to Leicestershire\n“So, it was not a great time, and I am happy to admit I was worried slightly, but like any business you get through it and we added more growth to cover our drop in GP.\n“This may sound strange to some people, but we actually invested more when times were tougher, and it paid off – so it’s maybe something to think about if your business is going through a downturn.”\nPaul, who left school with one GSCE, added: “Talking to our supply chain they all say we’re the fastest growing UK distributor and our suppliers all want to work with us.\n“But, I like to think it’s because of a couple of other factors. EverythingBranded is taking on the States\n“One is our transparent approach to business. Our door is always open to our suppliers and customers, giving the end user trust.\n“The other thing you’ll see from our websites is we love to showcase our team.\n“I think if you’re an online business, with no high street presence, customers need to be confident the person they are chatting to is real and not a robot. But also, it means they can put a face to a name.\n“This ultimately gives trust, which can only be a great thing for the customer journey.”\nPaul’s attention to detail has also seen him, inspired by Google, create a quirky workspace featuring artificial grass, picnic tables with parasols, table football, Union Jack bean bags and fake cacti.\nHe said: “Our retention has never been better, and when you see your team staying behind for a pool tournament, or just to grab a coffee, it’s only a good thing.\n“When you spend more time at work then at home, it sounded like common sense to me to make the working environment fun and engaging for staff and visitors. Las Vegas (Image: Daily Mirror)\n“Personally, I don’t really class my days in the office as work. Read More Norton Motorcycles boss Stuart Garner on Brexit - “UK better prepared than media has us believe”\n“When you do something that you love, it’s more a part of life.”\nBut Paul has never forgotten the hard times he endured and is quick to give young homeless people a chance with apprenticeships – and he’d like other firms to be encouraged to follow suit.\n“I’ve great empathy with homeless people, particularly young people with their whole life ahead of them,” he said.\n“I’ve made a point of employing youngsters who are either down on their luck or have experienced being homeless.\n“I know what it’s like to not be given a chance – there is such a rich seam of untapped potential, this country can’t afford to just throw these people away.\n“If all employers were obliged to take on a small percentage of homeless young people, and train them, via an apprenticeship scheme like ours, it would give them their self-respect back and some genuine hope. Read More This is when new flagship Zara store will open in Highcross Leicester\n“We’ve embraced the apprentice scheme and had some amazing results from giving young people a chance.\n“I think if you show passion, and demonstrate that you can meet our internal tests, that wins over a certificate any day in my books.”\nPaul’s phenomenal success has already seen him achieve one of his longstanding dreams – to meet Virgin Group founder Sir Richard Branson.\nHe said: “I love the way he promotes his companies and makes bold decisions. I admire his ‘screw it, let’s do it’ approach. Viva Las Vegas (Image: HANDOUT)\n“I promised myself when I could afford it I’d visit Necker Island and I thought maybe I’d get lucky and meet him.\n“So, we booked a week and couldn’t believe it as he literally greeted us as we got off the boat. We spent five of our seven days in his company. He’s such a nice guy, was very accommodating and gave me great advice.”\nWhen it comes to dishing out his own advice to be a successful entrepreneur, Paul has the five following tips: 1. Know your market inside out 2. Know your competitors inside and out 3. Set goals, especially for the short term 4. Once you’re established, set longer term goals as a solid structure becomes even more important 5. Finally, learn to delegate – you can’t do everything, even though you think you can.\nDespite the US investment, Paul isn’t tempted to leave Leicester – instead he plans to commute.\n“Leicester is my home and I won’t be leaving the ‘shire’ anytime soon,” he said.\n“But I suppose one good thing about having our USA office is that I’ll maintain my tan…” Like us on Facebook ", "external_links": [], "published": "2018-09-04T03:00:00.000+03:00", "crawled": "2018-09-04T11:52:48.010+03:00", "highlightTitle": ""}