{"organizations": [], "uuid": "d3b0150365bca81df6b0c5811f61d56bc97ff7bc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15215443.ece/ALTERNATES/s1200/0_TMP_NEC_280918MajorMiliband15JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/sir-john-major-admits-coal-15215431", "country": "GB", "domain_rank": 21960, "title": "Sir John Major admits coal was 'his single biggest misjudgement' - as David Miliband talks Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-28T23:00:00.000+03:00", "replies_count": 0, "uuid": "d3b0150365bca81df6b0c5811f61d56bc97ff7bc"}, "author": "Ian Johnson", "url": "https://www.chroniclelive.co.uk/news/north-east-news/sir-john-major-admits-coal-15215431", "ord_in_thread": 0, "title": "Sir John Major admits coal was 'his single biggest misjudgement' - as David Miliband talks Brexit", "locations": [], "entities": {"persons": [{"name": "john major", "sentiment": "negative"}, {"name": "brexit david miliband", "sentiment": "negative"}, {"name": "david miliband", "sentiment": "negative"}, {"name": "miliband", "sentiment": "none"}], "locations": [{"name": "south shields", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}], "organizations": [{"name": "south shields", "sentiment": "negative"}, {"name": "miliband annual lecture", "sentiment": "none"}, {"name": "harton college", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "David Miliband former Foreign Secretary and South Shields MP with Former PM Sir John Major at the Miliband Annual Lecture at Harton College (Image: newcastle chronicle) Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nSir John Major told South Shields the “biggest single misjudgment” of his Government was how he handled the demise of coal.\nThe Tory was Prime Minister when the town’s last mine closed over 25 years ago, wounding the area’s economy.\nAround 31,000 jobs were lost across Britain when the Government passed a death sentence on the pits.\nBut he said he had hoped money would have been pumped back to regenerate the economy. David Miliband former Foreign Secretary and South Shields MP with Former PM Sir John Major at the Miliband Annual Lecture at Harton College (Image: newcastle chronicle)\nAnd he insisted: “We were not a bunch of monsters with vile intentions.”\nHe spoke on Friday at ex-South Shields MP David Miliband’s annual lecture.\nEarlier, Mr Miliband told ChronicleLive he had no plans to return to Parliament as he warned of the misery Brexit could have a “seismic” impact on North East industry.\nAnd while he accepted it was “unusual” to have invited a Conservative to address the area. Read More\nSouth Shields is the only active constituency to have never elected a Tory MP since the 1832 Great Reform Act.\nBut admitted: “That reflects the grave times in which we live.\n“We have to break out from the confines of our tribe and recognise the seriousness of the issues Brexit poses for the country.”\nBoth veteran politicians threw their weight behind growing calls for a ‘second referendum’ on Britain’s leaving terms from the EU.\nSir John told a packed crowd that the vote should this time centre on “facts not fantasy”.\n“I can’t see an intellectual argument against (another vote),” he added.\nSouth Shields overwhelmingly voted to leave the EU back in June 2016. Mr Major speculated that may have been down to people losing “hope”. David Miliband former Foreign Secretary and South Shields MP (Image: newcastle chronicle)\nBut Mr Miliband told ChronicleLive the UK faces “25 years of impact” - and leaving will make Britain “poorer and weaker”.\n“If we go ahead with the Brexit we have planned, it is going to be especially damaging in the North East - it is right to sound the alarm,” he warned.\n“The truth is, the Brexit they were promised....it is rubbish. It doesn’t exist.\n“The case, for whatever Brexit is negotiated should be out the people, is overwhelming.”\nLabour leader Jeremy Corbyn told his party’s conference that he would back Theresa May’s Brussels deal for Brexit - if it was on Labour’s terms.\nThat could theoretically destroy any chance of a public vote on the terms.\nBut addressing his old party’s performance on Brexit, Mr Miliband said he wanted to see more bite - adding he found it “extraordinary” they were trailing the Conservative’s in the polls.\n“Labour is suffering from the temptation of all oppositions which is to enjoy the Government’s mess and hope the prize will fall into your hand,” he said.\n“But my experience is that isn’t the case.”\n”I would like to see Labour playing a stronger, more forceful and more principled role on this European issue.\n“It isn’t somehow a betryal of leave voters to say the Brexit you were promised doesn’t exist - and you deserve the right to be sure you are doing the right thing.” Read More Watch Ian Lavery clash on Question Time as he defends Jeremy Corbyn and backs Brexit\nAfter leaving Parliament in 2013, the former leadership candidate moved to work in New York.\nHe told ChronicleLive he flew back into the North East with a smile on his face - and that he was planning a fish supper at Colmans’ chippy.\nBut despite talking Brexit - and a tempting 25/1 to replace Jeremy Corbyn as the party’s leader - he urged people to keep their fivers in their wallets.\n“I think the truth is you can’t press the action replay button,”\n“But one can still care if you are not in politics.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-28T23:00:00.000+03:00", "crawled": "2018-09-29T01:17:38.006+03:00", "highlightTitle": ""}