{"organizations": [], "uuid": "fed88ad162fca62f23986e7b338bea3edbad69cc", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15187714.ece/ALTERNATES/s1200/0_2018-TUC-Congress-in-Manchester.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-leadership-tells-activists-no-15193402", "country": "GB", "domain_rank": 21960, "title": "Labour leadership tells activists there will be no second referendum on staying in the EU", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-24T14:50:00.000+03:00", "replies_count": 0, "uuid": "fed88ad162fca62f23986e7b338bea3edbad69cc"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-leadership-tells-activists-no-15193402", "ord_in_thread": 0, "title": "Labour leadership tells activists there will be no second referendum on staying in the EU", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}], "locations": [{"name": "eu labou", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "manchester", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "eu news labour", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "invalid email labour shadow chancellor john mcdonnell", "sentiment": "none"}, {"name": "mcdonnell", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "tuc congress", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Labour leadership tells activists there will be no second referendum on staying in the EU Labour activists including some from Newcastle and Durham hoped the prty would come out in favour of a second EU referendum Share Shadow Chancellor John McDonnell addresses the 2018 TUC Congress in Manchester (Image: Daily Mirror) Get daily\nLabour Shadow Chancellor John McDonnell has rejected pleas from activists for the party to support a referendum that could mean the UK stays in the EU.\nMembers in 86 constituencies, including some in the North East, submitted motions to the party conference which specifically call for a referendum on whether to continue with Brexit - or to stay in the EU after all.\nAnd most of these say that Labour should hold a referendum if it forms a government, as well as calling on the Conservative government to back a second poll.\nBut Mr McDonnell, Labour leader Jeremy Corbyn ’s second-in-command, said: “We argued for Remain in the past but we lost that vote so we have to respect that.”\nHe said that Labour could support a second referendum on Brexit , but only to decide whether the country accepted the Government’s proposed deal with EU countries or rejected it.\nThe option of simply cancelling Brexit and staying in the EU would not be included.\nMr McDonnell told BBC Radio 4’s Today: “If we are going to respect the referendum it will be about the deal.”\nIn another blow to supporters of a second referendum, Labour officials have decided that members at the party conference, currently taking place in Liverpool, will only be allowed to vote on a motion that states: “if we cannot get a general election, Labour must support all options remaining on the table, including campaigning for a public vote.”\nIt seems to mean that Labour could call on the Tory government to hold a so-called People’s Vote, but won’t hold one if an election actually takes place and Labour comes to power. Read More Wansbeck MP Ian Lavery urges Labour activists to back new rules\nBut the policy flies in the face of motions submitted by local constituency Labour Party activists.\nA motion calling on Labour to make “a manifesto commitment to call a public vote on the deal with an option to remain in the EU” was backed by Bishop Auckland Constituency Labour Party (CLP) and North West Durham CLP.\nNewcastle Central CLP called on the party to “campaign for a public vote on an unsatisfactory, or ‘no deal’ Brexit, including the option of remaining in the EU.”\nThe Newcastle Central motion continued: “Failing this, call for a general election with a manifesto commitment to call for a public vote on the deal with an option to remain in the EU.”\nNewcastle North MP Catherne McKinnell joined a rally in Liverpool on Sunday to support a so-called People’s Vote.\nLabour Deputy Leader Tom Watson had urged the party to accept the views of members. Read More Shadow Foreign Secretary Emily Thornberry says Labour would delay Brexit\nLabour MP David Lammy, a prominent campaigner for a second referendum, said it would be “farcical” to have a vote without the option of remaining in the EU.\nHe said: “A People’s Vote is the only realistic option to save this country from the car crash of Brexit.\n“No Tory or DUP MP is likely to vote for a general election. Turkeys do not tend to vote for Christmas.”\nHe added: “We’ve now got to turn up the noise until we secure a public vote which gives us the option to remain in the UK.”\nHe received support from fellow Labour MP Chuka Umunna who called for an “unequivocal” commitment to a second referendum with remaining in the EU as an option.\nThe phrasing of the motion was decided after a marathon late-night meeting at the conference in Liverpool. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-24T14:50:00.000+03:00", "crawled": "2018-09-24T16:37:54.000+03:00", "highlightTitle": ""}