{"organizations": [], "uuid": "1a47b78b74affd36ea8e93ee9c95f3dc4b2e5997", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15171941.ece/ALTERNATES/s1200/0_poltics.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/tv/see-piers-morgan-ban-james-15171733", "country": "GB", "domain_rank": 21960, "title": "See Piers Morgan 'ban' James Brokenshire from Good Morning Britain after interview refusal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-19T13:26:00.000+03:00", "replies_count": 0, "uuid": "1a47b78b74affd36ea8e93ee9c95f3dc4b2e5997"}, "author": "Mike Fuller", "url": "https://www.chroniclelive.co.uk/news/tv/see-piers-morgan-ban-james-15171733", "ord_in_thread": 0, "title": "See Piers Morgan 'ban' James Brokenshire from Good Morning Britain after interview refusal", "locations": [], "entities": {"persons": [{"name": "james brokenshire", "sentiment": "negative"}, {"name": "brokenshire", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "piers morgan", "sentiment": "none"}], "locations": [{"name": "britain", "sentiment": "none"}, {"name": "salzburg", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "piers", "sentiment": "none"}, {"name": "piers morgan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "See Piers Morgan 'ban' James Brokenshire from Good Morning Britain after interview refusal The ITV host claimed the Tory housing secretary had 'decided he can't do our programme this morning' Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily\nPiers Morgan claims to have banned a Tory minister “for life” from Good Morning Britain after he refused to be interviewed on the show.\nHousing Secretary James Brokenshire toured the BBC and Sky studios this morning to debate a £2billion fund for housing which will only be available after 2022.\nMr Brokenshire had also said it was time for the EU to “evolve” its Brexit stance as Theresa May jets into Salzburg tonight for a dinner with her fellow leaders.\nBut he apparently turned down the chance to appear on GMB as part of his visit on Wednesday. Piers Morgan (left) and James Brokenshire (right) (Image: ITV/PA)\nPiers told viewers: “Unfortunately, because I don’t think the PM is a leader and I think Brexit is a farce, he’s decided he can’t do our programme this morning.\n“So we’ve had to ban him for life from Good Morning Britain.\n“It’s a personal tragedy for Mr Brokenshire. We’ll probably get over not having him - ooh! We’re over it.”\nTheresa May will unveil £2billion of long-term funding for around 40,000 homes today in a major speech to the National Housing Federation.\nShe will boast the figure is “ground-breaking” adding: “Many people in society - including too many politicians - continue to look down on social housing and, by extension, the people who call it their home.” Read More Watch Serial Killer with Piers Morgan trailer as Alejandro 'Alex' Henriquez speaks out for first time in 30 years\nBut the finer print of the announcement shows the cash is for “affordable and social” homes - meaning not all of them will shorten council waiting lists.\nAnd Mr Brokenshire admitted the money only “becomes available from 2022”, after the next general election, and will fund a period stretching as far as 2028/29.\nHousing associations welcomed the cash, with the National Housing Federation saying the shift to long-term funding was “a total step change”. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-19T13:26:00.000+03:00", "crawled": "2018-09-19T15:12:34.021+03:00", "highlightTitle": ""}