{"organizations": [], "uuid": "96184d0b296a692106148cb6352f347a65908f9c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/special-features/article1989701.ece/ALTERNATES/s1200/1_GettyImages-473447822.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/special-features/your-company-best-place-work-1989617", "country": "GB", "domain_rank": 48128, "title": "Is your company the best place to work in Leicestershire? - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-12T03:00:00.000+03:00", "replies_count": 0, "uuid": "96184d0b296a692106148cb6352f347a65908f9c"}, "author": "Leicestershire Live", "url": "https://www.leicestermercury.co.uk/special-features/your-company-best-place-work-1989617", "ord_in_thread": 0, "title": "Is your company the best place to work in Leicestershire? - Leicestershire Live", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Sponsored Is your company the best place to work in Leicestershire? New Leicester Mercury competition sponsored by Maloy & Flynn aims to find the companies that do the most for their staff in Leicestershire Share Is your company the Best Place to Work in Leicestershire? Get Daily\nIs your company the Best Place to Work in Leicestershire? Now is the time to prove it.\nA search to find the best workplaces in the region has been launched by The Leicester Mercury with companies being urged to tell us what they do to make them a great employer.\nThe initiative ties in with the fact that we are having a recruitment crisis in the run down to Brexit. It is harder than ever to find good staff and the best talent will be attracted to the best companies to work for.\nA magazine outlining Leicestershire's Best Places to Work will be published in The Leicester Mercury on November 27 and will be launched at a breakfast event at the Mercure Hotel, where we will give awards for the large, medium, small and not for profit business winner, best boss, best perk and best community involvement.\nLeicester Mercury business editor Tom Pegden said: “There are lots of awards for the region’s best companies, or the biggest or the fastest growing.\n“What we want to celebrate here is the companies that go out of their way to make their workplaces great places to come to every day.\n“It might be perks for staff, efforts to provide a good work-life balance, or it could be the role a company plays in its local community.\n“If you think your company is a great place to work, we want to hear from you.”\nThe initiative, which is FREE to enter on our website, asks for information on factors such as staff development, perks and bonuses, community involvement and staff development. Is your company the best to work for? Nominate them here\nThe initiative is partnered by agency Maloy & Flynn, which is at the forefront of recruitment and understands first hand what a good place to work looks like.\nClosing date for nominations is October 10. Like us on Facebook", "external_links": [], "published": "2018-09-12T03:00:00.000+03:00", "crawled": "2018-09-13T00:15:43.006+03:00", "highlightTitle": ""}