{"organizations": [], "uuid": "f087024877667224da0e0311621cab86c62d8f90", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15135808.ece/ALTERNATES/s1200/0_JS162110573.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15135813", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Apple rumoured to be ready to launch three new iPhones", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-11T10:30:00.000+03:00", "replies_count": 0, "uuid": "f087024877667224da0e0311621cab86c62d8f90"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15135813", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Apple rumoured to be ready to launch three new iPhones", "locations": [], "entities": {"persons": [{"name": "jonathon manning", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "apple", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Mike Ashley’s luxury fashion chain Flannels is opening its first store in Newcastle .\nRenovation work is now under way at the former Clas Ohlson retail unit, on Northumberland Street, to convert the property into a Flannels store.\nSignage has been placed around the entrance to the building - located between H&M and WH Smith - announcing that the store will open next year and that the company is looking for staff.\nFlannels sells more than 150 brands of luxury branded clothing for men and women. It stocks items from designers such as Barbour, Calvin Klein, Gucci, and Jimmy Choo.\nThe new store will the first to be opened in Newcastle, although Flannels does have branches in the Metrocentre, Sunderland and Middlesbrough.\nIn total Flannels currently operates 18 stores, although it plans to open two more in Doncaster and Merry Hills, along with the Newcastle branch.\nFlannels is owned by billionaire businessman Mike Ashley, who also owns Sports Direct and Newcastle United.\nLast month ChronicleLive revealed that Sports Direct had purchased the Northumberland Street site for £31.6m, making it the region’s biggest property deal this year. The 90,000sq ft building was purchased from Aberdeen Standard Investments. Flannels is opening a new store on Northumberland Street in Newcastle (Image: Jonathon Manning) 9:07 Jonathon Manning Unilever confirms December date for shift from London to Rotterdam\nconsumer goods giant Unilever has confirmed that it expects to ditch its London base in December as it prepares to move to the Netherlands.\nThe group, which owns Dove soap and Marmite, said it will put its plans to a vote at its general meetings on October 25 and 26. It intends to move by Christmas Eve.\nHowever, reports claim the company is still working to convince investors that the relocation is the right move, and could face a shareholder revolt.\nUnilever announced in March that it planned to “simplify” from two legal entities into a single one incorporated in Rotterdam.It dealt a major blow to the UK Government and its efforts to uphold Britain’s status as a centre for business after Brexit.But Unilever has insisted the move to Rotterdam has “nothing to do with Brexit”.It also said at the time its 7,300 workers the UK and 3,100 in the Netherlands will be unaffected by the changes. A Unilever sign KEY EVENT JD Sports shrugs off weather hit and tough market to post profit hike\nJD Sports has revealed record half-year results after its profits jumped by 19% despite a tough retail market.\nThe sportswear chain - which owns Blacks and Go Outdoors - saw its pre-tax profits soar to £121.9m in the six months leading up to August 4.\nTotal like-for-like sales increased by 4% due to a boost from its online store. However, its outdoor brands, which includes outlets such as Millets, had a difficult first half after the summer heatwave dented demand.\nJD Sports said:\nAfter a promising first quarter when our outdoor fascias benefited from the late winter, they have all had an extremely challenging second quarter with good growth in sales of lightweight shorts and T-shirts nowhere near able to compensate for a significant and understandable decline in jackets and other waterproof apparel.\nPeter Cowgill, executive chairman of JD Sports, said:\nAgainst a backdrop of widely reported retail challenges in the UK, it is extremely reassuring that the profitability in the UK and Ireland sports fascias has been further enhanced.\nThis reflects the value of the investments that we have made over a number of years in developing a dynamic multi-channel proposition which marries the best of physical and digital retail. JD Sports at the Silverlink in North Tyneside (Image: Google) 8:57 Jonathon Manning Hyperdrive Innovation named 'one to watch' in The Sunday Times TechTrack100\nSunderland battery manufacturer Hyperdrive Innovation has been named as “one to watch” in a list of the fastest growing UK tech companies.\nHyperdrive Innovation develops battery packs that can be used to power electric vehicles, homes, and businesses.\nSince being founded in 2012, the company has grown its sales to £4.9m, and is forecasting that this figure will soon rise to £7.6m.\nIts growth has led it to be named as a company to watch in the Sunday Times’ TechTrack100, which ranks the UK’s fastest growing independent technology firms.\nFirms are eligible to be nominated for the table if they have seen their sales grow from over £250,000 to more than £5m over the last three years.\nNo companies from the North East were named in the main league table, and Hyperdrive Innovation was the only firm from the region to be named in the Ones to Watch category, having not met the criteria for the main table.\nStephen Irish, founder and commercial managing director at Hyperdrive Innovation, said:\nEveryone at Hyperdrive is delighted to be recognised as one of the companies to watch by TechTrack100. Over the last few years, increasing demand for our world-leading battery technology has seen us grow our customer base in the UK and around the world.\nWe are working with blue-chip companies on a variety of different projects, demonstrating the flexibility of our technology, including an online grocer to power robots in its warehouses and a global provider of home and commercial energy storage systems. We have more exciting plans for the future, including doubling the size of our manufacturing facility in Sunderland. 8:52 Jonathon Manning Oil and gas industry at a crossroads and needs right investment, report warns\nThe oil and gas sector is at a crossroads and needs the right investment conditions to secure its long-term future, according to industry chiefs.While production remains strong, there is “serious concern” around the longer-term impact of low rates of drilling, the Oil & Gas UK economic report 2018 has found.A 50% decline in drilling activity over the last five years has raised “real concern” about the ability of the industry to realise its potential.The report found that production remains strong and by the end of 2018 could be 20% up on five years ago while operating costs have stabilised and are now being sustained at around $15 (£11.59)/barrels of oil equivalent.The body is calling for more capital investments to be committed to the UK Continental Shelf.Oil & Gas UK chief executive Deirdre Michie said the industry is at a crossroads and that choosing the correct direction of travel is “critical” to securing the organisation’s vision for the future.She said:\nIndustry is emerging from one of the most testing downturns in its history. However, the steps that have been taken by industry, government and the regulator have delivered tangible results.\nDespite the improvements seen in recent years, we find ourselves at a crossroads.\nRecord low drilling activity, coupled with the supply chain squeeze, threaten industry’s ability to effectively service an increase in activity and maximise economic recovery.\nThe UK Continental Shelf is a more attractive investment proposition - our challenge now is to take advantage of this.\nWe have to drive an increase in activity while continuing to find and implement even more efficient ways of working which support the health of supply chain companies whilst also keeping costs under control.\nIt shows that investment conditions remain key to the long-term future of the North Sea industry.\nFour exploration wells and five appraisal wells were spudded (the process of beginning to drill a well) in the first eight months of this year, compared with five exploration wells and one appraisal well in the first half of 2017 and 23 across the whole of last year.Even with more wells to come, total exploration activity this year is expected to be the lowest since 1965, the report found. An oil rig in the North Sea (Image: PA) 8:47", "external_links": ["https://www.facebook.com/groups/336954976787763", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15135813;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-09-11T10:30:00.000+03:00", "crawled": "2018-09-11T10:43:36.000+03:00", "highlightTitle": ""}