{"organizations": [], "uuid": "f1c7b4a4cdf394bcb4738ee356c4453c90d13fb2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13214937.ece/ALTERNATES/s1200/4_JS111107733.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15201222", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Trouble toymaker Hornby misses sales targets", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-26T10:00:00.000+03:00", "replies_count": 0, "uuid": "f1c7b4a4cdf394bcb4738ee356c4453c90d13fb2"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15201222", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Trouble toymaker Hornby misses sales targets", "locations": [], "entities": {"persons": [{"name": "booho", "sentiment": "negative"}, {"name": "hornby", "sentiment": "negative"}, {"name": "mahmud kamani", "sentiment": "none"}, {"name": "carol kane", "sentiment": "none"}], "locations": [{"name": "usa", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Mitie sees revenue grow, but earnings held back\nOutsourcer Mitie has said half-year earnings are set to remain flat or edge lower amid a “highly competitive” market and as the group invests to boost revenues.The firm, which is in the second year of an overhaul, said overall good underlying earnings progress was being held back by its social housing, cleaning and care and custody divisions.Shares dropped as much as 8% after the update, despite Mitie’s assurances that revenues are growing and earnings are in line with its expectations.The group said revenues are set to lift by around 2% to 3% over its first half to September 30 and that it is on track for a “modest” rise in turnover for the full year.But Mitie said its order book had fallen slightly since the financial year-end, even though it has secured a number of recent “significant wins”.Chief executive Phil Bentley said:\nThe majority of our businesses are performing well and our larger contracts are delivering solid growth in volumes and profitability.\nWe are maintaining our full-year guidance as project work volume is increasing, our in-year sales wins are growing, and like-for-like revenue growth has strengthened in the second quarter.\nHe added:\nThe environment in our industry remains highly competitive, especially when it comes to contract renewals.\nMr Bentley is leading a turnaround plan to eventually slash annual costs by £50m by 2020.The group expects to reduce annual costs by around £40 million in the current financial year.Mitie was forced to launch the wide-ranging overhaul following a string of profit warnings amid a torrid time for outsourcing firms following the collapse of Carillion in January.Under the plans, Mitie is simplifying its corporate structure, outsourcing and automating some back office functions, merging its London offices into one and also investing to increase its technology capabilities.\nMr Bentley added:\nWe see technology, especially in our core businesses, playing an increasingly important part in differentiating our service delivery and improving margins, and therefore we are continuing to invest in the ‘Connected Workspace’ to accelerate growth. Phil Bentley, CEO of Mitie 9:07 KEY EVENT Major plans for housing on both sides of Tyne put forward by Hadrian's Tower developers\nHundreds of flats are to be built at two key sites overlooking the Tyne by the company currently working on Newcastle ’s tallest tower block.\nThe Brett Oils site, close to the Swing Bridge in Gateshead , and land on Pottery Lane, close to the Metro Radio Arena in Newcastle, are being acquired by the High Street Group of Companies to build around 450 apartments for the private rented sector (PRS).\nThe High Street Group, which is based in Newcastle, has been at the forefront of a drive to create more PRS apartments around the UK, with a number of developments in big cities including Manchester and Birmingham.\nIt is also building Hadrian’s Tower, a 27-storey tower block off St James’ Boulevard which will be the city’s highest building when it opens in 2020.\nThe company’s proposed Brett Wharf development, which would be built on the former Brett Oils site, would be made up around 200 one and two-bedroom flats in two buildings. Initial plans suggest the buildings would be around five storeys, though the buildings could be slightly higher.\nThe company says the site is “perhaps the last prime development site in the heart of the Newcastle Gateshead Quayside with direct river frontage” and aims to create “a place that people will be proud of and are keen to support”. CGI of planned flats development at Brett Oils site in Gateshead (Image: Copyright unknown) 8:56 Jonathon Manning Corbyn aims to create 400,000 skilled jobs through 'green job revolution'\nLabour leader Jeremy Corbyn is set to denounce “greed-is-good capitalism” as he set out plans for a radical reshaping of the UK economy.\nA the Labour Party Conference today Mr Corbyn is set to announce plans to create 400,000 jobs as part of a “green jobs revolution”.\nCorbyn will say Britain needs a Government “committed to investing in renewables, in jobs and in training” and will promise large-scale public and private investment in wind and solar power, as well as subsidies to make all homes energy efficient.Changes to planning guidance will aim to encourage private investment to double onshore wind power over 12 years, while offshore wind will be increased sevenfold and solar power threefold.Mr Corbyn’s speech comes at the end of a four-day conference which has been dominated by Brexit, but has seen the Labour leader and shadow chancellor John McDonnell set out a range of policies to reverse inequalities in wealth and economic power. Jeremy Corbyn (Image: PA) 8:47 Jonathon Manning Top North East pub South Causey Inn adds hot tub rooms and hires 10 more staff\nThe South Causey Inn has invested a £450,000 to create two new hot tub houses and open a new antique shop on site.\nThe family-run pub and hotel is known for its themed guest rooms, including its American Trilogy room, Hadrian’s Village and a 1960s London bus.\nBy investing the six-figure sum into the business, the company has added to its rooms by building two new two-storey hot tub houses.\nEach room includes a large indoor hot tub along with a treatment room where guests can book beauty treatments.\nThe Stanley-based business has also opened an onsite antique and vintage store.\nThe investment has led to the company hiring 10 new members of staff, taking its headcount to 110.\nPhilip Moiser, co-owner, said:\nThe last couple of years have seen significant changes and investment. The decision to provide accommodation offering houses to sleep up to 10 guests have proved very popular with both families and ladies’ pamper parties.\nIt offers visitors to the region a cost effective way for large parties to enjoy local attractions, such as Beamish Museum.\nWe regularly are asked about the unusual vintage decor in the rooms and within the hotel, therefore we decided to open an onsite store, Raine and James, which will be managed by my daughter, Harriet Moiser.\nThe store opens at 9.30am on Saturday.\nMs Moiser added:\nThis is an exciting new chapter in the hotel which I’m delighted to be involved with. The items sourced are all unique and can’t be found on the high street. South Causey Inn in County Durham 8:40 Jonathon Manning Call to tackle workplace discrimination against pregnant women\nEmployers and colleagues are being called upon to support pregnant women in the workforce, after a survey found that one in five managers admit whether a woman is pregnant affects their decision about whether to promote them.\nThe same number said that pregnancy is frowned upon in their organisation within the first year of employment.\nThe poll of over 800 managers also showed that some employers admitted that women were taken less seriously in their workplace when they returned from maternity leave.\nYoung Women’s Trust chief executive Carole Easton said:\nThe level of discrimination that Young Women’s Trust has uncovered against young mothers who are in work or looking for jobs is shocking.\nIt is in everyone’s interest to help young mothers who want to work.\nThey have a huge amount to contribute to their workplaces and many want to be financially independent and support their families.\nTackling discrimination would benefit young mums, businesses and the economy as a whole.\nEmployers should value young mums’ contributions to their workplaces and do more to accommodate them, including by offering more flexible and part-time working opportunities.\nA Business Department spokesman said:\nThe law is absolutely clear, it is illegal to discriminate against women in the workplace who are pregnant or new mothers.\nWe’re improving advice and guidance for employers on pregnancy, maternity rights and obligations, and reviewing redundancy protection legislation to see whether it remains sufficient. Job interview gone wrong (Image: iStockphoto) 8:36 Jonathon Manning 150 workers to leave County Durham train factory as contracts come to an end\nAround 150 workers are set to leave Hitachi Rail Europe’s North East factory when their contracts end this year.\nThe train manufacturer has confirmed that 150 workers at its Newton Aycliffe factory will leave the firm when their temporary contracts come to an end in December.\nOver the last two years, Hitachi’s North East factory has been building 122 Intercity Express trains - capable of travelling at 125mph - to be used on the Great Western and East Coast main lines.\nBut demand for the factory’s trains is set to fall next year and the company no longer has need for the temporary staff.\nA spokesman for Hitachi Rail Europe said:\nIt was always in our plan to have a number of people on fixed term contracts to allow our business to flex according to demand.\nThese fixed term contracts were until 31st December 2018. As we had two projects running concurrently we needed this extra support.\nThe company added that the factory was always going to have 750 permanent jobs and it is not looking to rehire the contractors into permanent positions.\nHowever, the firm did add that it may need to take on more contractors in the future if demand increases. Intercity Express trains at the Hitachi Rail Europe site in Newton Aycliffe (Image: Getty Images Europe) 8:23", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15201222;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-09-26T10:00:00.000+03:00", "crawled": "2018-09-26T10:25:09.022+03:00", "highlightTitle": ""}