{"organizations": [], "uuid": "13f2750bf1983d4e363ac6174d58c6ab75d9dab7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15120912.ece/ALTERNATES/s1200/0_IBP_NEC_060918convention_11JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-council-leader-nick-forbes-15120782", "country": "GB", "domain_rank": 21960, "title": "Newcastle council leader Nick Forbes: Why the North must take control of its own destiny", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-06T19:47:00.000+03:00", "replies_count": 0, "uuid": "13f2750bf1983d4e363ac6174d58c6ab75d9dab7"}, "author": "Daniel Holland", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-council-leader-nick-forbes-15120782", "ord_in_thread": 0, "title": "Newcastle council leader Nick Forbes: Why the North must take control of its own destiny", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Daniel Holland Local Democracy Reporter 17:47, 6 SEP 2018 Newcastle City Council Leader Nick Forbes at the Convention of the North in Gateshead (Image: Newcastle Chronicle)\nLeaders have urged the North to take control of its own destiny, instead of waiting for London to notice if things are going wrong.\nHundreds of delegates from across the region came together at the Baltic on the Gateshead Quayside for the inaugural Convention of the North, setting out their vision for the region’s future.\nNewcastle City Council leader Nick Forbes told the crowd of political figureheads, employers, community leaders, cultural groups and unions that the North could no longer portray itself as the “victim” and needed the powers to become its own Brexit taskforce.\nHe said: “We want a north that is empowered enough to play its part in any post-Brexit landscape.\n“It is important not to undersell ourselves anymore. Newcastle City Council Leader Nick Forbes at the Convention of the North in Gateshead (Image: Newcastle Chronicle)\n“For example, if the north were a country our £304bn economy would make us the 10th largest nation in Europe.\n“We are a part of the UK whose combined economic might outweighs the combined economies of Wales, Northern Ireland and Scotland - yet we don’t even have as big a say over our destiny as London, let alone the other devolved nations.”\nCoun Forbes urged delegates to “push further and faster” on devolution and to “shake up the system”.\nHe added: “There is no reason why the mechanics of government are best done from a square mile in London, or why the media have to be based in one city, or why we redistribute funds based on a system which rewards those who are already successful.\n“A new relationship with central government, a fresh look at the constitutionally accepted way of doing things, a warning that things cannot be the same after Brexit. It’s that level of boldness we need to be reaching for. Read More Brexit could help narrow the North-South divide says survey\n“A demand for a North empowered enough to be its own Brexit task force, no longer dependent upon central government to eventually notice and step in.”\nKeynote speaker Nigel Wilson, chief executive of Legal and General, said it was important “not to envy London but to emulate and indeed better what has been achieved there”. Mayor of Greater Manchester, Andy Burnham, at the Convention of the North in Gateshead (Image: Newcastle Chronicle)\nHe added: “History will judge us all badly if we miss this wonderful opportunity.”\nGreater Manchester mayor Andy Burnham called the inaugural convention - during which delegates debated topics including transport and jobs - the most exciting event of his political career. Read More Report reveals the truth about the North-South transport funding gap - and it isn't pretty\nHe said: “We have to get rid of this feeling that if you want to get on in life you have to leave the North. If we break that then we are really making progress.”\nLord Shipley, a former Lib Dem leader of Newcastle City Council, warned against picking a fight with the capital.\nHe said: “I don’t think it is a good idea to be seen to be attacking London. London is actually producing the tax revenues, some of which are being spent in the North.\n“Secondly, it has been incredibly good at forward planning. Crossrail was being discussed in the 1980s. London has been able to get a grip on its forward planning. Hopefully, Transport for the North will be doing likewise.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-06T19:47:00.000+03:00", "crawled": "2018-09-07T00:07:37.002+03:00", "highlightTitle": ""}