{"organizations": [], "uuid": "2414d1680d001b051c1aa89775efd5e0445a2c59", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1989727.ece/ALTERNATES/s1200/0_TimSmitJ27.jpg", "site_section": "http://www.middevongazette.co.uk/news.rss", "section_title": "Devon Live - News", "url": "https://www.devonlive.com/news/devon-news/building-devons-eden-project-would-1989342", "country": "GB", "title": "Building Devon's own Eden Project would transform the county", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-11T10:57:00.000+03:00", "replies_count": 0, "uuid": "2414d1680d001b051c1aa89775efd5e0445a2c59"}, "author": "Rom Preston-Ellis", "url": "https://www.devonlive.com/news/devon-news/building-devons-eden-project-would-1989342", "ord_in_thread": 0, "title": "Building Devon's own Eden Project would transform the county", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}, {"name": "tim smit", "sentiment": "none"}, {"name": "tim", "sentiment": "none"}], "locations": [{"name": "cornwall", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "eden project", "sentiment": "none"}, {"name": "building devon", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "agm", "sentiment": "none"}, {"name": "university of exeter", "sentiment": "none"}, {"name": "junction", "sentiment": "none"}, {"name": "arboricultural association", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Building Devon's own Eden Project would transform the county The scheme would create 1,200 new jobs if it goes ahead Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThe proposed £200m 'mini' Eden Project at Junction 27 on the M5 will do more for Devon than the world famous tourist attraction benefited Cornwall.\nThat is the view of Eden Project co-founder Sir Tim Smit, who says he is aiming to put the county on the map for its food and farming with the scheme.\nThe major development near Tiverton will include a hotel, visitor hub, artificial surfing lake, food hall, cafes and restaurants and shops with the Eden Ark at its centre. Read More\n\"This project can do even more for Devon than the Eden Project has done for Cornwall,\" said Sir Tim, speaking ahead of a keynote speech at the Arboricultural Association's AGM at the University of Exeter.\n\"Remember that Cornwall was already a visitor destination.\n\"What we did was to draw together some of the best elements of the destinations and give it some rock 'n' roll in a scientific context. Sir Tim Smit at the Eden Project\n\"Here you're talking about a county that's almost world famous for its leisure and agriculture and could really do with the boost of the brand enhancment.\n\"Mid Devon is just the best place in the country to do this.\n\"If I was a religious person I'd get down on my knees and say do this for the young people who are coming through.\" Read More Glastonbury ticket registration change all festival-goers need to know about\nThe Eden Project is currently working on projects in China, New Zealand and Australia, but Sir Tim said the Junction 27 remains a key priority for the brand.\nHe pointed towards Devon's image as a leading region for farming and local produce as the reason why.\n\"If you were to do a survey around Britain and ask what county represents the idea of idyllic agriculture then I think it would be Devon,\" he said.\n\"It's the number one spot. The Eden Westwood plans for J27 feature a surf lake, far left.\n\"There's about to be a huge revolution in agriculture and a post-Brexit settlement.\n\"Agriculture is going to be extremely important, not only to our economy, but also to our food security and our diverse economic activities.\n\"So we are looking for the place to be the HQ and the shop window for agriculture in UK, it would be in mid-Devon.\n\"If you were trying to look for a dream ticket in a world where you were trying to not use motor cars so much then you would have a railway station right in the middle of it.\nWatch a video below of Wavegarden's surfing reef Video Loading Click to play Tap to play The video will start in 8 Cancel Play now Devon mead sales up 30 per cent thanks to Game of Thrones\n\"If you look at a map Junction 27 is the gateway into Devon as a whole.\n\"Much like in Cornwall there is very visible wealth in certain places which disguises the fact that there is an awful lot of under used resources and deprivation in much of the county.\n\"The word unique is overused but this is a unique opportunity with one blow to revolutionise leisure, tourism and the science of agronomy in just one place.\" A surfer tries out an artificial Wavegarden reef - similar to that proposed for junction 27 of the M5\nJunction 27 is a partnership project by the Eden Project and investors Friends Life, part of the Aviva Group, which also built Queen Street Dining at Exeter’s Guildhall.\nThe Eden Project has boosted the economy in Cornwall by more than £1.8b since it launched in 2001 and it hoped that a similar project would act as a catalyst for more investment in Devon.\nBut despite potentially bringing 1,200 new jobs to the local area it has faced criticism for being built on open farmland.\nA subject that Sir Tim is bullish about in his response. Read More Vet reveals the heartbreaking thing pets do in their final moment\nHe said: \"When you travel across Britain, I think nine per cent of the country is built on and you have to ask the question, do you have a sense of optimism about your geography? Or do you not?\n\"If you want the land to be owned by people who retire, and that's all that happens there, then fine go ahead and don't do the Eden Project or this place.\n\"If you actually want a place that gives you hope, that creates a vision of jobs for the future and a sense of real excitement about the innovation that's going to take place there then you sacrifice a little bit of farmland. An artist's impression of how the J27 Eden Westwood development could look\n\"I know I should sound apologetic but I'm not apologetic because I think the end in this case totally justifies the means.\"\nThe Junction 27 project has been in the planning since 2002 with Eden Project joining the scheme in 2015.\nThe proposals will be discussed by the planning inspector at a two-day examination of Mid Devon District Council's local plan starting on September 20 after the original date was delayed a year ago . Read More\nIf the local plan is approved then it will pave the way for the Eden Westwood team to submit a planning application for the scheme.\n\"I am very confident that the planning inspector will make the right decision,\" added Sir Tim. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://www.middevon.gov.uk/residents/planning-policy/local-plan-review-examination/"], "published": "2018-09-11T10:57:00.000+03:00", "crawled": "2018-09-11T12:16:21.005+03:00", "highlightTitle": ""}