{"organizations": [], "uuid": "7a95df115862c66890e3cad5941dd6d26c8dad98", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12944836.ece/ALTERNATES/s1200/1_JS100810459.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15160562", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Boohoo poaches top Primark boss to become new CEO", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-17T10:10:00.000+03:00", "replies_count": 0, "uuid": "7a95df115862c66890e3cad5941dd6d26c8dad98"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15160562", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Boohoo poaches top Primark boss to become new CEO", "locations": [], "entities": {"persons": [{"name": "boohoo", "sentiment": "negative"}, {"name": "adam marshall", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "primark", "sentiment": "negative"}, {"name": "coreena ford business", "sentiment": "negative"}, {"name": "bcc", "sentiment": "none"}, {"name": "chambers of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Business group downgrades growth forecasts\nA leading business group has downgraded its forecast for economic growth as uncertainty over Brexit hits investment and trade.\nThe British Chambers of Commerce (BCC) predicted growth of 1.1% this year, down from 1.3% and 1.3% in 2019, from 1.4%.\nBy 2020 the UK economy will have suffered its second weakest decade of average economic growth on record, said the BCC.\nThe high cost of doing business in the UK and ongoing uncertainty over the UK’s future relationship with the EU are expected to continue to stifle business investment, said the report.\nThe labour market is expected to continue to be a source of strength for the economy, with the unemployment rate predicted to remain close to its record low. But the BCC said businesses will continue to face “significant” skills gaps, undermining their potential to grow, while workers are unlikely to experience meaningful real wage growth as the gap between pay and price growth is forecast to remain negligible.\nDr Adam Marshall, director general of the BCC, said: “Despite strong performances by some firms, the UK economy as a whole is set to grow at a snail’s pace.\n“Brexit uncertainty continues to weigh heavily on many firms, as most of the practical questions facing trading businesses remain unanswered. The lack of precision on the nature of the UK’s future relationship with the EU is lowering expectations for both business investment and export growth.\n“The drag effect on investment and trade would intensify in the event of a ‘messy’ and disorderly Brexit. Businesses need the Brexit negotiations to deliver clarity, precision and results at pace over the coming weeks.” A woman polishes a flag pole at the Council of the European Union (Image: Getty Images Europe) 8.50 KEY EVENT Newcastle aims to become digital city to head next industrial revolution\nNewcastle is leading a new industrial revolution with a growing reputation as a centre for digital, software and technological innovation and entrepreneurial spirit.\nThe city is not a newcomer to this frontrunner position and has long been known as a centre of innovation and technological advancement.\nFrom the first industrial revolution which saw the birth of Swan’s electric light bulb and Stephenson’s development of the Rocket to the present day, Newcastle has been at the forefront of industrial innovation – today, it is digital.\nNewcastle in 2018 boasts the highest growth rate of digital starts ups and ranks in the top three UK cities for digital salaries outside of London.\nBut what does this actually mean for the people and businesses in the city? NE1 Ltd, the business improvement district company for Newcastle City Centre, has made Digital and Smart Cities a cornerstone of its business plan for BID renewal this autumn. We are pushing for the primary objective of any digital and Smart Cities agenda for the city to be people-focused and problem led.\nChief executive Adrian Waddell said: “It is vitally important for the city’s future, its economic development and success that Newcastle’s digital infrastructure is efficient, effective and capable of being scaled up to meet future demand.\n“For businesses to remain in the city, and for new ones to invest here, they all need to be able to do business without digital impediment – this is true for all businesses, not just those in the digital sector. All companies need the internet to be fast, efficient, cost effective and resilient and for this digital connectivity to extend beyond the office walls.” Adrian Waddell (Image: Supplied pic. Free to use.) 8.43 Coreena Ford Bede Gaming wins big with US lottery company\nA Newcastle software firm has struck a major deal with one of the world’s biggest lottery companies that will see it launch its first products in North America.\nBede Gaming has been selected to supply the Ontario Lottery and Gaming Corporation (OLG) with a new digital platform.\nThe deal will see Bede Gaming bring new products and games to Ontario and marks the company’s first entry into both the North American and lottery markets.\nOLG is the third operator to select the Newcastle-based company’s gambling platform in 2018, following the signing of Sun International Group and LeoVegas, which acquired Bede-powered Rocket X earlier this year.\nAlex Butcher, managing director of Bede Gaming, said: “I’m absolutely delighted to welcome OLG to Bede and am extremely proud of the team effort involved in bringing this agreement to fruition. It is a huge recognition of the strength of our offering and firm proof of our status as a leading gaming platform in the industry.\n“This is a landmark contract win for Bede and testament to the technology that is being produced in the North East. We are looking forward to supporting one of the most respected names in the worldwide lottery sector in achieving digital excellence.” Alex Butcher, managing director at Bede Gaming (Image: Unknown) 8.35 KEY EVENT Robot bricklayers to descend on Brexit Britain\nArmies of robot bricklayers could become a common sight in Brexit Britain as construction firms turn to machines to make up for the loss of skilled labour from mainland Europe.\nThe UK’s construction sector is more receptive than any other in the world to the use of robots and drones on building sites, according to new research from Altus.\nA survey of over 400 major property developers carried out by the group showed that 47% of UK firms predict that construction site robots will bring disruptive change, compared with just 34% of companies globally.\nBritish developers were also more likely to see the potential for using drones on construction sites, with 41% predicting major disruptive change, compared with 28% globally.\nAltus Group director Ian Wimpenny said: “With EU net migration having fallen to its lowest level since 2012, and record employment, contractors are already struggling to fill vacancies and close skills gaps, so it’s unsurprising that UK developers are more open to disruptive technologies to keep Britain building post Brexit.”\nRobots are already common in car manufacturing, and trials of robotic bricklayers on building sites are already underway.\nThe robots’ manufacturers claim they can lay 3,000 bricks a day, compared with the typical 300-600 bricks for a human bricklayer. Drones, meanwhile, are used for surveying, inspections and progress monitoring. Armies of robot bricklayers could become a common sight in Brexit Britain as construction firms turn to machines to make up for the loss of skilled labour from mainland Europe, a report claims. 8.30 Coreena Ford Profits plummet at Finsbury Food Goup\nCake and bread manufacturer Finsbury Food Group has reported as 65.7% drop in annual pre-tax proftis to £4.5m as group revenue fell 3.4% to £303.6m.\nThe company said it was hit by “significant one-off closure costs” after shuttering its loss-making Grain D’Or factory.\nExcluding that division, revenue was up 2.4% at £290.2m while pre-tax profit rose 4% to £17.2m.\nChairman Peter Baker said:\nThe overall story from the year is one of a stable trading performance by the group, delivered in the face of unprecedented cost inflation of commodity inputs, especially butter.\nWe have achieved a like-for-like top-line and underlying bottom-line growth despite this cost pressure, and in a rapidly changing market.\nThis not only demonstrates our resilience, but also that we have the operational abilities to adjust, keep our strategy on track, and achieve the financial performance expected by our investors.\nFinsbury Food Group shares were down 0.3% in morning trading. 8.26 KEY EVENT Shares windfall for Tekmar Group employees\nNorth East manufacturer Tekmar Group has announced it is giving eligible employees £300 worth of free shares for each year of service as part of a new Share Incentive Plan.\nThe Newton Aycliffe firm - which manufactures protection system for subsea cables and umbilicals - has issued and allotted a total of 42,691 new ordinary shares of £0.01 each in the company, which have been purchased at nominal value by the Tekmar Group plc Employee Share Incentive Plan.\nLast month the company invited eligible employees to participate in an HMRC approved Share Incentive Plan (SIP), a tax efficient share incentive plan whereby eligible employees with over 1 year’s continuous service at the Award Date received £300 worth of free shares for each full year of service, capped at 7 years maximum entitlement.\nThe SIP Shares are held in trust for a minimum holding period of three years and there is a forfeiture period of three years during which employees who participated in the SIP will lose their Award if they resign or are dismissed from their employment.\nApplication has been made for the SIP Shares to be admitted to trading on AIM (“Admission”) and it is expected that Admission to AIM will become effective on or around 20 September 2018. Offshore technicians assembling Tekmar's patented TEKLINK cable protection system during offshore installation on an offshore wind farm (Image: Unknown) 8.15 Coreena Ford What's the FTSE and pound latest?\nThe pound at 8am was 1.3080 dollars compared to 1.3083 dollars at the previous close. The euro at 8am was 0.8891 pounds compared to 0.8911 pounds at the previous close.\nThe FTSE-100 index opened at 7304.04. 8.10 Coreena Ford Brexit will be bad for us, say more than half of North East businesses\nAlmost half of companies in the North East are not ready for Brexit – and even more think it will be bad for them, a survey by the region’s largest business organisation has found.\nThe first Brexit barometer dedicated to businesses in the region has been carried out by the North East England Chamber of Commerce.\nThe survey found that 52.4% of business people in the region believe it will have a negative impact on their business, while just 14.1% see it being beneficial to them.\nConcerns raised by firms including the cost of trade, changes to standards and regulations and changes in access to EU funding. 40% of business people feel their firm is underprepared for Brexit and 7.2% feel completely unprepared.\nBrexit Secretary Dominic Raab said at the end of last week that Britain and the EU are “closing in” on an agreement on the terms of the UK’s withdrawal and their future relations.\nBut there are still fears that a no-deal Brexit could occur, which is likely to be particularly harmful to important industries like pharmaceutical and car manufacturing that are key to the North East economy.\nChamber chief executive James Ramsbotham said: “Since 2016, there has been a total lack of leadership and clarity in the negotiation process.\n“At the Chamber, we’ve been helping our members start making preparations but now, with only seven months to go, businesses are still in the dark on the realities of Brexit and are still waiting for Government to give clear answers to fundamental questions.”\nAs well as canvassing views on their readiness for Brexit, the Chamber survey gave companies the opportunity to include a message for the Government.\nThe Chamber said that the predominant theme was frustration with the lack of progress and engagement by the Government. There were also views that negotiations now needed to proceed swiftly.\nOn Friday, Brexit Secretary Dominic Raab said he had an “extended” phone call with the EU’s chief negotiator Michel Barnier to review progress in the Brexit talks. Almost 50% of North East firms are unprepared for Brexit (Image: Getty Images Europe) 8.05 KEY EVENT Boohoo poaches top Primark boss in management shake-up\nOnline fashion retailer Boohoo has poached a top boss from Primark to take over as its new chief executive as part of a management shake-up.\nThe company - which accounts for brands including Boohoo, Pretty Little Thing, and Nasty Gal - said John Lyttle would be instated as chief executive from March 15 2019.\nHe will join from Primark where he currently serves as its chief operating officer, having previously held senior roles at Matalan and the Arcadia Group.\nThe incoming boss will replace current joint chief executives Mahmud Kamani and Carol Kane.\nMr Kamani will become executive chairman, moving him away from the day-to-day running of the business, while Ms Kane stays on as group co-founder and executive director.\nCurrent non-executive chairman Peter Williams will be stepping down as a result in March 2019, with the board now planning to recruit another independent non-executive director.\nMr Lyttle could pocket as much £1.5 million per year in his new role. Boohoo confirmed he would receive an annual salary of £615,000 and an annual bonus of up to 150% of that amount. That is on top of a pension of 5% of his annual salary and a growth share plan.\n“John Lyttle’s remuneration package will be heavily related to creating premium growth in shareholder value over the next five years,” Boohoo said in its announcement.\nMr Kamani and Ms Kane said: “We have got to know John over a number of years and are convinced he has the necessary skills to complement what we already have and take the group on to its next stage of growth. “This is a hugely exciting time for the Group as the fast fashion market continues to shift online and more and more customers across the globe are joining as customers of our brands.”\nBoohoo shares were up around 1.7% at the start of trading. Boohoo co-founder Mahmud Kamani, who will become executive chairman when John Lyttle arrives at the firm More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15160562;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-09-17T10:10:00.000+03:00", "crawled": "2018-09-17T12:08:25.003+03:00", "highlightTitle": ""}