{"organizations": [], "uuid": "adbd0b0dafad247f04e8265080f0349fc19a4be7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15147189.ece/ALTERNATES/s1200/0_MFA-Bowling-Newcastle-has-closed.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/10-years-behind-times-readers-15151646", "country": "GB", "domain_rank": 21960, "title": "'10 years behind the times': readers react to Westgate Road bowling alley closure", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-14T14:43:00.000+03:00", "replies_count": 0, "uuid": "adbd0b0dafad247f04e8265080f0349fc19a4be7"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/10-years-behind-times-readers-15151646", "ord_in_thread": 0, "title": "'10 years behind the times': readers react to Westgate Road bowling alley closure", "locations": [], "entities": {"persons": [{"name": "graeme whitfield", "sentiment": "negative"}, {"name": "ju", "sentiment": "none"}, {"name": "sarah easton", "sentiment": "none"}], "locations": [{"name": "westgate road", "sentiment": "none"}], "organizations": [{"name": "mfa bowling newcastle", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "none"}, {"name": "mfa bowl newcastle", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MFA Bowling Newcastle has closed (Image: Graeme Whitfield) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nA Newcastle bowling alley that closed suddenly has faced criticism from ChronicleLive readers for falling into disrepair.\nMFA Bowl Newcastle, based on Westgate Road, closed its doors suddenly this week after operating in the area for 55 years.\nThe site, which was previously a theatre and a cinema, has been a landmark on Westgate Road for decades, with generations of families flocking to the site for entertainment.\nBut league bowlers were left with just hours to collect their belongs after staff were told they would not be allowed back on site after the alley shut its doors.\nHowever, many ChronicleLive readers were not surprised by the bowling alley’s closure, claiming that the property needed to be redecorated and had become run down. MFA Bowling Newcastle has closed (Image: Graeme Whitfield)\nCommenting on Facebook reader Sarah Easton said: “I was only there at the end of July. I used to spend many a hour as a kid hanging round it.\n“Shame, but in comparison to other places it was 10 years behind the times.”\nHer comments were mirrored by Amanda Cavanagh, who added: “I’ve used this place since I was a kid and had my son’s birthday here last year, but it went down hill. Read More Newcastle bowling alley closes - leaving bowlers with just hours to collect their balls\n“Surprised it lasted so long. It’s rotten inside and hasn’t been decorated in years. Shame, the staff were lovely.”\nMFA Bowl Newcastle has faced stark competition from more modern bowling alleys such as Lane 7 as well as another within Eldon Square shopping centre.\nTerri Toner spared a thought for the staff who worked at MFA Bowl Newcastle, pointing out that some had worked there for years.\nShe said: “It might not be nice for customers but it’s even worse for the people who worked there. They turned up for work yesterday to then find out they no longer had a job!!!\n“Some of them have worked there for over 20 years!! It’s appalling.”\nMFA Bowl’s most recent financial accounts blamed Brexit for tough market conditions in the leisure sector. But some readers found this excuse a little hard to believe.\nOne reader called Stephen said: “This is a new one, bowling club owner blames Brexit for less people turning up to play ten pin bowling.”\nAdam Stewart added: “Been trading for 55 years, that predates Britain’s membership into the EEC/EU. So how come it survived before then?” Read More Pumphrey's Bar to get upgrade under plans to transform Newcastle's Bigg Market\nOne reader claims that the business had accepted £110 from a friend to pay for children’s birthday party, but the alley closed before the party took place.\nA notice outside the bowling alley informs customers that they can contact Doncaster-based Absolute Recovery Limited if they have queries. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-14T14:43:00.000+03:00", "crawled": "2018-09-14T16:36:29.000+03:00", "highlightTitle": ""}