{"organizations": [], "uuid": "07b5daef1d616e27bbec1843c595c81a21f4eef5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15178404.ece/ALTERNATES/s1200/0_Traidcraft-boss-Robin-Roth.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/gateshead-fair-trade-pioneer-traidcraft-15178217", "country": "GB", "domain_rank": 21960, "title": "Gateshead fair trade pioneer Traidcraft at risk of closure", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-20T15:23:00.000+03:00", "replies_count": 0, "uuid": "07b5daef1d616e27bbec1843c595c81a21f4eef5"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/gateshead-fair-trade-pioneer-traidcraft-15178217", "ord_in_thread": 0, "title": "Gateshead fair trade pioneer Traidcraft at risk of closure", "locations": [], "entities": {"persons": [{"name": "robin roth", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Business Gateshead fair trade pioneer Traidcraft at risk of closure Drop in income after Brexit-inspired fall in the pound puts organisation at risk, with 68 jobs set to go Share Traidcraft in the developing world (Image: Copyright unknown) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThe Tyneside organisation that pioneered the fair trade movement in the UK could shut by the end of the year, with the loss of 68 jobs.\nTraidcraft, which was founded in Newcastle and now has a site on Gateshead’s Team Valley , has been hit by the fall in the value of the pound, with the firm particularly affected because it pays up front to suppliers - often small farming groups - in developing countries.\nThe firm said the retail crisis that has affected dozens of other shop chains has also hit its income, while it believes some customers have opted for cheaper, non-fair trade products as incomes have been squeezed.\nThe company has lost £350,000 over the summer due to the fall in the pound as it pays almost all of its customers in dollars. Robin Roth, chief executive of Traidcraft (Image: (C)The Bigger Picture Agency Ltd)\nNow Traidcraft boss Robin Roth has appealed to supporters to see if a solution can be found to the firm’s troubles, asking them to send ideas for new business models to a dedicated email address.\nHe said: “We are the sort of business that pays up front – that’s in our nature as an ethical business. So when the pound fell after the Brexit referendum, we took a hit.\n“We also stand by our published prices, so unlike other retailers we stood by our customers, absorbed a lot of the additional cost, and kept price rises to a minimum.”\nTraidcraft was formed in 1979 by former Newcastle University student Richard Adams, initially to sell jute products he had imported from Bangladesh.\nThe firm moved to the Team Valley in 1983 and sells a wide range of products - particularly clothes and food - from more than 100 producer groups based in 30 countries around the world. Read More Greggs trials click and collect breakfast service - and it could be coming to the North East next\nIt helped spread and popularise the fair trade movement, which is now a mainstream presence in many UK and overseas retailers.\nTraidcraft Exchange, the plc’s charity arm, is unaffected by the closure plans and will continue its work with producers and in campaigning and lobbying for trade justice.\nBut the loss of Traidcraft, which led to Tyneside becoming known as a key location for the fair trade movement, will be keenly felt by many of its supporters.\nAs well as its online presence and a store at its Gateshead HQ , Traidcraft has around 4,300 sellers around the country who account for around half of the firm’s revenue.\nMany of the “Fair Traders” operate from churches and schools and the company has appealed for their continuing support, saying that a good autumn is crucial if the firm is to avert the closure plans. Read More North East firms develop energy storage vehicle to restore electricity during power cuts\nMr Roth said: “We wouldn’t be in the consultation unless the situation was very serious. If there are any ideas that could help us avoid closure, we will consider them.\n“It’s important to us as a fair trade company that we didn’t just close the doors without letting people know there was a problem. We genuinely want to hear from people - we’ve set up an email address and we’ve had some interesting proposals, and I will reply to everything that comes in.\n“We’re very proud to have been in the North East. At some point somebody should put up a plaque where it began in Newcastle and we share the sadness that we might not be part of the city’s story for much longer.”\nSpeaking to The Journal earlier this year, Mr Roth spoke of his wish to re-build Traidcraft’s Gateshead HQ and to put the firm onto a proper commercial footing after a number of difficult years.\nIn his statement on the closure plans, Mr Roth asked supporters to get in touch with ideas for a future for Traidcraft at the email lovetraidcraft@traidcraft.co.uk. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-20T15:23:00.000+03:00", "crawled": "2018-09-20T15:36:09.010+03:00", "highlightTitle": ""}