{"organizations": [], "uuid": "c234d777ce6a4666a7efccd28504bd59cd48d122", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12287208.ece/ALTERNATES/s1200/0_JS90325810.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/manufacturing-vital-uks-future-after-15179863", "country": "GB", "domain_rank": 21960, "title": "Manufacturing is vital for the UK's future after Brexit, new poll says", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-21T02:01:00.000+03:00", "replies_count": 0, "uuid": "c234d777ce6a4666a7efccd28504bd59cd48d122"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/manufacturing-vital-uks-future-after-15179863", "ord_in_thread": 0, "title": "Manufacturing is vital for the UK's future after Brexit, new poll says", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "peter snaith", "sentiment": "none"}, {"name": "yougov", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "manufacturing", "sentiment": "negative"}, {"name": "womble bond dickinson", "sentiment": "none"}, {"name": "eef", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Manufacturing is vital for the UK's future after Brexit, new poll says Survey by EEF and Newcastle law firm Womble Bond Dickinson highlights importance of manufacturing Share Peter Snaith, Newcastle partner and head of manufacturing at law firm Womble Bond Dickinson Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThe Government must place a greater value on the UK’s manufacturing industry to boost the economy after Brexit, according to a new poll.\nThe survey released today has found that 79% of people believe the Government should place greater value on manufacturing.\nThe research - carried out by YouGov for manufacturing organisation EEF and Newcastle law firm Womble Bond Dickinson - also found that 69% of people believe that manufacturing is important to secure the UK’s place in the global economy, especially in the context of Brexit.\nPeter Snaith, Newcastle partner and head of manufacturing at law firm Womble Bond Dickinson, said: “Manufacturing provides enormous value to the UK economy. It is encouraging that the public’s perception acknowledges this, with widespread confidence in the manufacturing industry’s ability to solve many of the UK’s challenges. Read More Nissan to axe 200 jobs across Europe - including roles in Sunderland\n“The companies we work with are proof of this – embracing technologies to enhance their productivity in a responsible and sustainable way to enable them to compete on a global scale.”\nNearly half of those polled also believe that more money should be spent in order to train the next generation of manufacturers .\nBut despite placing a high value on the role of manufacturing, only a fifth of parents want their children to work in the sector. When asked why a third of parents blamed low pay, while a quarter do not want their children to work on a production line.\nEEF chief executive Stephen Phipson said: “It is clear that there are massive misconceptions about manufacturing although it is pleasing that the UK public feels the sector is important for the country’s economy and that Government should invest more in its future. Read More North East firms develop energy storage vehicle to restore electricity during power cuts\n“Clearly we need to continue to push Government to work with industry to invest more in creating the next generation of manufacturers to ensure we are able to maintain Britain’s impressive place in global manufacturing, and go on to improve further and grow.”\nAccording to EEF, the average pay of workers in the manufacturing sector significantly exceeds the average earning across the whole of the UK economy and services. However, only 16% of the public are aware of this. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-21T02:01:00.000+03:00", "crawled": "2018-09-21T03:06:11.033+03:00", "highlightTitle": ""}