{"organizations": [], "uuid": "2bb5846f78795d44b70411a7006b973495fddd68", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15139167.ece/ALTERNATES/s1200/0_IFP_BEM_121017Jag002JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/disaster-warning-north-east-car-15139036", "country": "GB", "domain_rank": 21960, "title": "'Disaster' warning for North East car industry if Brexit goes wrong", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-11T18:37:00.000+03:00", "replies_count": 0, "uuid": "2bb5846f78795d44b70411a7006b973495fddd68"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/disaster-warning-north-east-car-15139036", "ord_in_thread": 0, "title": "'Disaster' warning for North East car industry if Brexit goes wrong", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "theresa may", "sentiment": "none"}, {"name": "ralf speth", "sentiment": "none"}, {"name": "speth", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brussels", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "jaguar land rover", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "birmingham mail", "sentiment": "none"}, {"name": "nissan", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "'Disaster' warning for North East car industry if Brexit goes wrong MPs and Jaguar Land Rover boss warn that tens of thousands of jobs could be lost Share Dr Ralf Speth Chief Executive Officer of Jaguar Land Rover (Image: Birmingham Mail) Get business\nA North East MP has warned of “disaster” for the region’s automotive industry after the boss of Jaguar Land Rover warned Theresa May that a hard Brexit would wipe out his company’s profits and cost tens of thousands of jobs.\nAddressing a vehicle summit in Birmingham directly ahead of the Prime Minister , Prof Dr Ralf Speth described the prospect of a cliff-edge break with the EU as “horrifying”.\nHe said that if the “wrong decisions” were taken in the negotiations with Brussels, it could result in the “worst of times” for the UK while the cost to Jaguar Land Rover would be more than £1.2bn a year.\nHis stark intervention follows similar warnings from other industry bosses - including Sunderland’s Nissan - about the potentially damaging consequences of Britain’s decision to leave the EU.\nDr Speth told delegates: “If we make the right decisions this could be the best of times. If we make the wrong ones, they could be the worst of times.\n“We are absolutely firmly committed to the UK, it’s our home. But a hard Brexit will cost Jaguar Land Rover more than £1.2bn a year - it’s horrifying, wiping our profit, destroying investment in the autonomous, zero-emissions, we want to share.” Nissan Qashqai (Image: Handout)\nHe added that the loss of jobs would be “counted into tens of thousands if we do not get the right Brexit deal”.\nHis warning came as Mrs May pledged a £106m funding boost for research and development in zero-emissions vehicles.\nThe Prime Minister said it was her ambition to make Britain a leader in the green technology field, while making traffic pollution “a thing of the past”.\nBut her speech was overshadowed by Prof Speth’s intervention, which was seized upon by opponents of Brexit. Read More Newcastle Building Society to overhaul branch network by 2020\nHoughton and Sunderland South MP Bridget Phillipson, a supporter of the People’s Vote campaign, said: “The UK’s world class automotive sector is one of the crown jewels of our economy, but both the botched Brexit being pushed by the Prime Minister or a chaotic no deal Brexit being promoted by the likes of Jacob Rees-Mogg would be a disaster for the industry.\n“Hundreds of thousands of highly-skilled jobs in the automotive sector and countless others in the supply chain are being put at risk by the incompetence and recklessness of the Government’s ideological approach to Brexit, but they refuse to change course, even when the warnings are coming from huge employers like Jaguar Land Rover.\n“With time running out and the negotiations stalled, and with the risk of a no deal Brexit rising all the time, more and more people are demanding their democratic right to a People’s Vote on the terms of Brexit.” Read More Judge upholds criticism of Mike Ashley's Sports Direct\nEarlier this year, Nissan chief executive Carlos Ghosn said the company had “absolutely no clue” how Brexit would play out and that the uncertainty left him unable to make long-term decisions about Nissan’s UK operations.\nHis comments echoed similar ones made by Society of Motor Manufacturers and Traders chief executive Mike Hawes that the UK automotive sector could face “a death by a thousand cuts” as investment is cut back.\nThe automotive industry is key to the North East not just because of the 7,000 jobs at Nissan, but also the thousands of more in its supply chain, plus hopes that the International Advanced Manufacturing Park being built near the plant will be a major new source of employment. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-11T18:37:00.000+03:00", "crawled": "2018-09-11T23:01:36.016+03:00", "highlightTitle": ""}