{"organizations": [], "uuid": "b21c4ff67d4135b325476379acbefd964b9ed7c1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14748903.ece/ALTERNATES/s1200/0_JS28176091.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15210648", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Elon Musk faces regulator's wrath over 'misleading' tweets", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-28T10:00:00.000+03:00", "replies_count": 0, "uuid": "b21c4ff67d4135b325476379acbefd964b9ed7c1"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15210648", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Elon Musk faces regulator's wrath over 'misleading' tweets", "locations": [], "entities": {"persons": [{"name": "elon musk", "sentiment": "negative"}, {"name": "hoults", "sentiment": "none"}, {"name": "byker", "sentiment": "none"}, {"name": "charlie hoult", "sentiment": "none"}], "locations": [{"name": "gateshead", "sentiment": "none"}, {"name": "hoults yard", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "sunderland", "sentiment": "none"}, {"name": "saltmeadows road", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "KEY EVENT Hoults Yard creative hub expands by snapping up Gateshead business centre\nThe owner of Newcastle’s business village Hoults Yard is launching a new centre in Gateshead as part of plans to roll out its hubs across the North East.\nHoults Yard in Byker, Newcastle, was once home to the world’s biggest pottery but the Hoults family – who bought it in the late 1940s – have since transformed it into the city’s biggest workspace hub, providing office space, break-out areas, meeting rooms and studios for 700 people within 150 companies.\nNow managing director Charlie Hoult has acquired a Gateshead business centre as it rolls out plans for business centres across the region under a mission for ‘property with personality.’\nGear House will be rebranded ‘HYpoint’ - pronounced ‘highpoint’ - taking its name from its elevated position on Saltmeadows Road on Gateshead’s riverside.\nThe acquisition joins the Hoults Yard Hubs portfolio which will see 100,000 sq ft added to the firm’s footprint in the next 12 months, alongside StationH in Sunderland and Hoults Yard in Byker, with further sites to follow soon. All the branding features a play on the H and Y of Hoults Yard.\nMr Hoult said:\nThe region is in great shape, so we’re investing to create hubs for businesses to grow – underpinned by technology, property services, parking, meeting rooms, great front of house and good craic! We see how 21st century businesses operate and work hard so our model supports that.\nSaltmeadows Road is buzzing. It’s a great location close to the city centre and adjacent to projects, like Arena 2 and Northern Design Centre. Charlie Hoult outside Hoults Yard's new acquisition in Gateshead (Image: Hoults Yard) 9:10 Jonathon Manning Charity lodges super complaint over £4bn consumer 'loyalty penalty'\nCitizen Advice has lodged a super complain with the competition watchdog after finding hat customers who remain loyal to their utility providers are being penalised by £4bn a year.\nThe charity has called on the Competition and Markets Authority to “act now to stop people being exploited”.\nThe “loyalty penalty” is affecting mobile, broadband, home insurance, mortgages, and savings markets.\nIt found the loyalty penalty is on average £877 per year - equal to 3% of the average household’s total annual expenditure.\nCitizens Advice chief executive Gillian Guy said:\nIt beggars belief that companies in regulated markets can get away with routinely punishing their customers simply for being loyal. As a result of this super complaint, the CMA should come up with concrete measures to end this systematic scam.\nRegulators and Government have recognised the loyalty penalty as a problem for a long time yet the lack of any meaningful progress makes this super complaint inevitable.\nThe loyalty penalty is clearly unfair - 89% of people think it is wrong. The CMA needs to act now to stop people being exploited. Citizens Advice Bureau (Image: PA Archive/Press Association Images) 9:05 RSA blown off course by bad weather\nRSA Insurance has warned that weather-related losses in the UK have dented profits.The insurer said its UK and London business made an underwriting loss of £70m in the third quarter as it was stung by higher weather, large losses and attritional claims, particularly in its marine division.RSA said pre-tax profit in the year to date is higher than 2017 but lower on an underlying basis as a result.Boss Stephen Hester said:\nRSA’s international businesses performed well in quarter three, making strong progress against our best-in-class ambitions.\nHowever, our UK and ‘London market’ business reported an underwriting loss, which is disappointing.\nActions to improve in the UK are well under way and we are determined to restore satisfactory performance whilst continuing our progress internationally. RSA Insurance group chief executive Stephen Hester 8:57 Jonathon Manning Hundreds of Asda and Sainsbury's stores could be sold off if two firms merge\nSainsbury’s and Asda have been warned by the competition watchdog that nearly 500 of their supermarkets overlap following initial investigations into the £12bn tie-up.\nThe Competition and Markets Authority (CMA) said findings of its so-called phase one inquiry into the deal found potential competition issues for stores in 463 local areas.\nIt raised concerns over 225 Sainsbury’s stores and 238 Asda stores.\nThe revelation raises the prospect of potential widespread store sell-offs in order to see the CMA give the deal the green light.\nThe CMA last week launched the second stage of its investigation into the merger, which will create a supermarket titan bigger than Tesco, with revenues of £51bn and a network of 2,800 Sainsbury’s, Asda and Argos stores.\nIn findings of its initial inquiry and decision to refer the deal to a Phase Two probe, the CMA said:\nAt a local level, the parties’ stores overlap in several hundred local areas across the UK.\nThe CMA believes that the merger may give rise to a realistic prospect of an SLC (substantial lessening of competition) in many of these local areas if Sainsbury’s and Asda are insufficiently constrained by other local competitors.\nA spokesman for Sainsbury’s and Asda welcomed the start of the in-depth inquiry and stressed recent changes to the shape of Britain’s supermarket sector.\nHe said:\nThe grocery market has changed significantly in the last decade and is more competitive than ever, with the rise of discount formats, online grocery and food delivery businesses.\nWe look forward to working with the CMA on the Phase 2 inquiry, where we expect it to conduct a full review of the market and take these changed market dynamics into consideration. ASDA and Sainsbury's Jonathon Manning Grainger Plc finds success with private rented sector properties\nGrainger Plc has said it is on track to hit it growth targets for the 2017/18 financial year.\nThe company, which is the UK’s largest residential landlord, said it ad found success with its private rented sector work. The company’s PRS portfolio delivered like-for-like growth of 3.1%.\nIn a trading update Helen Gordon, chief executive, said:\nThe coming year will see a number of our schemes start to become income producing with over 1,300 units set for delivery across our schemes in Manchester, Bristol, Birmingham, Sheffield and Milton Keynes. We are close to completing the UK’s largest PRS development outside London, Clippers Quay in Salford, Greater Manchester. Clippers Quay will deliver 614 high quality homes for rent, with phase one of three completing today, with strong lettings interest at pricing above our underwriting levels.\nThe remainder of our pipeline projects are all on track to deliver on plan, on time and within budget. Our investment and development teams continue to focus on securing new, compelling investment opportunities in our target locations across the country, and to this end we have good visibility over a further £287m of investment opportunities which are in the advanced stages of the planning process or legal negotiations and further opportunities under consideration.\nOverall, we are very pleased with the pace of strategic progress and we look forward to generating further momentum in the coming financial year. Helen Gordon, CEO of Grainger plc (Image: Publicity Pic) 8:41 Serco upgrades profit forecast as trading improves\nSerco has upgraded its profit guidance following better-than-expected trading in the third quarter.\nThe outsourcer now expects to book a full-year underlying trading profit of £90m-£95m, up from previous forecasts of £80m, a 30%-40% hike on 2017’s figure.Additionally, revenue is set to come in at the top of the range at £2.8bn.Serco put this down to a strong performance and cost savings, as well as fewer non-recurring trading items such as end-of-contract settlements.In more good news, net debt is now expected to be towards the lower end of a £200m-£250m range.The positive update comes after Serco took a hit to sales in the first half of its financial year and warned that profitability will be knocked when it adopts healthcare contracts from Carillion.The firm has booked revenues of £1.35bn for the first half, down from £1.51bn the year before - a drop of 10.6%.Serco has been working with Carillion’s liquidators to take on some of the contracts held by the firm, which collapsed in January.The outsourcer expects to take on the service contracts for six NHS hospital sites, bringing in roughly £70 million in extra revenue for the firm.The new contracts are forecast to add around £4m to Serco’s underlying trading profit.Serco said there will, however, be an impact on net profitability for 2018 because the company will bear the cost of taking on the contracts, although there will only be a trading contribution for part of the year. Serco's offices, Bartley Wood Business Park, Bartley Way, Hook 8:35 Jonathon Manning Firms will cut investment and recruitment in no-deal Brexit, study finds\nA no deal Brexit will lead to firms cutting investment and recruitment plans, according to a new study.\nResearch by the British Chamber of Commerce (BCC) found that two out of three companies are not preparing for Brexit.\nAsurvey fo more than 2,500 firms across the UK found that one in five will cut back investment it there is no deal at the end of Brexit negotiations.\nAdam Marshall, director general of the BCC, said:\nBusinesses are clear that reaching a deal with the EU, which addresses the future terms of trade and provides certainty, must be the Government’s number one priority.\nOur evidence is clear - failure to reach a political agreement would have real-world consequences, with significant decreases in both investment and recruitment.\nLarger firms and those active in international trade would suffer the most from a disorderly and sudden exit from the EU, but there will be impacts across the board.\nMost concerning of all, a materially significant number of businesses are considering moving part or all of their operations to the EU in the event of no deal.\nGovernment must act urgently and decisively to get a comprehensive deal done. They also need to use the levers they have, such as the upcoming Budget, to ensure they provide the right conditions for growth at home. The EU flag and a Union Jack (Image: PA) 8:29 KEY EVENT Newcastle estate agents Sanderson Young goes into administration - before founder's family buys firm\nSanderson Young estate agents is set to be acquired out of administration by the family of the firm’s managing director, The Journal can reveal.\nDuncan Young founded Sanderson Young in 1997 but the company entered administration today (Thursday September 27) after falling foul of HMRC.\nThe Newcastle estate agent was issued with a winding-up notice by HMRC over an unpaid tax bill worth around £175,000 back in June.\nMr Young had claimed that the unpaid bill was simply an admin error but it now seems that the problem was far more serious and ultimately led to the firm going bust.\nHowever, Sanderson Young will continue to trade after Mr Young’s family acquired the business out of administration.\nThe move has saved around 50 jobs, with Mr Young stating that no member of staff will be made redundant as part of the plan.\nMr Young said:\nThe business will be the same as what is there now. I have no plans for redundancies.\nWe are going forward with a strong order book and new clients. There is an idea to slim down some of the premises of the business, as now-a-days estate agents do not need as many premises as they did in the past.\nWe would look to expand some of our sites and some people would work from home.\nHe added:\nThe historic days of having a key office on every high street are fading away. Although I am keen to keep a high street presence.\nIf I close a branch I will not be losing any staff.\nAt the time of writing the final deal to acquire Sanderson Young has not been finalised but it is expected to be completed by end of play on Thursday September 27. A Sanderson Young Estate Agent sign 8:24", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15210648;"], "published": "2018-09-28T10:00:00.000+03:00", "crawled": "2018-09-28T15:49:49.036+03:00", "highlightTitle": ""}