{"organizations": [], "uuid": "eb46ebf313d9c0526fc4c933e5e7dc983ef51592", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15161075.ece/ALTERNATES/s1200/0_nick-brown.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/tory-plan-axe-50-mps-15160848", "country": "GB", "domain_rank": 21960, "title": "Tory plan to axe 50 MPs 'undermines democracy', says Labour Chief Whip", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-17T18:00:00.000+03:00", "replies_count": 0, "uuid": "eb46ebf313d9c0526fc4c933e5e7dc983ef51592"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/tory-plan-axe-50-mps-15160848", "ord_in_thread": 0, "title": "Tory plan to axe 50 MPs 'undermines democracy', says Labour Chief Whip", "locations": [], "entities": {"persons": [{"name": "nick brown", "sentiment": "negative"}], "locations": [{"name": "england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "labour chief whip tory", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "invalid email conservative", "sentiment": "none"}, {"name": "newcastle east", "sentiment": "none"}, {"name": "boundary commission", "sentiment": "none"}, {"name": "conservative party", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Tory plan to axe 50 MPs 'undermines democracy', says Labour Chief Whip Newcastle MP Nick Brown condemns boundary changes which mean the loss of four North East seats Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nConservative plans to cut the number of MPs by 50 will undermine democracy and the work of Parliament, Labour’s Chief Whip says.\nNewcastle East MP Nick Brown said the proposals, which include reducing the number of North East MPs by four, were in the best interests of the Conservative Party but not the country.\nHe spoke to ChronicleLive after the Government published final proposals to redraw Parliamentary constituencies across the country, ending a review process that began as far back as 2011.\nThe proposals were drawn up by the independent Boundary Commission for England.\nBut it had to meet criteria set by the Government, which included cutting the number of MPs as part of a plan to reduce the House of Commons from 650 members to just 600.\nMr Brown said: “The current proposals undermine the community base of our democracy and undermine the work of Parliament.\n“The country would be better served by a Parliament of 650 MPs, rather than a reduction to 600.” Newcastle MP Nick Brown (Image: Newcastle Chronicle)\nHe pointed out that the current figure of 650 was a result of previous reviews by the four boundary commissions for England, Scotland, Wales and Northern Ireland, when they were free to create constituencies based on the best way to represent voters rather than being told to aim for a certain number.\n“The figure of 650 was the Boundary Commission’s independent decision, the underlying reason being that it best represents communities.\n“The reduction to 600 is a political decision taken by the Conservative Government.\n“The reason is that it better reflects the interest’s of the Conservative party.”\nUnder the changes, many constituencies will cross local authority boundaries. It means that some MPs will find themselves dealing with more than one local authority, ending the convention that constituencies don’t cross local council boundaries. North East constituencies after boundary changes\nBerwick and Morpeth\nCity of Durham and Easington\nDarlington\nNewcastle upon Tyne North West\nNorth Durham\nTynemouth\nWashington and Sunderland West\nFor example, Newcastle will now have only two dedicated MPs, down from three at the moment - while around 36,000 Newcastle residents will be represented by the MP for Blaydon.\nA Jarrow seat will include residents in the Gateshead area as well as many from the area served by South Tyneside Council.\nMr Brown said that the way boundaries were constructed risked undermining the link between MPs and their constituents.\n“The great defence of the single member constituency system is that every local community has an MP of its own, whose responsibility it is to speak up for them.\n“If you change the system to representing blocks of numbers rather than real communities then that sense of responsibility is diluted.”\nAnd fewer MPs meant it would be harder to hold Government ministers to account, he said. Read More Government's plan for East Coast Main Line is 'experiment' which could fail, inquiry warns\n“A smaller number of MPs have more constituents, more work to do - and after Brexit we will have to do the work of the European Parliament as well - the same number of ministers but a smaller Parliament to hold them to account.”\nAs well as cutting the number of MPs, the boundary review was designed to ensure that each constituency has roughly the same number of voters, ending discrepancies which mean some MPs represent far more constituents than others.\nIt’s generally accepted that periodic reviews are needed, due to population changes.\nMr Brown said the Government should scrap the current proposals and launch a new review, which could make use of the work already carried out by the Boundary Commission. Read More Shocking rise in families turning to crowdfunding websites as they can't pay funeral costs\n“We should start again with 650 seats, ten-year reviews, a compromise over variation in seat size, but with a focus on communities, and use the work of the last review to shorten the time period of the next one.”\nChanges to constituencies must be approved by Parliament before they come into effect. The Government has said it plans to put the proposals to MPs, but has not named a date for the vote.\nLabour opposes cutting the number of MPs, but some Conservatives will also oppose the plans because their seats will be put at risk.\nPrime Minister Theresa May could potentially avoid a Commons battle by simply never holding a vote. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-17T18:00:00.000+03:00", "crawled": "2018-09-18T06:39:47.006+03:00", "highlightTitle": ""}