{"organizations": [], "uuid": "ac0e8183cff9a1078f62fa058b22af5cbc592a97", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article9289249.ece/ALTERNATES/s1200/JS34001522.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-employers-say-brexit-15180545", "country": "GB", "domain_rank": 21960, "title": "North East employers say Brexit will hurt their businesses and the region's economy", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-20T20:41:00.000+03:00", "replies_count": 0, "uuid": "ac0e8183cff9a1078f62fa058b22af5cbc592a97"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-employers-say-brexit-15180545", "ord_in_thread": 0, "title": "North East employers say Brexit will hurt their businesses and the region's economy", "locations": [], "entities": {"persons": [{"name": "brexit", "sentiment": "negative"}, {"name": "james ramsbotham", "sentiment": "none"}, {"name": "john mccabe", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "gosforth park hotel", "sentiment": "none"}, {"name": "wynyard hall", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "tees valley", "sentiment": "none"}], "organizations": [{"name": "brexit", "sentiment": "negative"}, {"name": "necc", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "north east chamber of commerce", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "North East employers say Brexit will hurt their businesses and the region's economy Furious business leaders say the Government is 'sleepwalking into disaster' Share James Ramsbotham CEO of the NECC at the North East Chamber of Commerce conference at the Gosforth Park Hotel in Newcastle Get daily\nNorth East employers say they expect Brexit to hurt their businesses.\nAnd there is anger that the Government is failing to listen to their concerns.\nJames Ramsbotham, Chief Executive of North East England Chamber of Commerce, said: “They risk missing the far larger risks associated with Brexit and sleepwalking into economic disaster.”\nThe Chamber published the findings of a survey of employers which found 52%, more than half, expect Brexit to have a negative impact on their business.\nAnd Chamber bosses say concern about Brexit dominated proceedings at their annual general meeting, held on Tuesday (20th Sept 2018) at Wynyard Hall in the Tees Valley. North East England Chamber of Commerce president John McCabe (Image: Unknown)\nSpeakers called in strong terms for the nation’s political leaders to heed the voice of business and provide far greater clarity to allow current economic success to continue.\nJohn McCabe, managing director of Fusion Creative PR, who was re-elected as Chamber President at the event, said: “The debate around Brexit continues to create more heat than light, and the only thing uniting Leavers and Remainers is their opposition to the options which are on the table. Read More Threat of cuts to CrossCountry services through Newcastle, Durham and Berwick is lifted\n“Through all the uncertainty, what is clear is that ‘No Deal’ is a totally unacceptable outcome for North East England’s businesses.”\nMr Ramsbotham told the meeting that North East businesses had enjoyed a successful year marred by the uncertainty caused by a lack of political leadership surrounding Brexit, which is due to take place on March 29 next year. An EU flag flying in front of the Houses of Parliament (Image: PA)\nHe said: “The Government has been guilty of tunnel vision when it comes to Brexit. We’ve written to the Prime Minister and the Business Secretary with very little response.”\nHe added: “Businesses in the North East have brought down our unemployment rate, increased the value of our exports and are showing their potential. Read More Theresa May's Brexit plans suffer setbacks after EU leaders say they 'will not work'\n“It’s absolutely vital Government heeds the warnings which are coming from businesses across the country – particularly those from a trading region like the North East – and ensure we have the clarity we need to continue to see that economic success in the future.”\nThe annual general meeting, sponsored by Pulsant, brought together Chamber members from across the region, who also heard from Nagma Ebanks-Beni, commercial director at Seaham-based Prima Cheese Ltd, runners-up in the Exporter of the Year category at the British Chambers of Commerce national awards. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-20T20:41:00.000+03:00", "crawled": "2018-09-20T22:10:26.002+03:00", "highlightTitle": ""}