{"organizations": [], "uuid": "c503200df1c28558beca9152f8127d1c3ef34927", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article12099966.ece/ALTERNATES/s1200/HS2-project.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/hs2-bosses-reveal-high-speed-15169106", "country": "GB", "domain_rank": 21960, "title": "HS2 bosses reveal why high speed rail network WILL benefit the North East", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-18T18:20:00.000+03:00", "replies_count": 0, "uuid": "c503200df1c28558beca9152f8127d1c3ef34927"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/hs2-bosses-reveal-high-speed-15169106", "ord_in_thread": 0, "title": "HS2 bosses reveal why high speed rail network WILL benefit the North East", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News HS2 bosses reveal why high speed rail network WILL benefit the North East Managers of the HS2 high speed rail line say Newcastle is on the network and it will join up the entire country Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nHS2 bosses have insisted the rail line will “join up the entire country” including the North East.\nSome North East MPs have criticised the planned £55.7bn high speed rail network, pointing out that it doesn’t come to the region.\nBut Tom Kelly, director of stakeholder engagement at HS2 , told ChronicleLive that HS2 would help connect the whole country.\nHe said: “I occasionally have to remind myself of the sheer scale.\n“This is 345 miles when it’s finished ... and it impacts the whole country. Everywhere from Newcastle down.” HS2 (Image: PA)\nHe added: “The key point of HS2 is to join up the country.”\nCritics point out that Newcastle isn’t actually part of the new network, but Mr Kelly said: “They are on the line in the sense that HS2 trains run on from\nBirmingham through Leeds onto Newcastle.\n“The journey time between Newcastle and Birmingham will go down from three hours to two hours.”\nThis is because high speed rail trains would use existing track North of Leeds, so that Newcastle was effectively part of the new network, he said. Read More Sir Vince Cable reveals plan to save the Liberal Democrats following 'bad period in party’s history'\nMr Kelly also welcomed the announcement that a vital piece of HS2 legislation will be delayed for a year, saying it would provide time to ensure the high speed rail line complemented a new northern rail network called Northern Powerhouse Rail, which is currently in the very early stages of planning.\nLegislation authorising the construction of phase two of HS2, running from Birmingham to Manchester and Leeds, is now expected to come before Parliament in 2020. High speed rail\nHe said HS2 “learnt lessons” after it emerged it had made £1.76m of unauthorised payments to staff.\nThe Commons Public Accounts Committee last year accused HS2 Ltd, the Government-owned business managing the project, of “a shocking waste of taxpayers’ money” after it made £1.76m of unauthorised payments to staff through compulsory and voluntary redundancy schemes.\nMr Kelly said: “As we acknowledged, at times our processes have not been all that they should be.”\nHighlighting a more complimentary report from the National Audit Office, he added: “But as the National Audit Office said last week, our processes are improving and have improved considerably. And we have learnt lessons.\n“That’s the same with every single infrastructure project. You learn lessons as you go along.” Read More MPs warn Theresa May her current Brexit plans won't save the car industry\nThe HS2 project currently employed 7,000 people, he said, and the number would increase to 15,000 in 18 months and 30,000 in five years.\n“Then there will be steady numbers of people employed in this project right up to 2033,” he said.\n“That means people can have certainty that they can have a career in HS2 that will last them two decades.\n“That means this country is investing in an up-skilled workforce that will make us more competitive in the global economy.\n“That will be a substantial contribution to creating employment both in itself but also by creating a legacy of an asset that will last for over a century.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-18T18:20:00.000+03:00", "crawled": "2018-09-19T00:17:57.002+03:00", "highlightTitle": ""}