{"organizations": [], "uuid": "9e0e18d15e2af62920e9d703990d01dc2c1c4a6f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article1904948.ece/ALTERNATES/s1200/0_Mel-Stride-Stock-Photo.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/news-opinion/hard-border-between-ourselves-eu-1966023", "country": "US", "title": "Hard border between ourselves and the EU means trade is slowed and costs rise", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-03T18:38:00.000+03:00", "replies_count": 0, "uuid": "9e0e18d15e2af62920e9d703990d01dc2c1c4a6f"}, "author": "Mel Stride", "url": "https://www.devonlive.com/news/news-opinion/hard-border-between-ourselves-eu-1966023", "ord_in_thread": 0, "title": "Hard border between ourselves and the EU means trade is slowed and costs rise", "locations": [], "entities": {"persons": [{"name": "mel strid", "sentiment": "none"}, {"name": "mel stride", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "central devon", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Hard border between ourselves and the EU means trade is slowed and costs rise Mel Stride MP says that the so-called Chequers position sees the UK taking back control of our borders, our money and laws Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Could not subscribe, try again later Invalid Email\nMel Stride is the Conservative MP for Central Devon and has been since 2010\nBrexit continues to dominate the headlines. I think most accept the result of the referendum (I do, though I campaigned to remain) and now just want us to get on with it. But many constituents have been asking me to explain the main issues around our exit. After all, leaving involves highly complicated negotiations - not surprising given our 40 plus years as a member.\nWhat matters to the government is that we honour the referendum result and this means that any deal must return control our borders (e.g. immigration), bring an end to paying large sums to the EU, return our ability to govern ourselves without legal interference from the EU and the ability to negotiate our own trade deals as a sovereign nation. This is precisely what the government’s position would achieve. Mel Stride\nThe so-called Chequers position sees the UK taking back control of our borders, our money and laws. It would do this whilst ensuring that there are no hard customs borders between ourselves and the other EU states. This would be achieved via agreeing to a common rulebook on regulations for goods and agricultural goods where these common standards are required to ensure that friction at our borders is removed. Read More Teachers, police and health workers all deserve an increase in real wages\nFor example, this would mean that where the EU has a regulatory requirement in respect of a particular import into their customs territory then we would be signed up to meeting that requirement within our own customs territory and so the good would be able to be exported to the EU without having to be checked at a customs border or for onerous customs paperwork to have to be completed by the UK exporter.\nAnd this matters – if there is a hard border between ourselves and the EU then trade is slowed and costs rise – this would be especially difficult at ports like Dover where lorries need to keep moving to avoid huge tailbacks. Read More Antisemitism and islamophobia rows show the current sorry state of British politics\nThe other trade related element of the Chequers proposal is for the UK to operate a customs border on behalf of the EU at our own borders in respect of those goods destined for the EU from other non EU countries but which would be coming through the UK. This will allow us to charge the EU’s tariff on EU goods going to the EU and our own tariff on those goods ending their journey in the UK. Mel Stride\nThe result of this approach is that we will be able to handle the application of different tariff levels for goods destined for the EU and for those destined for the UK meaning in turn that we will be able to offer other countries a trade deal with UK tariffs that differ from those of the EU. Read More\nThis is a creative solution to what would otherwise see a deal (or no deal) with hard borders with the EU and all the trade friction, cost and disruption that that would entail. We should wish this approach well.\nMore from Mel on Twitter @MelJStride and at www.melstridemp.com Like us on Facebook ", "external_links": ["http://www.melstridemp.com/", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-09-03T18:38:00.000+03:00", "crawled": "2018-09-03T18:53:58.017+03:00", "highlightTitle": ""}