{"organizations": [], "uuid": "0ae6cb76fbe15bca3e25e655898eeb3f84aee83c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15149802.ece/ALTERNATES/s1200/0_Student-study.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/holidaymakers-warned-renew-passports-immediately-15149740", "country": "GB", "domain_rank": 21960, "title": "Holidaymakers warned to renew their passports immediately - or risk being barred from Europe", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-13T23:00:00.000+03:00", "replies_count": 0, "uuid": "0ae6cb76fbe15bca3e25e655898eeb3f84aee83c"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/holidaymakers-warned-renew-passports-immediately-15149740", "ord_in_thread": 0, "title": "Holidaymakers warned to renew their passports immediately - or risk being barred from Europe", "locations": [], "entities": {"persons": [], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "schengen", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "home office", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nIs your passport about to expire?\nIf so, you’d better think about renewing it - or risk finding yourself barred from Europe.\nThat’s the warning which has come from Government, as the Home Office attempts to prepare people for the possibility of a ‘no deal’ Brexit .\nBrits with less than six months left on their passport may not be allowed access to the EU after the UK leaves, if a deal isn’t reached.\nIt’s long been the case that to travel to most non-EU countries , your documents have to be valid for longer than six months after you travel. Read More\nBut some valid British passports could also prove useless in Schengen zone if a deal isn’t reached.\nThat’s because Brits will be treated as third-country nationals, who have to comply with different rules.\nAccording to a document published on Thursday by the Home Office: “If you plan to travel to the Schengen area after 29 March 2019, to avoid any possibility of your adult British passport not complying with the Schengen Border Code we suggest that you check the issue date and make sure your passport is no older than nine years and six months on the day of travel.\n“For example, if you’re planning to travel to the Schengen area on 30 March 2019, your passport should have an issue date on or after 1 October 2009.\n“If your passport does not meet these criteria, you may be denied entry to any of the Schengen area countries, and you should renew your passport before you travel.” Brits with less than six months left on their passport may not be allowed access to the EU after the UK leaves (Image: PA)\nThe Schengen area includes most (though not all) EU countries, as well as some countries outside the union.\nIt includes popular holiday destinations such as Spain, France, Greece, Germany, Italy and Portugal - as well as Austria, Belgium, the Czech Republic, Denmark, Estonia, Finland, Hungary, Iceland, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, the Netherlands, Norway, Poland, Slovakia, Slovenia, Sweden and Switzerland.\nThis is one of the many ways a no deal Brexit could affect lives according to Government documents examining the likely outcomes of a deal failure. Read More See Jacob Rees-Mogg and his family get ambushed by protesters as North East MP offers support\nOther possible issues include price hikes for products like medicines and perfumes, the potential for some families to be broken up and expensive data roaming charges.\nThe Government also warns Brits could have problems hiring rental cars in the EU in the event of a no-deal Brexit - as our driving licenses may no longer be valid.\nHolidaymakers from the UK would need to buy an international driving permit (IDP), which you can get at the Post Office for £5.50.\nThe Government said: “You may be turned away at the border or face other enforcement action, for example fines, if you don’t have the correct IDP.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-13T23:00:00.000+03:00", "crawled": "2018-09-13T23:35:35.018+03:00", "highlightTitle": ""}