{"organizations": [], "uuid": "f09d0afb503c8dce3e10659c9c8843a674e008d0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13690532.ece/ALTERNATES/s1200/SGP_NEC_010717PITT01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-highest-rate-student-housing-15115702", "country": "GB", "domain_rank": 21960, "title": "Newcastle has the highest rate of student housing in the entire country", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-05T18:20:00.000+03:00", "replies_count": 0, "uuid": "f09d0afb503c8dce3e10659c9c8843a674e008d0"}, "author": "Daniel Holland", "url": "https://www.chroniclelive.co.uk/news/north-east-news/newcastle-highest-rate-student-housing-15115702", "ord_in_thread": 0, "title": "Newcastle has the highest rate of student housing in the entire country", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Newcastle has the highest rate of student housing in the entire country One in every 15 homes in the city is a property for students Share Daniel Holland Local Democracy Reporter 16:20, 5 SEP 2018 Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nNewcastle has the highest rate of student housing in the entire country, it has been revealed.\nNew analysis shows that one in every 15 homes in the city is now a student property, a figure matched only by Exeter.\nIt is also a rate that is nearly 10 times higher than the national average for local authorities in the UK.\nWith a new wave of freshers set to arrive any day now, it can be revealed that there were 8,822 student houses in the city at the last count in May 2017. A general image of student accommodation on Pitt Street Newcastle (Image: Newcastle Chronicle)\nThat is up by 31 per cent in a single year, from 6,720 in May 2016, and does not include student halls of residence.\nNewcastle is home to two large universities and has seen a massive rise in its student population over the past two decades.\nThe number of students in the city is thought to have risen by around 20,000 since 2001, when the total was 25,271.\nCllr Ged Bell, cabinet member for employment at Newcastle City Council, said: “Students at Newcastle’s two universities contribute an estimated £500m to our economy each year and also attract young people from countries around the world to our city.\n“Students themselves make a really important contribution to the local economy - with many continuing to live and work here after their studies - and our universities are major employers. St James' Point student accommodation (Image: Newcastle Chronicle)\n“It is great to see our universities thriving and as more young people come to study here it is important that there is sufficient student housing to meet demand.\n“As well as ensuring there is sufficient student accommodation, we also seek to ensure there is a balanced mix of housing, including family housing, within our communities. As part of our plans for growth in Newcastle we expect there to be an additional 21,000 homes in the city by 2030 and have already seen record levels of housing development in the last two years.”\nThe major growth of the city’s student numbers has led to the expansion of the traditional student neighbourhoods like Jesmond, but recent years have also seen a substantial rise in purpose-built student tower blocks. Jesmond Apartments, Grantham Road (Image: newcastle chronicle)\nCouncil chiefs say that an average of 550 student bed spaces in tower block accommodation were built per year up until 2014, but that figure skyrocketed to 2,316 in 2016. Read More The rise of student housing: Why so many blocks of flats are being built in Newcastle\nThere are now thousands more that have been built since, or that hold planning permission.\nSites earmarked for massive new student developments include St James’ Boulevard, the vacant Technopole building at Kings Manor Business Park, and the last remaining plot of the former Tyne Tees Television base on City Road. The Foundry, student accommodation in Shieldfield (Image: newcastle chronicle)\nNewcastle University says that its students boost the region’s economy by £115 million and support more than 4,000 jobs.\nAcross England, there were 190,395 student properties counted in 2017, and only accounting for one in every 126 homes.\nIn Durham, one in every 106 homes in the county council area is student housing - although the rate would be far higher for Durham city.\nOne in every 22 homes in Liverpool is student-only, one in 51 in Birmingham, and one in 96 in Sunderland. Read More £40m plan to build hundreds of student flats in Newcastle city centre to get the green light\nIn January last year, Newcastle City Council bosses adopted a tougher policy on student tower blocks, forcing developers to prove that they won’t lead to an over-concentration of such “that would be harmful to that area’s vibrancy, environmental quality and residential amenity”.\nIt is hoped that such policies will help protect the city should its student population fall - something that could become a reality amid a decline in the number of 18-year-olds nationally and Brexit. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-05T18:20:00.000+03:00", "crawled": "2018-09-06T00:12:45.010+03:00", "highlightTitle": ""}