{"organizations": [], "uuid": "6644752e7fc4f5ce055e2ee1cdfc6e2e565d18d2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13672156.ece/ALTERNATES/s1200/ESH-GROUP.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/esh-group-admits-grew-quickly-15202871", "country": "GB", "domain_rank": 21960, "title": "Esh Group admits it 'grew too quickly' as Durham construction firm posts loss", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-26T14:47:00.000+03:00", "replies_count": 0, "uuid": "6644752e7fc4f5ce055e2ee1cdfc6e2e565d18d2"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/esh-group-admits-grew-quickly-15202871", "ord_in_thread": 0, "title": "Esh Group admits it 'grew too quickly' as Durham construction firm posts loss", "locations": [], "entities": {"persons": [{"name": "andrew radcliffe", "sentiment": "none"}, {"name": "esh", "sentiment": "none"}, {"name": "michael hogan", "sentiment": "none"}, {"name": "chapman brown", "sentiment": "none"}], "locations": [], "organizations": [{"name": "esh group", "sentiment": "negative"}, {"name": "durham", "sentiment": "negative"}, {"name": "county durham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Esh Group admits it 'grew too quickly' as Durham construction firm posts loss The company has launched a new strategy involving simplifying its operations Share Andrew Radcliffe, chief executive of Esh Group (Image: COPYRIGHT CHAPMAN BROWN PHOTOGRAPHY) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nConstruction firm Esh Group says it “grew too quickly” and is working to restructure its business after making a loss.\nThe County Durham company has posted an operating loss of £475,000 for the year ending December 31 2017, after its revenue fell by £22m to £220m.\nEsh’s management team described the results as “disappointing”.\nSpeaking in the firm’s financial accounts, non-executive chairman Michael Hogan said: “We admit that we are coming through a very tough couple of years when the group probably grew too quickly.\n“We didn’t have the appropriate level of control, while trying to manage our business on multiple fronts. We also acknowledge that we didn’t have the right skills in place, nor up-to-date systems and technology.”\nIn response to the poor results, Esh has embarked on a restructuring exercise and introduced a new business strategy with six key points, including simplifying the group’s structure and operations to maximise returns for the companies shareholders. Read More Major plans for housing on both sides of Tyne put forward by Hadrian's Tower developers\nThe company also said it is committed to developing its leadership team, driving technological improvements and controls, maintaining health and safety procedures, investing in its people, and focusing on the basics of cash, profit and quality.\nChief executive Andy Radcliffe added that the efforts to restructure the business was part of the reason for Esh Group’s fall in turnover and profit.\nMr Radcliffe said: “Here at Esh Group, we have embarked on a major restructuring of the way that we operate and go to market. While this restructuring has resulted in selected withdrawal from certain types of businesses, it has also enabled us to focus our efforts on our core competencies, and so, drive operational improvements for the benefits of our clients.\n“Periods of adjustment in any business inevitably lead to an impact on both the top and bottom line. At Esh Group, this has been compounded with the heavy investment that has been made in developing and implementing new technology throughout the business, as well as a degree of ‘Brexit’ uncertainty challenging some of our market segments.\n“However, everything we are doing to transform Esh is aligned to a core strategy of simplification and improved competitiveness. We continue to make good progress along this journey.”\nEsh Group’s headcount also fell during the year, from 1,097 in 2016 to 1,038 in 2017. The production team shrunk by 40 members of staff to 425, while the admin team decreased from 632 workers to 613. Read More 150 workers to leave County Durham train factory as contracts come to an end\nWhile the firm acknowledged that 2017 had been a tough year, the business has continued to work on a number of important projects, including a £5.8m contract to install major highway improvements at Birdwell roundabout on behalf of Barnsley Metropolitan Borough Council.\nThe company is also working on a new basketball arena for the Newcastle Eagles. The £6m Newcastle Eagles Community Arena is the group’s largest ever leisure project and it is expected that more than 11,000 people will use the facility during its first year. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-26T14:47:00.000+03:00", "crawled": "2018-09-26T16:18:14.062+03:00", "highlightTitle": ""}