{"organizations": [], "uuid": "dae09e503b084e367e6921e0198ab62d104f50f6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15196411.ece/ALTERNATES/s1200/1_2884ef94-00ac-48cf-a3a5-2878013bdc52JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15194151", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Newcastle road closed after West End crash; two crashes on the A1", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-25T07:00:00.000+03:00", "replies_count": 0, "uuid": "dae09e503b084e367e6921e0198ab62d104f50f6"}, "author": "Tom Eden", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15194151", "ord_in_thread": 0, "title": "North East news LIVE: Newcastle road closed after West End crash; two crashes on the A1", "locations": [], "entities": {"persons": [{"name": "coun beadle", "sentiment": "none"}, {"name": "ron beadle", "sentiment": "none"}, {"name": "martin gannon", "sentiment": "none"}], "locations": [{"name": "west end", "sentiment": "none"}], "organizations": [{"name": "tom eden council", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "labour", "sentiment": "none"}, {"name": "gateshead council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Adelaide Terrace has now reopened: Labour Tom Eden Standing ovation for Keir Starmer's Brexit speech\nBrexit, Sir Keir Starmer has said as the party appeared set to back the option of a fresh referendum on European Union membership.\nDelegates at the party’s conference in Liverpool are expected to back a plan that could lead to a fresh public vote which could include the option of ditching Brexit altogether.Sir Keir, who said he would vote to stay in the EU if that was an option, played down the divisions at the top of the party over the plan.Under the terms of the motion set to be voted on at the conference on Tuesday, if Labour cannot force an early general election it will “support all options remaining on the table, including campaigning for a public vote”.Shadow Brexit secretary Sir Keir said the scope of the motion was “wide enough to encompass the option of Remain” in any referendum.His comments came after shadow chancellor John McDonnell signalled he would want any second Brexit referendum to be limited to choosing how to leave the EU.But Sir Keir told the BBC: “There isn’t this difference of opinion between me and John McDonnell and the whole Labour Party is united around the motion that is going forward this morning.”Labour appears set to reject Theresa May’s Brexit plan, claiming it fails to meet the party’s tests for any deal.“Looking at the state of the negotiations, which are frankly chaotic and failing, it looks like she is not going to meet those tests so in those circumstances we will vote against a deal that she brings back,” he added. Gosforth Tom Eden Dad loses fight against 'unfair' school places rule\nA parent who tried overturning a Gosforth school’s “unfair” admission policy has lost his fight. (Image: Newcastle Chronicle)\nEarlier this month, 60 children started reception at Archibald First School, which Ofsted recently rated ‘outstanding’.\nBut a dad clashed with the school after governors refused to prioritise places for new starters whose siblings had only just left.\n“He proposed that children whose older sibling had transferred into Year Five at (Gosforth Junior High Academy) should be given the same priority as children with an older sibling still at the school,” reads an Office of the Schools Adjudicator report.\nGosforth, unlike most of Newcastle , runs a three-tier school system.\nRather than primary and secondary schools, pupils there attend first, middle and high school.\nHowever the adjudicator states parents would have known the rules in advance as they’d existed for “some years”.\nAnd the Department of Education had identified 21 primary schools within two miles of the objector’s postcode - adding he lived closer to one of those than than any first school.\n“If having their reception child and their Year five child in the same school was important for a parent options would have been available in the two-tier school system,” added the report. Ian Renwick Gateshead hospital chief executive dismissed\nThe long-serving chief executive of the Gateshead Health Foundation Trust has been dismissed.\nIan Renwick - who has led the organisation since 2006 - was dismissed from his role following a disciplinary hearing on Friday.\nChair Julia Hickey convened the hearing and John Maddison, deputy chief executive and director of finance, is now acting chief executive.\nA spokesman for the trust said: “Gateshead Health Foundation Trust has taken the decision to dismiss Ian Renwick as chief executive.\n“Mr Renwick now has the right of appeal against this decision and therefore it would be inappropriate to comment any further at this time.”\nThe former chief executive has 14 days to lodge an appeal against the decision. 11:10 Clean-up operation on Adelaide Terrace\nThe Adelaide Terrace cleanup operation is under way: Kingston Park Tom Eden One person taken to hospital after A1 crash\nFollowing the three-vehicle crash on the A1 at Kingston Park this morning, paramedics took one person to hospital.\nAn ambulance service spokeswoman said:\n“We were called to reports of a road traffic collision on the A1 near Kingston Park at 8.31am this morning.\n“We dispatched a double-crewed ambulance and have taken one patient to hospital.” Benwell Tom Eden Locals shocked by scene\nThis morning shoppers arriving in Benwell stopped to look at the scene of carnage and take pictures.Locals told of their shock at being greeted by the crime scene.James Lawson, 85, from Rye Hill, said:\n“I had to get off the bus at Armstrong Road to get in.\n“It’s a big cordon for a car crash. I just can’t see how this has happened.\n“You’d think the bollards would have stopped them.\nIt’s a shock seeing all this, I just came along for my papers.” 10:51 Tom Eden Update from the ambulance service\nThe North East Ambulance service have given an update on their involvement in the aftermath of the West End crash.\nA spokeswoman said:\n“We were called at 6.17am to Hugh Gardens following reports of a road traffic collision.\n“We dispatched a double-crewed ambulance and one of our hazardous area response team crews.\n“One male patient has been taken to the RVI with head and pelvis injuries.” 10:42 Councillor stunned at state of car\nCoun Ahad said he was stunned when he saw the state of the car. (Image: Newcastle Chronicle)\n“I haven’t seen a car like this before. Especially on a route like this.\n“There’s a chicane and traffic lights.\n“I’m just glad no children were in the area.” Benwell Tom Eden Councillor at crash scene\nNewcastle councillor Dipu Ahad is at the scene of the crash and told of his relief that no pedestrians were injured when a car smashed into railings outside a busy shopping centre:\nThe Benwell and Elswick councillor said:\n“A lot of people in the area are quite shocked to see the state of the car.\n“There are steel bollards there. This could have been a lot worse. This is a major route to schools on the morning and the route to the shopping area.\n“There could easily have been children or parents going to school.\n“We need to be relieved that there’s no fatalities to members of the public.\n“And I hope there are no major injuries.”", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15194151;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-09-25T07:00:00.000+03:00", "crawled": "2018-09-25T11:23:08.000+03:00", "highlightTitle": ""}