{"organizations": [], "uuid": "0a225d0a15ab94a4aba31bc9fe87a19c1fcb3dfe", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15194769.ece/ALTERNATES/s1200/1_CFR_NJL_170414jtdove_02.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/staff-salary-bonus-newcastle-jtdove-15194725", "country": "GB", "domain_rank": 21960, "title": "Windfall for all JT Dove workers who get bonus worth 11% of salary after company builds up profits", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-24T18:00:00.000+03:00", "replies_count": 0, "uuid": "0a225d0a15ab94a4aba31bc9fe87a19c1fcb3dfe"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/staff-salary-bonus-newcastle-jtdove-15194725", "ord_in_thread": 0, "title": "Windfall for all JT Dove workers who get bonus worth 11% of salary after company builds up profits", "locations": [], "entities": {"persons": [{"name": "paul frost", "sentiment": "none"}, {"name": "steve robinson", "sentiment": "none"}, {"name": "darli", "sentiment": "none"}], "locations": [{"name": "county durham", "sentiment": "none"}, {"name": "cumbria", "sentiment": "none"}, {"name": "northumberland", "sentiment": "none"}, {"name": "seahouses", "sentiment": "none"}, {"name": "teesside", "sentiment": "none"}, {"name": "hetton", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "none"}, {"name": "invalid email employees", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Windfall for all JT Dove workers who get bonus worth 11% of salary after company builds up profits The Newcastle builders merchant will celebrate its 150th anniversary next year Share JT Dove managing director Steve Robinson (left) at their newly opened Hetton branch with branch manager Paul Frost (Image: handout supplied for free bySimon Williams 07889532545) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nEmployees at builders merchant JT Dove will receive a windfall bonus worth more than 11% of their salary thanks to a strong year.\nThe Newcastle headquartered firm, which has 18 sites across Tyne and Wear, Northumberland, Cumbria, County Durham and Teesside, has posted its financial performance for 2017 which saw a 14% lift in sales from £46m to £52.4m, while operating profit also rose from £2.04m to £2.45m.\nThe directors said they were pleased with the results, which came amid a year of economic and political uncertainty, aided by further development at its Seahouses and Darlington branches which had opened in 2016.\nStaff will also being rewarded for the group’s solid performance, through the firm’s employee profit share scheme, which has been in place for more than 60 years.\nThe staff payments have been made since a move introduced in 1954 by founder Herbert Dove and his wife, to place the business into an Employee Benefit Trust, which is similar to the John Lewis Partnership and allows staff to share in the company’s success.\nA stategic report attached to the firm’s accounts said: “With the increased turnover and a steady gross margin percentage we saw further growth in both our gross profit and operating profit.\n“Consequently the Herbert Dove Trustees were able to declare an employee profit share for the year equivalent to over 11.4% of salary. Read More Here are the 50 Best Places to Work in the North East\n“In addition, we continued to make an additional contribution to our defined benefit pension scheme. This year it was £195,000, giving a total contribition of £624,000 for the year.”\nThe firm, which marks 150 years in business next year, said the general level on uncertainty caused by the Brexit referendum vote decision remains but that it doesn’t appear to be affecting trade significantly. It also didn’t have direct exposure to the collapse of Carillion, and that directors remain confident for the future of the business.\nDuring the year the firm also boosted its workforce from 224 to 241 employees.\nSteve Robinson, managing director, said the year ahead will be a busy one with the opening of its 19th store.\nHe said: “This year’s figures are extremely positive on the back of economic uncertainty for the UK. Certainly our sales have been holding well, despite a looming Brexit and political unrest surrounding it. Also the industry itself is highly competitive currently, but we remain focused on our core values of quality and customer care, which is consistent in standing us in good stead.\n“2019 is set to be an exciting year for JT Dove. It is our 150th anniversary and we will certainly be celebrating in style with lots of events, in store activities and benefits to help our long-standing loyal customer base commemorate the landmark with us too. There will also be a new store bringing our total to 19 – Greenfields in Consett is due to open soon. Read More Gateshead firm that gives staff December off tops UK rankings for work-life balance\n“Finally as a team, we have set our cap at an ambitious charity target for the coming year.\n“We will be endeavoring to raise £100,000 to donate to CHUF. The charity does amazing work for people from the communities we have branches in, and it is our way of giving back a little.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-24T18:00:00.000+03:00", "crawled": "2018-09-25T16:32:29.002+03:00", "highlightTitle": ""}