{"organizations": [], "uuid": "20e675c3220a29eff7214621cb675a3e5be79a42", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15159165.ece/ALTERNATES/s1200/0_Almost-50-of-North-East-firms-are-unprepared-for-BrexitMinisters-Attend-First-Cabinet-Meeting-After-The-Summer-Recess.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/brexit-bad-us-say-more-15154236", "country": "GB", "domain_rank": 21960, "title": "Brexit will be bad for us, say more than half of North East businesses", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-17T02:01:00.000+03:00", "replies_count": 0, "uuid": "20e675c3220a29eff7214621cb675a3e5be79a42"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/brexit-bad-us-say-more-15154236", "ord_in_thread": 0, "title": "Brexit will be bad for us, say more than half of North East businesses", "locations": [], "entities": {"persons": [], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "north east england", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "business brexit", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "none"}, {"name": "north east england chamber of commerce share almost", "sentiment": "none"}, {"name": "chamber of commerce", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Brexit will be bad for us, say more than half of North East businesses Almost 50% of North East firms are unprepared for Brexit, according to survey by North East England Chamber of Commerce Share Almost 50% of North East firms are unprepared for Brexit (Image: Getty Images Europe) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nAlmost half of companies in the North East are not ready for Brexit - and even more think it will be bad for them, a survey by the region’s largest business organisation has found.\nThe first Brexit barometer dedicated to businesses in the region has been carried out by the North East England Chamber of Commerce.\nThe survey found that 52.4% of business people in the region believe it will have a negative impact on their business, while just 14.1% see it being beneficial to them. Read More Newcastle aims to become digital city to head next industrial revolution\nConcerns raised by firms including the cost of trade, changes to standards and regulations and changes in access to EU funding. 40% of business people feel their firm is underprepared for Brexit and 7.2% feel completely unprepared.\nBrexit Secretary Dominic Rabb said at the end of last week that Britain and the EU are “closing in” on an agreement on the terms of the UK’s withdrawal and their future relations.\nBut there are still fears that a no-deal Brexit could occur, which is likely to be particularly harmful to important industries like pharmaceutical and car manufacturing that are key to the North East economy.\nChamber chief executive James Ramsbotham said: “Since 2016, there has been a total lack of leadership and clarity in the negotiation process.\n“At the Chamber, we’ve been helping our members start making preparations but now, with only seven months to go, businesses are still in the dark on the realities of Brexit and are still waiting for Government to give clear answers to fundamental questions.”\nAs well as canvassing views on their readiness for Brexit, the Chamber survey gave companies the opportunity to include a message for the Government. Read More Most Influential 2018: who are the most powerful people in the North East?\nThe Chamber said that the predominant theme was frustration with the lack of progress and engagement by the Government. There were also views that negotiations now needed to proceed swiftly.\nOn Friday, Brexit Secretary Dominic Raag said he had an “extended” phone call with the EU’s chief negotiator Michel Barnier to review progress in the Brexit talks.\nHe said that while there were still issues which needed to be resolved, discussions were taking place in the “right spirit” and that they would have further talks after EU leaders meet next week for an informal summit in Salzburg.\nBut a senior Labour figure has warned that Labour is unlikely to back any Brexit deal Theresa May secures from Brussels.\nShadow foreign secretary Emily Thornberry said she could not see the Prime Minister coming back with an agreement which would meet the six tests set by the party for supporting any deal. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-17T02:01:00.000+03:00", "crawled": "2018-09-17T04:20:54.019+03:00", "highlightTitle": ""}