{"organizations": [], "uuid": "b3497a9734ffb50ffa4525c6503a00ea01eee8b9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15146784.ece/ALTERNATES/s1200/0_The-134th-Durham-Miners-Gala-Celebrates-Socialism.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/wansbeck-mp-ian-lavery-urges-15190488", "country": "GB", "domain_rank": 21960, "title": "Wansbeck MP Ian Lavery urges Labour activists to back new rules", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-23T18:16:00.000+03:00", "replies_count": 0, "uuid": "b3497a9734ffb50ffa4525c6503a00ea01eee8b9"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/wansbeck-mp-ian-lavery-urges-15190488", "ord_in_thread": 0, "title": "Wansbeck MP Ian Lavery urges Labour activists to back new rules", "locations": [], "entities": {"persons": [{"name": "ian lavery", "sentiment": "negative"}], "locations": [{"name": "liverpool", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "liverpool", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Wansbeck MP Ian Lavery urges Labour activists to back new rules Labour chair supports controversial changes in speech to party conference in Liverpool Share Ian Lavery (Image: Getty Images Europe) Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nWansbeck MP Ian Lavery kicked off Labour’s annual conference with a plea to activists to accept radical changes to the party’s rules.\nHe told the party conference at Liverpool: “It is essential that our party structures and rules are fit for the future.\n“This will need compromise and patience in abundance, we need to keep our eyes on the big picture – the ultimate objective of winning the next election .”\nControversial proposals include changing the rules for electing a party leader, so that unions and local Labour branches have a say in nominating candidates.\nLabour MPs currently pick the candidates, and party members and trade union members the choose between them in a vote\nThere are also plans to elect a second deputy leader, to serve alongside existing deputy leader Tom Watson.\nThe idea is that this would be a woman, to ensure at least one person at the very top of the Labour Party is female.\nSome of the changes could shift the balance of power in the party. For example, Tom Watson is seen as a moderate who has sometimes disagreed with Jeremy Corbyn. Electing a joint-deputy leader might reduce his influence.\nAnd it has traditionally been hard for left-wing MPs to stand as leader because other Labour MPs are reluctant to nominate them - although it’s not clear whether the proposed rule changes would make it any easier. Read More Defiant Theresa May tells EU leaders: 'I won't let you break up the United Kingdom'\nThe changes are part of Labour’s Democracy Review, and Mr Lavery urged party activists to back reforms to the party.\nBut the most controversial change to Labour’s rules has been proposed separately. This is the proposal to make it easier to de-select sitting MPs and replace them with a new Labour candidate when the next election takes place.\nCurrently, the sitting MP is automatically re-selected unless 50% of local activists support the idea of holding a contest to choose a candidate.\nLabour’s National Executive Committee has agreed that this should be reduced to 33%. It would make it easier to remove sitting MPs.\nBut the proposal is unlikely to satisfy some of Mr Corbyn’s supporters, who wanted to ensure selection contests are held automatically for every constituency. Read More MP Catherine McKinnell joins Labour conference march calling for second Brexit vote\nUrging delegates to back changes, Mr Lavery said: “We’ve been set a task by you, our members and we have a duty to build the transformative Labour Party that will take us to power.\n“Labour we’re a Government in waiting, and only with that strong bond of solidarity and unity can we take those keys to No10.\n“As the old trade union banners proudly proclaim, the past we inherit, the future we build.\n“Unity is strength. Let’s grasp this opportunity and seek to fulfil our collective vision of a party whose very reason for existence is a nation of hope, aspiration, equality, justice and fairness for the many, not the few.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-23T18:16:00.000+03:00", "crawled": "2018-09-23T19:52:06.000+03:00", "highlightTitle": ""}