{"organizations": [], "uuid": "42d0df3e806552051bfbda150c3bd2ef0fc05460", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15212448.ece/ALTERNATES/s1200/0_Untitled-design-21.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/watch-ian-lavery-clash-question-15212480", "country": "GB", "domain_rank": 21960, "title": "Watch Ian Lavery clash on Question Time as he defends Jeremy Corbyn and backs Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-28T14:56:00.000+03:00", "replies_count": 0, "uuid": "42d0df3e806552051bfbda150c3bd2ef0fc05460"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/watch-ian-lavery-clash-question-15212480", "ord_in_thread": 0, "title": "Watch Ian Lavery clash on Question Time as he defends Jeremy Corbyn and backs Brexit", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "brexit labour cha", "sentiment": "negative"}, {"name": "ian lavery", "sentiment": "negative"}, {"name": "brexit", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "liverpool", "sentiment": "none"}, {"name": "invalid email labour", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Watch Ian Lavery clash on Question Time as he defends Jeremy Corbyn and backs Brexit Labour chair Ian Lavery says his party DOESN'T want a second referendum - despite calls at its conference in Liverpool Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nLabour chair Ian Lavery insisted his party is not calling for a second EU referendum - and still backs Brexit.\nThe Wansbeck MP dismissed claims that voters who backed Brexit in the 2016 referendum had changed their minds, saying: “That’s not what I’m experiencing in the North East, it really isn’t.”\nAnd setting out Labour’s position, he said: “We’re saying we want a Brexit.\n“We want a Brexit negotiated in the best interests of the people of this country.”\nIt followed Labour’s annual conference earlier this week, where delegates voted for a motion which stated Labour could back a second EU referendum if Prime Minister Theresa May fails to negotiate a suitable Brexit deal, and if there is no general election. Ian Lavery appearing on Question Time (Image: BBC)\nKeir Starmer, Labour’s Shadow Brexit Secretary, made it clear during the conference that the referendum could include the option of remaining in the EU.\nBut Mr Lavery gave a clear impression that Labour was still committed to leaving the EU, when he appeared on BBC show Question Time.\nHe said: “We are leaving everything on the table. That doesn’t suggest that we are agreeing to a second referendum, because that’s not what we’re saying.”\nThe result of the 2016 referendum had to be respected, he said.\n“The will of the people was clearly expressed in the referendum, and the referendum result was ... people in this country said we should be leaving the EU.\n“I was a remainer by the way, still am a remainer, but I am a democrat as well. Ian Lavery (Image: Getty Images Europe)\n“And I think if we were to put something to the country in terms of a referendum we are duty bound to accept the result of that referendum.”\nBut he stressed the importance of negotiating a Brexit deal. Read More Jeremy Corbyn Labour conference speech: Leader says he could be Prime Minister within a year\nMr Lavery said: “It’ll be catastrophic to have a no-deal Brexit for areas like this.”\nBrexit is likely to dominate the Conservative conference, which begins on Sunday, and Conservative MP Boris Johnson has published his personal manifesto for Brexit in what looks like a naked bid for the party leadership. Boris Johnson\nHe claimed Prime Minister Theresa May’s agenda was “humiliating” for the UK, in a column in the Daily Telegraph.\nIt provoked mixed reactions from Tory colleagues.\nFormer Cabinet minister Nicky Morgan mocked the ex-Foreign Secretary, while arch-Brexiteers like Jacob Rees-Mogg rallied to his defence. Read More Jeremy Corbyn plans to help create 400,000 green jobs with expansion of on-shore windfarms\nReferring to Mr Johnson’s Daily Telegraph column in which he claimed Theresa May’s agenda was “humiliating” for the UK, Ms Morgan tweeted: “I said Boris had to decide if he was a politician or a journalist - he’s clearly made his decision but shame he didn’t research the link between agreeing a solution that keeps the Irish border frictionless and the chances of agreeing withdrawal terms. Or does he just not care?”\nHowever, leading Brexiteer Bernard Jenkin described Mr Johnson’s remarks as “unanswerable” and “powerful”.\nFellow anti-EU Tory Nadine Dorries called Mr Johnson “a man with a plan”.\nMr Rees-Mogg, who chairs the powerful Eurosceptic European Research Group, echoed the former foreign secretary’s comments, saying negotiations had been “badly conducted”. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-28T14:56:00.000+03:00", "crawled": "2018-09-28T15:50:36.021+03:00", "highlightTitle": ""}