{"organizations": [], "uuid": "ab41174973dc21a208d5bf57a8b85e13c2c91dea", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13525816.ece/ALTERNATES/s1200/ESH-GROUP.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/esh-group-ceo-rules-out-15209616", "country": "GB", "domain_rank": 21960, "title": "Esh Group CEO rules out redundancies during firm's restructure", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-27T19:01:00.000+03:00", "replies_count": 0, "uuid": "ab41174973dc21a208d5bf57a8b85e13c2c91dea"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/esh-group-ceo-rules-out-15209616", "ord_in_thread": 0, "title": "Esh Group CEO rules out redundancies during firm's restructure", "locations": [], "entities": {"persons": [{"name": "radcliffe", "sentiment": "none"}, {"name": "andrew radcliffe", "sentiment": "none"}, {"name": "andy radcliffe", "sentiment": "none"}, {"name": "esh", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}], "organizations": [{"name": "esh group", "sentiment": "negative"}, {"name": "business esh group", "sentiment": "negative"}, {"name": "journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Esh Group CEO rules out redundancies during firm's restructure The construction firm is focusing on its core businesses and said it will look to exit certain divisions Share Andy Radcliffe, who has been appointed CEO of Esh Group (Image: Chapman Brown Photography)\nThe boss of North East construction firm Esh Group has said he will not be looking to make staff redundant as part of plans to restructure the business.\nSpeaking to The Journal, Esh’s CEO Andrew Radcliffe said that the company is making moves to simplify its business and exit a number of sectors that did not fit within its core strategy.\nBut he added that while the company would be off-loading some of its smaller divisions, he did not expect the firm to make any redundancies.\nMr Radcliffe said: “At a high level our core business is civil engineering, affordable housing, commercial building and private housing, and we have complementary services in that as well.\n“If you take those high level sectors, those are the key areas we are focusing on. If it doesn’t fit with that model, we don’t want do it.”\nAreas outside of the Esh’s key areas include the firm’s remediation business and a specialist refurbishment division.\nMr Radcliffe added: “We have other operations in the group that are relatively small but require management attention such as our plumbing business. We are in the final stages of selling that business. Read More New Newcastle Quayside hotel takes step forward as builder is appointed\n“We are bringing the business back to its core. We are not closing down those businesses in a pure sense, we are either merging or selling them.”\nYesterday Esh Group’s financial accounts revealed that the firm had made an operating loss of £475,000 for the year ending December 31 2017. Company chairman Michael Hogan said the firm had “grown too quickly” and was coming through a “very tough couple of years”.\nOne of the causes of the challenging market is Brexit and the uncertainty it has caused in the commercial property sector, which has led to less investment in the market.\nBut Mr Radcliffe said the firm’s balance sheet - which stands at around £42m - would allow it to make the changes it needed to continue long into the future. Read More Exhibition to showcase plans for multimillion-pound distillery in Northumberland\nHe said: “We have a strong balance sheet. We are the envy of many construction businesses both nationally and regionally. With the value of our balance sheet we can weather many storms.\n“We are confident that the business is strong and we have strong fundamentals. It is an exciting time for us to restructure the business and revitalise the strategy.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-27T19:01:00.000+03:00", "crawled": "2018-09-27T19:14:47.008+03:00", "highlightTitle": ""}