{"organizations": [], "uuid": "9a0e92ca5941d36d6a88b369df0fa4be123858d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15170048.ece/ALTERNATES/s1200/0_Liberal-Democrats-Autumn-Conference-2018.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/vince-cable-tells-lib-dems-15169921", "country": "GB", "domain_rank": 21960, "title": "Vince Cable tells Lib Dems to welcome defectors from Labour or the Tories", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-18T20:20:00.000+03:00", "replies_count": 0, "uuid": "9a0e92ca5941d36d6a88b369df0fa4be123858d3"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/vince-cable-tells-lib-dems-15169921", "ord_in_thread": 0, "title": "Vince Cable tells Lib Dems to welcome defectors from Labour or the Tories", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Vince Cable tells Lib Dems to welcome defectors from Labour or the Tories Lib Dem leader sets out optimistic vision of defections by MPs from other parties Share Liberal Democrat leader Sir Vince Cable (Image: PA) Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nLiberal Democrat leader Vince Cable urged his party to offer a warm welcome to disaffected MPs who want to defect from rival parties, in his speech to the party’s annual conference.\nHe suggested that Labour and Conservative politicians who are sick of “extremism” in their own parties might join the Lib Dems instead.\nHe said they should be accepted even if they didn’t identify - as many Lib Dems do - as liberals or social democrats.\nSir Vince said: “If others choose to identify themselves as moderates who hate extremism in their own parties, we shouldn’t be quibbling about labels. Let them in.”\nHis appeal to party activists at the Brighton conference might be seen as a little optimistic. The Lib Dems currently have 12 MPs, down from 57 in the 2010 general election which saw them propelled into power as coalition partners of the Conservatives. Leader of the Liberal Democrats Sir Vince Cable (Image: PA)\nBut Sir Vince suggested that Conservative and Labour politicians might feel repelled by changes taking place in their parties.\nHe said: “Much now depends on the courage of mainstream MPs in the Labour and Conservative parties . They are losing control and if they can’t stop the rot, they should leave.”\nSome Lib Dem activists argue that the party’s struggle to regain support has been hindered by the perception that they have nothing to talk about except for opposition to Brexit. Read More Sir Vince Cable reveals plan to save the Liberal Democrats following 'bad period in party’s history'\nSir Vince highlighted a range of policy proposals, including plans to increase income tax by a penny to fund increased health spending.\nBut much of his speech focused on Brexit and Liberal Democrat support for a “people’s vote”, which would give people an opportunity to reject any proposed deal between the EU and UK, and to stay in the EU instead. The EU and Union flags (Image: PA)\nJournalists were told in advance of the speech that Sir Vince would speak of Leave campaigners experiencing an “erotic spasm” over a hard Brexit.\nThe unusual phrase appeared designed to grab attention.\nBut in the event, the veteran MP grimaced as he stumbled over the phrase, saying “exotic sprezzum” instead.\nSir Vince tried to reach out to Leave voters, saying that he understands their anxieties and that wanting to manage immigration is not racist.\nHe said: “History will record that Liberal Democrats have been on the right side of the Brexit argument.\n“Right to oppose Brexit in the first place. Right to predict a bad deal. Vince Cable gives a speech at a People's Vote campaign in The Assembly Rooms, Newcastle (Image: Staff)\n“And right to campaign for a ‘People’s Vote’.”\nHe added: “There is now a growing realisation that Brexit will be costly and painful: very costly and very painful if we crash out without a deal.\n“The Brexit date may be 29th March, but it is only may be. Brexit is not inevitable. It can and must be stopped.\n“Over the summer, I spoke to rallies and meetings across Britain from Bristol to Newcastle to Cambridge. Read More MPs warn Theresa May her current Brexit plans won't save the car industry\n“There are huge numbers of people who simply do not accept that we should drift into a messy, costly, divorce, who don’t accept that the country cannot change its mind, or that a narrow decision taken by a majority of one generation should blight the chances of the next.\n“There are millions of people out there who haven’t given up the fight, and nor will we.”\nThe Liberal Democrats currently have no MPs in the North East. The Berwick-upon-Tweed constituency Northumberland was a Lib Dem stronghold from 1973 to 2015, but is now held by the Conservatives.\nRedcar was held by the Lib Dems from 2010 to 2015. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-18T20:20:00.000+03:00", "crawled": "2018-09-19T00:17:50.034+03:00", "highlightTitle": ""}