{"organizations": [], "uuid": "1ebc01b933ff1a4e8e63fcd1472f1a504f320476", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14022791.ece/ALTERNATES/s1200/John-McDonnell-interview.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-give-workers-up-500-15189939", "country": "GB", "domain_rank": 21960, "title": "Labour will give workers up to £500-a-year from employer profits", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-24T00:00:00.000+03:00", "replies_count": 0, "uuid": "1ebc01b933ff1a4e8e63fcd1472f1a504f320476"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/labour-give-workers-up-500-15189939", "ord_in_thread": 0, "title": "Labour will give workers up to £500-a-year from employer profits", "locations": [], "entities": {"persons": [{"name": "john mcdonnell", "sentiment": "none"}], "locations": [{"name": "liverpool", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "board of trustees", "sentiment": "none"}, {"name": "under labour", "sentiment": "none"}, {"name": "mcdonnell", "sentiment": "none"}, {"name": "invalid email workers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nWorkers would get up to £500 a year under Labour plans to give them a share of the profits made by employers, Shadow Chancellor John McDonnell is to announce.\nLarge firms would have to give away shares to a new fund created for the benefit of staff.\nIt would mean employees effectively became part-owners in the business - and they would get some of the profits that are currently paid to shareholders in the form of dividends.\nIn his speech to the Labour conference in Liverpool, Mr McDonnell will say: “Workers, who create the wealth of a company, should share in its ownership and, yes, in the returns that it makes.”\nUnder Labour’s plans, every company with more than 250 employees will be expected to create an “Inclusive Ownership Fund”. Firms will transfer at least 1% of their ownership into the fund each year, until it owns ten per cent of the business.\nThe fund will be administered by a Board of Trustees, elected from the company’s eligible employees.\nShares in the fund will have voting rights - which means employees will have a voice in how the business is run.\nAnd they the shares will also confer rights to dividends from the company.\nPayments to individuals will be capped at £500 each year, which means some funds will have money left over to be paid to the government as a “social dividend”. Read More MP Catherine McKinnell joins Labour conference march calling for second Brexit vote\nThis cash help fund public services and social security. It will provide an estimated £2 billion each year.\nIf Labour gets its way, the new rules will revolutionise the way companies are controlled in the UK.\nThey’re likely to go down badly with existing shareholders. Business leaders may also point out that they already contribute to society by paying corporation tax on profits, national insurance on staff they employ and business rates on properties they use, as well as creating jobs.\nBut Labour argues that the current system, in which firms are ultimately run for the benefit of shareholders, encourages decisions to make a quick profit rather than long-term investment.\nAt least 40% of the private-sector work force, or 10.7m people working for larger businesses, will be included in the scheme.\nBut smaller firms will also be encouraged to set up similar funds voluntarily.\nMr McDonnell is expected to tell the party conference : “The evidence shows that employee ownership increases a company’s productivity and encourages long term thinking.”\nHe will tell delegates: “The dividend payments workers will receive will be up to £500 a year.\n“That’s 11 million workers each with a greater say, and a greater stake, in the rewards of their labour.” Read More Defiant Theresa May tells EU leaders: 'I won't let you break up the United Kingdom'\nThe Shadow Chancellor will say that society as a whole should also benefit from industry’s profits.\n“We all know it’s not just the workers of a company that create the profits it generates.\n“It’s the collective investment that we as a society make that enables entrepreneurs to build and grow their businesses, maintaining the roads and investing in the infrastructure we rely upon, educating the workforce, caring for them when they’re sick and investing in the research and development that enables technological innovation.\n“So we believe it’s right that we all share in the benefits that investment produces.\n“That’s why a proportion of revenues generated by the ‘inclusive ownership funds’ will be transferred back to our public services as a social dividend.\n“Mobilising billions that could be spent directly on the social security system which supports those who have retired, are unable to work, or need society’s support in other ways.\n“We will be a Labour government committed not just to meet the challenges facing today’s generation but to secure the long term future prosperity of the next.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-24T00:00:00.000+03:00", "crawled": "2018-09-24T03:28:21.007+03:00", "highlightTitle": ""}