{"organizations": [], "uuid": "01cb39e2b69efaa816e4e5e10314b4bc90a0fc4c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14515938.ece/ALTERNATES/s1200/John-McCabe.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/read-north-east-business-chiefs-15123016", "country": "GB", "domain_rank": 21960, "title": "Read North East business chief's scathing attack on politicians over Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-07T15:00:00.000+03:00", "replies_count": 0, "uuid": "01cb39e2b69efaa816e4e5e10314b4bc90a0fc4c"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/read-north-east-business-chiefs-15123016", "ord_in_thread": 0, "title": "Read North East business chief's scathing attack on politicians over Brexit", "locations": [], "entities": {"persons": [{"name": "mccabe", "sentiment": "negative"}, {"name": "mr mccabe", "sentiment": "none"}, {"name": "john mccabe", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "brexit business read north east", "sentiment": "negative"}, {"name": "durham cathedral share click", "sentiment": "none"}, {"name": "north east england chamber of commerce", "sentiment": "none"}, {"name": "whitehall", "sentiment": "none"}, {"name": "north east england chamber of co", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Read North East business chief's scathing attack on politicians over Brexit Mr McCabe launched a scathing attack on Labour and the Government at an annual dinner at Durham Cathedral Share Click to play Tap to play The video will start in 8 Cancel Play now Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nA leading North East business chief has launched a scathing attack on both Labour and the Government over their handling of Brexit negotiations, accusing both of “threatening our region” with their policies.\nJohn McCabe, president of the North East England Chamber of Commerce, used his speech at the organisation’s annual dinner to criticise Whitehall politicians for failing to listen to the concerns of businesses.\nSpeaking to more than 630 business leaders, Mr McCabe said: “While the Chamber’s own surveys point to good business performance in our region, the overwhelming fear for our firms is a poorly managed, chaotic departure from the EU. North East England Chamber of Commerce president John McCabe (Image: Unknown)\n“The Chamber’s views on the Government’s handling of Brexit to date have been well documented. And for good measure, I am equally bewildered by the position apparently taken by the main opposition party.\n“The Conservatives speak of the greatest prize in Britain today being the closure of the gap between London and the North.\n“While for Labour, the North East is a traditional heartland. And yet the Brexit policies of both parties threaten our region more than any other.”\nMr McCabe accused the Government of taking credit for the jobs created by local businesses while simultaneously ignoring concerns put forward by firms about Brexit negotiations. (L-R) The Very Reverend Dean of Durham Andrew Tremlett, Chamber chair Lucy Winskell, Nick Jones form Newcastle International Airport, George Clarke and Judith Doyle from Gateshead College and Chamber president John McCabe (Image: Unknown) Read More 'It's time our politicians puts people's livelihoods before ideology' Sarah Glendinning CBI\nTheresa May’s Government has long faced criticism from the business sector for failing to provide enough information about Brexit negotiations. The lack of information has led to wide scale uncertainty that has inhibited many firms’ ability to plan for the long term future.\nMr McCabe added: “Recently we’ve seen senior politicians on both sides of the House making disparaging remarks about business and rejecting the notion that we may have something valid to say on the future of our economy and the society it underpins. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-07T15:00:00.000+03:00", "crawled": "2018-09-07T16:25:38.005+03:00", "highlightTitle": ""}