{"organizations": [], "uuid": "7b428948af49e13329e06b0e00b9f15a3a04a21a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/whats-on/article1169925.ece/ALTERNATES/s1200/House-of-Fraser-1jpeg.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/reports-suggest-exeters-house-fraser-2057717", "country": "US", "title": "Reports suggest Exeter's House of Fraser store will close", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-29T19:30:00.000+03:00", "replies_count": 0, "uuid": "7b428948af49e13329e06b0e00b9f15a3a04a21a"}, "author": "Jamie Hawkins", "url": "https://www.devonlive.com/news/devon-news/reports-suggest-exeters-house-fraser-2057717", "ord_in_thread": 0, "title": "Reports suggest Exeter's House of Fraser store will close", "locations": [], "entities": {"persons": [{"name": "devon live", "sentiment": "none"}, {"name": "john harvey", "sentiment": "none"}, {"name": "fraser", "sentiment": "none"}], "locations": [{"name": "devon live", "sentiment": "none"}, {"name": "exeter", "sentiment": "none"}], "organizations": [{"name": "exeter's house of fraser", "sentiment": "none"}, {"name": "invalid email exeter’s house of fraser", "sentiment": "none"}, {"name": "house of fraser", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Reports suggest Exeter's House of Fraser store will close Devon Live understands the store will shut in January Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nExeter’s House of Fraser store is set to close next year, according to reports.\nDevon Live understands the troubled department store will shut its High Street branch in January – despite it being on the list of stores that would not be affected by the nationwide closures.\nAlthough House of Fraser has not confirmed the store will close, multiple sources have told Devon Live the shop will shut. Read More\nA member of staff said: “We were told on Friday that house of Fraser in Exeter would be closing in January.”\nIt is believed signs will go up confirming the news next week.\nReports also suggest other national chains are already eyeing up the building. John Harvey\nOn the news, former city centre manager John Harvey said: “It is not unsurprising but clearly it is a really sad news. It is devastating news for the large numbers of staff and a pretty severe blow for the city centre.\n“There now has to be some urgent work as to what happens to the site and a pretty full review of the city centre strategy as it stands.\n“This will ask big questions about what is next for the city centre and I cannot see another tenant taking over the site as it currently is because it is frankly very much in need of change and the building is I suggest pretty near the end of its life. This is a very very difficult situation.\n“I hope that there will be a process of looking at the strategy and reaching out to a large amount of people to have a review of what happens next. It needs to be handled very carefully.\n“But obviously now my thoughts are with the staff involved at this point.” Read More\nKnown as Colsons in the 1800’s, the store has remained in exactly the same place on Exeter’s High Street, despite its several rebuildings and rebrandings, which includes the much-loved Dingles and, indeed House of Fraser.\nRead the full history of the store here.\nSome stores, including Plymouth’s, will now be saved following Mike Ashley’s £90m takeover. House of Fraser in Plymouth city centre (Image: Penny Cross) Read More Fears for Moss Bros as it blames World Cup for huge losses\nNegotiations resulted in 20 House of Frasers being saved from closure, safeguarding around 3,500 jobs.\nThe Plymouth store had previously been earmarked for closure under the terms of the Company Voluntary Arrangement (CVA).\nA spokesperson said the the quick conclusion to this transaction reflects the close working relationship and shared ambition from both House of Fraser and British Land who own the building.\nNot only does the deal save a key store in Plymouth it also gives House of Fraser the platform to invest properly in creating a sustainable long term department store offer.\nJames Keany Head of National Agency at CBRE who acted on the negotiations said: “This is another example of what can be achieved when landlords work with us to ensure we deliver on the House of Fraser rescue plan. House of Fraser B&Q is in trouble as profits and shares fall - and it's blaming Brexit\n\"This deal also shows the commitment from House Of House Fraser not only to key flagship locations such as Oxford Street but also across the rest of the UK in regional markets ”.\nDarren Richards of British Land said; \"This swift and positive collaboration between British Land, Plymouth City Council and Sports Direct will see House of Fraser retained as a key feature of Plymouth city centre.\nStores earmarked for closure: Edinburgh Frasers, Hull and Swindon.\nStores that will remain open: Altrincham, Aylesbury, Birkenhead, Camberley, Carlisle, Darlington, Doncaster, Grimsby, High Wycombe, Lincoln, London (Oxford Street), Middlesbrough, Plymouth, Skipton, Telford, Huddersfield, Leeds, Maidstone, Solihull and Sutton Coldfield.\nIn August, House of Fraser was forced to apologise to customers after cancelling all orders placed online. Exeter's House of Fraser store\nThe beleaguered retailer said it had wiped all orders that had not already been sent to customers and would be issuing refunds.\nThe move comes after the chain's website was taken offline amid complaints from customers about delayed deliveries since the company was bought by Sports Direct.\nThe issue reportedly stemmed from a dispute involving employees at a key warehouse. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-09-29T19:30:00.000+03:00", "crawled": "2018-09-29T19:54:05.021+03:00", "highlightTitle": ""}