{"organizations": [], "uuid": "700a1206730158997fcdaef3a7205e2576691552", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15164474.ece/ALTERNATES/s1200/0_DQ290611JAGS-39.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/fears-north-east-automotive-sector-15164441", "country": "GB", "domain_rank": 21960, "title": "Fears for North East automotive sector after Jaguar Land Rover moves to three-day week", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-17T18:54:00.000+03:00", "replies_count": 0, "uuid": "700a1206730158997fcdaef3a7205e2576691552"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/fears-north-east-automotive-sector-15164441", "ord_in_thread": 0, "title": "Fears for North East automotive sector after Jaguar Land Rover moves to three-day week", "locations": [], "entities": {"persons": [{"name": "ralph speth", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "locations": [{"name": "birmingham", "sentiment": "none"}, {"name": "castle bromwich", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}], "organizations": [{"name": "jaguar castle bromwich", "sentiment": "negative"}, {"name": "jaguar land rover", "sentiment": "negative"}, {"name": "jaguar", "sentiment": "negative"}, {"name": "jlr", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jaguar cars on the production line at Jaguar Castle Bromwich factory, Birmingham (Image: Birmingham Post and Mail) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nFears have been expressed for the outlook of the North East automotive industry after the country’s biggest car maker moved staff to a three-day week.\nUnions fear the livelihoods of automotive workers in the North could be put at risk by Jaguar Land Rover’s (JLR) decision to lower production.\nJLR is cutting production at its Castle Bromwich site, in Birmingham, and moving its workers to a three-day week until Christmas.\nThe car giant’s decision came after its chief executive Prof Ralph Speth warned that job losses could hit the UK’s automotive sector if the UK goes ahead with a no deal Brexit.\nA slump in people buying diesel cars has also forced the move.\nWhile the move will directly affect staff working at JLR’s manufacturing plant, Unite has warned that the decision could also impact workers in North East automotive firms.\nSpeaking to The Journal, Unite assistant general secretary Tony Burke said: “When we have a major manufacturer of cars deciding to go to a three-day week in the run up to Christmas, it will have an impact on the supply chain.\n“The North East has a big supply chain and a lot of companies who supply parts to JLR, and it could have an impact on Unite members working in that supply chain.\n“The point we are making is that the decision by JLR comes off the back of the comments by Prof Speth, who warned of the impact of a no deal Brexit on the automotive industry. We agree with that.\n“If you have a cliff edge the impact on the car industry will be significant, not only on the manufacturers but on the supply chain as well.”\nJLR’s decision to move workers to a three-day week was revealed on Twitter by Jack Dromey, Labour MP for Birmingham Erdington. Mr Dromey said the car giant was lowering its production due to a combination of “Brexit Chaos” and the “mishandling by ministers of the transition from diesel”.\nThe car giant confirmed the news, saying in a statement: “As is standard business practice, Jaguar Land Rover regularly reviews its production schedules to ensure market demand is balanced globally.\n“In light of the continuing headwinds impacting the car industry, we are making some temporary adjustments to our production schedules at Castle Bromwich.”\nIt added that it was continuing to “over-proportionally invest in new products and technologies” and was committed it its UK plants. Read More Brexit will be bad for us, say more than half of North East businesses\nThe car manufacturer faced criticism just hours before the announcement from former shadow minister Sir Bernard Jenkin, who accused Prof Speth of scaremongering over a prediction that crashing out of the EU would have a “horrifying” effect on UK car firms.\nMr Burke said that any major changes to the UK’s importing and exporting policies would have a detrimental impact on the UK automotive industry as it interfere with the “just-in-time” system used by manufacturers. The efficient system sees car parts arrive at plants at the exact moment they are needed.\n“All British manufacturers work on the just-in-time principle,” he said. “The parts are not stored as they used to be, they arrive when needed. Anything that will break that and create a problem or hold that up will have an effect.\n“However, the Government don’t appear to believe that. Sir Bernard Jenkin said that Prof Speth is playing project fear. That is not the case. These are real jobs being affected.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-17T18:54:00.000+03:00", "crawled": "2018-09-18T01:57:35.002+03:00", "highlightTitle": ""}