{"organizations": [], "uuid": "4898a3715d951619404d8a6a2a22e7a7e1a6b5d3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15179656.ece/ALTERNATES/s1200/0_Austria-Holds-Informal-EU-Summit.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/politics-brexit-theresa-may-live-15183408", "country": "GB", "domain_rank": 21960, "title": "Theresa May Brexit announcement LIVE: Prime Minister demands 'respect' from EU in bombshell Downing Street speech", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-21T15:30:00.000+03:00", "replies_count": 0, "uuid": "4898a3715d951619404d8a6a2a22e7a7e1a6b5d3"}, "author": "Sean Seddon", "url": "https://www.chroniclelive.co.uk/news/politics-brexit-theresa-may-live-15183408", "ord_in_thread": 0, "title": "Theresa May Brexit announcement LIVE: Prime Minister demands 'respect' from EU in bombshell Downing Street speech", "locations": [], "entities": {"persons": [{"name": "theresa may brexit", "sentiment": "negative"}, {"name": "jeremy corbyn", "sentiment": "none"}, {"name": "keir starmer", "sentiment": "none"}, {"name": "nigel farage", "sentiment": "none"}, {"name": "starmer", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "downing street", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "bbc", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Currency falls dramatically after speech\nSome Leavers might have liked what they heard, but the currency markets didn’t. 15:02 Labour shadow Brexit Sec speaks\nSir Keir Starmer, Labour’s shadow Brexit Secretary, is speaking live to the BBC.\nHe said: “Levels of anxiety are going up around the country at the prospect of no deal are going up day after day”\nSays May is “in denial” and her Chequers deal won’t be accepted by EU or her own party.\nSays “repeating mantra that nothing has changed...is not very convincing”.\nThe BBC’s reporter is pressing Starmer on reports he considered resigning over his own party’s stance on Brexit.\nHe said: “I’m not pretending Labour is all united on everything” but says Government’s problems are much bigger.\nFYI, Jeremy Corbyn has not issued a response yet. Labour shadow Brexit secretary, Keir Starmer, (Image: Daily Record) 14:56 Nigel Farage reacts to speech\nMrs May tough tone is winning plaudits with Leave supporters (including one you might have heard of below). 14:54 Straight talking\nIt’s worth pointing out it’s not common for the Prime Minister to address the country live.\nIt’s usually reserved for elections or if there’s a major crisis or development (armed forces being deployed, for example).\nThe fact Mrs May felt the need to do this at all shows how serious the Government is taking yesterday’s snub at Salzburg.\nThere wasn’t a great deal of new detail in the speech - if any - but it still feels like a major development. (Image: PA) KEY EVENT May promises protection for EU citizens\nBuried in that speech was a direct promise to EU citizens living in the UK they would be protected if negotiations break down.\nShes not just allaying the fears of people caught up in this, it’s a gesture of good faith to the EU too.\nThere are over 3 million EU citizens living in the UK who will be understandably worried about what the outcome of yesterday’s summit means for their future.\nI want to be clear with you that even in the event of no deal your rights will be protected. You are our friends, our neighbours, our colleagues. We want you to stay. 14:45 Theresa May taking it personally?\nDo you agree with this? Personally, I think the Prime Minister looked like she took yesterday’s snub to heart and that came across in the statement.\nThe Sunday Times’ political editor agrees. What do you think?\nGet in touch with me on @seddonnews on Twitter or sean.seddon@reachplc.com and I’ll get your thoughts on the blog. 14:36 Mrs May demands 'respect'\nThis was the big line of the speech.\nThere was a suggestion from some yesterday that the EU’s response to the UK negotiating team was overly strong and strayed into the personal.\nShe addressed that directly, rebuking EU leaders.\nThroughout this process, I have treated the EU with nothing but respect.\nThe UK expects the same.\nA good relationship at the end of this process depends on it. Prime Minister Theresa May speaks to the media at the conclusion of the summit of leaders of the European Union on September 20, 2018 in Salzburg, Austria (Image: Getty Images Europe) 14:33 May rubbishes EU's stance\nAfter taking a beating from EU leaders yesterday, Mrs May dished out her own today.\nShe is effectively telling Brussels their negotiating stance is a non-starter, something she’s been told a lot in the last 24 hours.\nMay is also setting out her position: Northern Ireland must be resolved and there is zero chance of her reneging on the referendum result.\nHere, the EU is still only offering us two options.\nThe first option would involve the UK staying in the European Economic Area and a customs union with the EU.\nIn plain English, this would mean we’d still have to abide by all the EU rules, uncontrolled immigration from the EU would continue and we couldn’t do the trade deals we want with other countries.\nThat would make a mockery of the referendum we had two years ago.\nThe second option would be a basic free trade agreement for Great Britain that would introduce checks at the Great Britain/EU border. But even worse, Northern Ireland would effectively remain in the Customs Union and parts of the Single Market, permanently separated economically from the rest of the UK by a border down the Irish Sea.\nParliament has already - unanimously - rejected this idea. 14:29\nHere are some responses from North East politicians to Theresa May’s statement.\nMore when we get it. 14:23 Full text of speech\nDowning Street have published the full statement - I’ll put different sections in this blog over the next hour or so.\nHere is that powerful final section, calling on the EU to engage on the big issues.\nTheresa May hasn’t looked as confident and resolute giving a public statement in a long, long time.\nThe referendum was the largest democratic exercise this country has ever undergone. To deny its legitimacy or frustrate its result threatens public trust in our democracy.\nThat is why for over two years I have worked day and night to deliver a deal that sees the UK leave the EU.\nI have worked to bring people with me even when that has not always seemed possible.\nNo one wants a good deal more than me.\nBut the EU should be clear: I will not overturn the result of the referendum. Nor will I break up my country.\nWe need serious engagement on resolving the two big problems in the negotiations. We stand ready. 14:19 Sterling tumbles\nThere’ll be plenty in her party and watching at home who loved that but the markets don’t seem to have been keen on Theresa May’s speech. 14:17 KEY EVENT Instant reaction\nHere’s some early instant reaction to the Prime Ministers tough-talking statement calling on the EU to settle the impasse in Brexit negotiations.\nShe demanded the EU show the UK “respect” and said she would not countenance defying the referendum result or agreeing to anything which would distance Northern Ireland from the UK.\nThat speech will play very well with some but the reaction has been mixed so far. 14:13 \"We stand ready\"\nMay ends on a tough note.\n“No one wants a good deal more than but EU should be clear, I will not overturn the result of the referendum, nor will I break up my country”.\nCalls for resolution of the big issues in negotiations and ends it with “we stand ready”.\nTough talk from Mrs May. 14:10 KEY EVENT May slams Brussels\nAddressing Donald Tusk directly, she said the EU’s plan would split up the country and could never be agreed to.\nAdds: “As I told EU leaders, neither side should demand the unacceptable”.\nShe’s going in hard on the EU: “Throughout the process I have treated the EU with nothing but respect. The UK expects the same”.\nShe’s calling on the EU to provide full explanation of why her plan has been scrapped. Says it is not acceptable to throw out deal like they did yesterday at late stages of negotiations. 14:06 Theresa May speaking\nThe Prime Minister is speaking: “Northern Ireland is an integral part of the United Kingdom”\nSaid harming the integrity of the UK is something “no British Prime Minister could ever agree to”.\nAdds again: “No deal is better than a bad deal. 13:59\nYou simply could not make it up... 13:58 All eyes on Boris\nIf Theresa May, as the BBC reported, is set to double down on her Brexit stance, she’s lining up a huge fight with her own backbenchers.\nThere have been concerted efforts in recent weeks to force the PM to ditch the Chequers plan and go for a ‘cleaner’ Brexit.\nIf she’s flat out refusing, there will no doubt be more talk about a leadership challenge.\nAnd that means all eyes will be on one man... (Image: PA)", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15183408;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-09-21T15:30:00.000+03:00", "crawled": "2018-09-21T17:14:17.002+03:00", "highlightTitle": ""}