{"organizations": [], "uuid": "575ae344879c35a14f6dafc353c5484824dd2cb7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15219649.ece/ALTERNATES/s1200/0_Zero-Emission-Vehicle-Summit.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/business-secretary-greg-clark-warns-15219616", "country": "GB", "domain_rank": 21960, "title": "Business Secretary Greg Clark warns Tories must listen to carmakers such as Nissan over Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-30T20:00:00.000+03:00", "replies_count": 0, "uuid": "575ae344879c35a14f6dafc353c5484824dd2cb7"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/business-secretary-greg-clark-warns-15219616", "ord_in_thread": 0, "title": "Business Secretary Greg Clark warns Tories must listen to carmakers such as Nissan over Brexit", "locations": [], "entities": {"persons": [{"name": "greg clark", "sentiment": "negative"}, {"name": "clark", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}], "locations": [{"name": "europe", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "brexit business", "sentiment": "negative"}, {"name": "nissan", "sentiment": "negative"}, {"name": "conservative party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business Secretary Greg Clark warns Tories must listen to carmakers such as Nissan over Brexit The Business Secretary says Tories must listen to carmakers and back Theresa May's Chequers plan Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nBusiness Secretary Greg Clark has urged his party to listen to car manufacturers who warn they need a Brexit deal allowing them to continue “frictionless” trade with Europe.\nHe said the Prime Minister’s ‘Chequers’ plan, which has been rejected by some pro-Brexit Tory MPs, was essential to protect the automotive sector.\nHighlighting the importance of carmakers to the economy, Mr Clark said: “I think you’ve got to be respectful and you’ve got to listen to what they say, and actually that is what we’ve done and what is the basis of the Chequers proposal.” Greg Clark (Image: PA)\nSpeaking at a fringe event at the Conservative Party conference in Birmingham, Mr Clark said he was proud that he had helped ensure Nissan chose its Sunderland plant to build new models.\nBut he said UK plants were in competition with sites elsewhere for investment from the big carmakers - and anything that increased costs could mean new models are built overseas.\n“Small differences in cost that appear to be small actually can be very decisive,” said Mr Clark\nThe Government’s Chequers plan for Brexit includes a free trade zone for goods and a customs partnership, designed to allow products to be transported between the UK and EU without restrictions after Brexit. The Nissan LEAF\nSpeaking to Conservative activists, Mr Clark explained how the “just in time” manufacturing process used by carmakers depended on factories being able to import parts from suppliers across Europe without delays.\nHis comments echoed warnings that have been given previously by senior managers at firms such as Nissan and Jaguar Land Rover, who have warned that “frictionless” trade is essential for the smooth running of their businesses.\nMr Clark said: “It requires making sure that we don’t introduce any disruption to existing supply chains, and we do everything can to allow international networks to flourish.” Read More Home Secretary Sajid Javid was \"cornered\" by top police officers to defend police cuts - here's what he said\nHe added: “The ability to trade without friction is incredibly important and that is well understood.”\nSome Conservative MPs have spoken out against the Chequers plan and instead call for a free-trade deal similar to the one the EU has with Canada.\nBut Mr Clark said this would see the UK “missing out on fantastic opportunities for the future” in tech, automation and other industry. Read More Labour dismisses Government £840 million transport contest as a \"stunt\"\nAnd he hit out at Boris Johnson, the former Foreign Secretary who is now seen as a potential future candidate for the Conservative leadership, after Mr Johnson reportedly responded to warnings from business leaders by saying “f*** business”.\nMr Clark said: “That was totally the wrong thing to say and I was surprised anyone could even think that.”\nHe added: “There is no successful economy anywhere in the world, in fact there is no successful society, that does not have successful and flourishing businesses.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-30T20:00:00.000+03:00", "crawled": "2018-09-30T20:10:07.000+03:00", "highlightTitle": ""}