{"organizations": [], "uuid": "ea7181f28f7c40422ddfb66140e5d0d48f27713c", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13594298.ece/ALTERNATES/s1200/ESTONIA_Johnson_122207.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/boris-johnsons-suicide-vest-comments-15135247", "country": "GB", "domain_rank": 21960, "title": "Boris Johnson's 'suicide vest' comments branded 'offensive' by Northumberland MP", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-10T20:00:00.000+03:00", "replies_count": 0, "uuid": "ea7181f28f7c40422ddfb66140e5d0d48f27713c"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/boris-johnsons-suicide-vest-comments-15135247", "ord_in_thread": 0, "title": "Boris Johnson's 'suicide vest' comments branded 'offensive' by Northumberland MP", "locations": [], "entities": {"persons": [{"name": "ann", "sentiment": "negative"}, {"name": "boris johnson", "sentiment": "negative"}, {"name": "mrs trevelyan", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "anne-marie trevelyan", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "alan duncan", "sentiment": "none"}, {"name": "trevelyan", "sentiment": "none"}, {"name": "tory boris johnson", "sentiment": "none"}], "locations": [{"name": "northumberland", "sentiment": "none"}, {"name": "chequers", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "foreign office", "sentiment": "none"}, {"name": "invalid email northumberland conservative", "sentiment": "none"}, {"name": "berwick", "sentiment": "none"}, {"name": "newcastle chronicle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Boris Johnson's 'suicide vest' comments branded 'offensive' by Northumberland MP Conservative MP Anne-Marie Trevelyan criticises Boris Johnson Share Boris Johnson (Image: Estonian Presidency) Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nNorthumberland Conservative Anne-Marie Trevelyan has joined criticism of top Tory Boris Johnson, after he compared Theresa May’s Brexit plans to a suicide vest.\nMrs Trevelyan, the MP for Berwick-upon-Tweed, said his language was “inappropriate” and “fairly unpleasant”.\nMr Johnson faced a backlash after his outspoken criticism of the Government’s proposals for a post-Brexit deal with the EU, known as the Chequers plan. Conservative MP for Berwick Anne-Marie Trevelyan (Image: Newcastle Chronicle)\nThe Brexiteer politician, seen as a potential Conservative leadership candidate in any future contest, said the proposals were a “suicide vest wrapped around the British constitution”.\nForeign Office minister Sir Alan Duncan said the comments were “one of the most disgusting moments in modern British politics”.\nAnd Home Secretary Sajid Javid, also seen as a potential leadership candidate, said: “I think there are much better ways to articulate your differences.”\nSpeaking on BBC Two’s Politics Live show, Mrs Trevelyan said that Mr Johnson had chosen to make his comments in a “shocking” way.\nShe said: “I found it fairly unpleasant I have to say.” Read More Universal Credit: Bishop of Durham calls on Government to 'fix' controversial benefit system\nAnd she added: “I don’t think Boris’ language was appropriate. It was offensive.”\nMrs Trevelyan, also a firm supporter for Brexit, made it clear she had concerns about the Chequers plan, but said she believed differences would be resolved “at the last moment”.\nShe said: “As someone who used to negotiate buying and selling companies for a living, negotiations crystallise at the end point and that will no doubt happen.”\nThe MP said she wanted Theresa May to continue as Prime Minister until Brexit was completed.\n“I’m hoping we can keep the Prime Minister we’ve got for quite a lot longer.”\nShe added: “I want us to get through Brexit. I want her to lead the Conservative party to deliver Brexit .”\nAnd she opposed calls for a “people’s vote” or a second referendum on Brexit.\n“I’m not a fan of doing a referendum all over again. Read More When will Newcastle, Northumberland and North Tyneside get a mayor?\n“The British people gave us a clear mandate. We’re getting on with it.”\nMr Johnson, the former Foreign Secretary who resigned in protest over the Chequer’s plan, also grabbed the headlines over the weekend by writing an article calling on the UK to follow Donald Trump’s example and slash taxes to create a “happy and dynamic economy”.\nHis high-profile statements have been seen as an attempt to shift attention away from the collapse of his marriage, which apparently follow a relationship between Mr Johnson and a former Tory official, Carrie Symonds, who used to be director of communications for the Conservatives.\nIt’s also widely believed that Mr Johnson is preparing to stand for the Conservative leadership, either when Mrs May stands down of her own accord or if she is forced out by Conservative MPs.\nHe is set to address 1,000 people at a fringe event at the Conservative conference in Birmingham at the end of September, Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-10T20:00:00.000+03:00", "crawled": "2018-09-10T23:27:24.000+03:00", "highlightTitle": ""}