{"organizations": [], "uuid": "a3227174d15340920e9d8671355668b11e04cfda", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15098679.ece/ALTERNATES/s1200/0_GBR_BPO_081214EEF01.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-manufacturers-achieve-record-15096736", "country": "GB", "domain_rank": 21960, "title": "North East manufacturers achieve record levels of activity, survey claims", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-03T02:01:00.000+03:00", "replies_count": 0, "uuid": "a3227174d15340920e9d8671355668b11e04cfda"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-manufacturers-achieve-record-15096736", "ord_in_thread": 0, "title": "North East manufacturers achieve record levels of activity, survey claims", "locations": [], "entities": {"persons": [{"name": "north", "sentiment": "none"}, {"name": "richard halstead", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "eef", "sentiment": "none"}, {"name": "bdo", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Business North East manufacturers achieve record levels of activity, survey claims The EEF has reported that manufacturers have achieved high output levels but have warned future growth could be at risk Share Richard Halstead (Image: Publicity Picture) Get business updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nNorth East manufacturers have seen their confidence pick up and activity rise to record levels over the last three months, a survey has revealed.\nResearch by manufacturing organisation EEF and business advisory firm BDO found that the region’s output rose from 46% to 50% on the back of increasing demand from the UK market.\nYet despite the increase in activity, the region’s employment balance fell marginally to 25%, while the investment balance fell from 18% to 0%.\nRichard Halstead, EEF director of member engagement for the North said: “There are both reasons for cheer and caution in our latest survey.\n“UK manufacturers in many industries are continuing to benefit from growth in the global economy; expanding their exports and driving ahead with new investments. But this is not an industry-wide phenomenon.\n“Trade tensions, the Brexit debate reaching a crescendo and some wobbles in confidence about the UK’s economic outlook continue to make their presence felt across a number of manufacturing sectors. Read More\n“If these sources of uncertainty prove to be short-lived then growth across manufacturing looks like more of a sure thing next year. If not, then government will need to act to prevent investment plans from faltering.”\nThe EEF added that it still expected the manufacturing sector to grow over the next two years.\nHowever, it warned that risk factors were increasingly present.\nSteve Talbot, partner and head of manufacturing at BDO in the North East, said: “With the output balance reaching historic highs in the last three months thanks to buoyant domestic demand, manufacturers in the North East continue to demonstrate resilience and market confidence, despite ongoing political uncertainty. Read More Growing gluten-free market gives a boost to Gateshead biscuit makers Northumbrian Fine Foods\n“This optimism has fuelled a pick-up in investment and recruitment.\n“The Government cannot afford to ignore the importance of UK manufacturing as we endure the twists and turns of EU negotiations and must minimise disruption to the sector by ensuring that Britain remains open for business with the EU as well as other key international markets.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-03T02:01:00.000+03:00", "crawled": "2018-09-03T02:19:50.016+03:00", "highlightTitle": ""}