{"organizations": [], "uuid": "4133650be3c7327e0410a3c03ed4d60c1519a7ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15216584.ece/ALTERNATES/s1200/0_rally.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/peoples-vote-newcastle-rally-campaigners-15216274", "country": "GB", "domain_rank": 21960, "title": "People's Vote Newcastle rally: Campaigners demand right to vote on final Brexit deal", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-29T16:26:00.000+03:00", "replies_count": 0, "uuid": "4133650be3c7327e0410a3c03ed4d60c1519a7ed"}, "author": "Lisa Hutchinson", "url": "https://www.chroniclelive.co.uk/news/north-east-news/peoples-vote-newcastle-rally-campaigners-15216274", "ord_in_thread": 0, "title": "People's Vote Newcastle rally: Campaigners demand right to vote on final Brexit deal", "locations": [], "entities": {"persons": [], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "birmingham", "sentiment": "none"}], "organizations": [{"name": "brexit deal people's vote", "sentiment": "neutral"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "People's Vote rally at the Monument Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nCampaigners took to the streets of Newcastle for the largest ever People’s Vote National Day of Action.\nActivists and supporters united across the country in order to demand their right to a People’s Vote on the final Brexit deal.\nMore than 100 groups took to the streets in towns and cities the length and breadth of the country, in areas that voted both remain and leave, while crowds joined forces in Newcastle.\nOver 2,000 activists and supporters took part with more than 1,000 door to door leafleting sessions organised and over one million leaflets handed out.\nThe march took place on the eve of the Conservatives’ annual conference in Birmingham, where Brexit is expected to dominate the agenda.\nConservative MPs who support a People’s Vote are out campaigning with local groups in their constituencies.\nOther People’s Vote-supporting MPs and MEPs from all major political parties joined their local groups across the UK.\nThis People’s Vote National Day of Action follows on from the hugely successful People’s Vote Summer of Action, which saw mass rallies take place in Newcastle. Edinburgh, Bristol, Cambridge and Cardiff. Read More Sir John Major admits coal was 'his single biggest misjudgement' - as David Miliband talks Brexit\nIt is all leading up to the People’s Vote and The Independent March for the Future in London on October 20, which organisers expect to be the largest Brexit-related march so far, larger even than the previous People’s Vote march which was attended by over 100,000 people.\nDavid Gwyther, field manager at the People’s Vote campaign, said: “Our largest ever day of action is a fantastic demonstration of the levels of support across the country for a People’s Vote on the terms of Brexit.\n“Thousands of volunteers and campaigners took part across the whole UK, in areas that voted both leave and remain in 2016.\n“The facts have changed massively since then and people want to make their voices heard on Brexit through a People’s Vote.\n“Brexit is going to affect generations for generations, so it’s only right that everyone gets a say in the path we take, not just 650 MPs in Westminster.\n“That’s why we are demanding a People’s Vote on the terms of Brexit.” Read More Watch Ian Lavery clash on Question Time as he defends Jeremy Corbyn and backs Brexit\nPeople’s Vote is attempting to build public support for a referendum on the final Brexit deal and convince voters that Brexit is not inevitable.\nThe Conservative conference is expected to be dominated by the party’s splits on Brexit, with Prime Minister Theresa May under pressure to ditch her Chequers plan after it was rejected by EU leaders and many of her own MPs.\nShe is likely to use her keynote speech at the gathering to explain how she intends to secure an agreement with Brussels, having last week admitted that talks were at an “impasse”. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-29T16:26:00.000+03:00", "crawled": "2018-09-29T18:44:59.028+03:00", "highlightTitle": ""}