{"organizations": [], "uuid": "05a583ab327905c611cdb19be18460411d346af8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2050444.ece/ALTERNATES/s1200/0_may.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/local-news/hang-theresa-may-facebook-post-2050097", "country": "GB", "domain_rank": 48128, "title": "'Hang Theresa May' Facebook post councillor Richard Alderman admits sending menacing messages - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-27T03:00:00.000+03:00", "replies_count": 0, "uuid": "05a583ab327905c611cdb19be18460411d346af8"}, "author": "Dan Martin", "url": "https://www.leicestermercury.co.uk/news/local-news/hang-theresa-may-facebook-post-2050097", "ord_in_thread": 0, "title": "'Hang Theresa May' Facebook post councillor Richard Alderman admits sending menacing messages - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "richard alderman", "sentiment": "negative"}, {"name": "anna soubry", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "diane abbott", "sentiment": "none"}, {"name": "anna soubry share richard alderman", "sentiment": "none"}], "locations": [], "organizations": [{"name": "leicestershire live news", "sentiment": "negative"}, {"name": "birmingham magistrates' court", "sentiment": "none"}, {"name": "rutland county council", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News 'Hang Theresa May' Facebook post councillor Richard Alderman admits sending menacing messages Rutland councillor called for Prime Minister to be hanged for treason :: Also posted offensive messages about Diane Abbott and Anna Soubry Share Richard Alderman sent a Facebook post calling for the Prime Minister Theresa May to be hanged Get Daily\nA councillor who used his Facebook page to call for Theresa May to be hanged for \"treason\" has admitted four criminal charges.\nRichard Alderman called for the Prime Minster's public hanging three days after being elected to Rutland County Council.\nIt came after he posted other grossly offensive messages about shadow home secretary Diane Abbott and Tory MP Anna Soubry.\nThe independent councillor - described in court as \"pro-Brexit and anti-immigration\" - refused to say whether he would resign his post as he left Birmingham Magistrates' Court.\nThe 72-year-old admitted four charges of sending a menacing or grossly offensive message via the public communication network.\nThey included posts describing Ms Abbott as a \"monkey\" and calling for Ms Soubry to be shot and drowned.\nOpening the facts of the case against Alderman, prosecutor James Bruce told the court the charges related to six Facebook posts made between April and July this year. Read More What police said about the messages What the prosecution says\nSubmitting the comments made about Ms Abbott constituted a hate crime, Mr Bruce told the court: \"In essence, Mr Alderman posted publicly on Facebook when responding to news articles with comments that were a mixture of the grossly offensive and menacing.\n\"They relate to public figures with whom Mr Alderman disagrees with their politics, and came to the attention of the police as a result of Mr Alderman's election to Rutland County Council on July 12.\n\"When members of the public looked up who their new councillor was, and looked up the postings, they decided to report them to the police.\" Richard Alderman's Facebook page shows a number of posts (Image: Facebook)\nThe court heard Alderman, of Lonsdale Way, Oakham, Rutland , admitted six of a number of messages he posted were menacing or offensive, after writing the prime minister's assassination was \"long overdue\".\nA post in May used an African word for monkey to describe Ms Abbott, while a further message in June added: \"The monkey is out of her tree again, send it to the animal labs.\" Read More", "external_links": [], "published": "2018-09-27T03:00:00.000+03:00", "crawled": "2018-09-27T22:04:04.007+03:00", "highlightTitle": ""}