{"organizations": [], "uuid": "5264e99a2086719a1364c52052a9d8e59c5c8ace", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15023893.ece/ALTERNATES/s1200/4_HoF-to-call-in-administrators.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15112537", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Fashion chain Quiz to take £400,000 hit from House of Fraser", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-05T10:30:00.000+03:00", "replies_count": 0, "uuid": "5264e99a2086719a1364c52052a9d8e59c5c8ace"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15112537", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Fashion chain Quiz to take £400,000 hit from House of Fraser", "locations": [], "entities": {"persons": [{"name": "jonathon manning john lewis", "sentiment": "negative"}, {"name": "john lewis", "sentiment": "none"}], "locations": [{"name": "oxford street", "sentiment": "none"}, {"name": "edgware road", "sentiment": "none"}, {"name": "london", "sentiment": "none"}, {"name": "clerkenwell", "sentiment": "none"}], "organizations": [{"name": "house of fraser", "sentiment": "negative"}, {"name": "john lewis & partners and waitrose & partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "9:30 Jonathon Manning John Lewis and Waitrose launch rebrand as part of response to crisis on the High Street\nThe John Lewis Partnership has officially launched its rebrand as the group looks to boost its fortunes during a difficult period for the high street.\nIt will see the John Lewis department store chain and supermarket Waitrose dubbed John Lewis & Partners and Waitrose & Partners.\nWhile it will be fully rolled out over the next five years, the new branding was unveiled at John Lewis’s flagship Oxford Street store in London, as well as Waitrose in Edgware Road and Clerkenwell and on its websites.\nThe company said it had made the changes to put its 83,000 staff, known internally as partners, “at the heart” of the business.\nA new in-house womenswear brand has been launched, along with a gift collection called Find Keep Give.\nThere will also be the introduction of “customer service ambassadors” who will provide personalised customer service front of stores, the creation of healthy eating specialists, training partners to offer a concierge style service and personal stylists to deliver fashion talks.\nPaula Nickolds, John Lewis & Partners managing director, said:\nOur Partnership business model and the inherent strength of our partners really sets us apart.\nThat’s why the change to our visual identity this week puts partners back at the heart of everything we do. This move not only reflects the business we have become but more importantly, the business we want to be. Paula Nickolds, managing director of John Lewis (Image: Greg Funnell/PA Wire) 9:26 Jonathon Manning Whiplash claim savings must be passed on to motorists, says Justice Secretary\nInsurance companies will be “robustly” held to account if they do not pass on savings from a Government crackdown on fraudulent whiplash claims to policy holders.\nJustice Secretary David Gauke told MPs that amendments to the Civil Liability Bill would be brought forward to ensure that insurance companies honour their public commitments to bring down premiums.The Bill sets fixed amounts of compensation for whiplash claims and bans the practice of seeking or offering to settle the cases without medical evidence.But Labour labelled the reforms “another attack” on the justice system and the vulnerable, adding it would “enrich the Conservatives’ friends in the insurance industry”.Shadow justice secretary Richard Burgon said whiplash claims are decreasing and there “isn’t a compensation culture” in the UK, later warning “genuine victims could be priced out” from making personal injury claims.Speaking at the Bill’s second reading, Mr Gauke said:\nNot only have we got the public assurances from insurance companies representing 85% of the policies, but we are also going to be bringing forward amendments to this Bill to ensure that we can robustly hold those companies to account, particularly given the public commitments they have made.\nMr Gauke said seriously injured people should receive full compensation to meet expected needs, including care costs, but added:\nThe problem, however, is on the evidence we have obtained our discount rate of minus 0.75% - the lowest in the world - is leading to awards in personal injury claims being on average 120% to 125% of the damages awarded, even after allowance is made for management costs and tax.\nThis overcompensation is contributing to escalating costs in the NHS, which spent £2.2bn on medical negligence claims alone in 2017/18 - a figure expected to rise to £3.2bn in 2020/21. A driver at the wheel (Image: PA) 9:22 Jonathon Manning William Hill secures US joint venture with casino giant\nGambling group William Hill has agreed a tie-up with US casino giant Eldorado in its latest move to tap into the liberalised American market.\nThe deal will give William Hill access to “one of the largest and most attractive” casino chains, with Eldorado boasting 23 million customers across the US.\nUnder the terms of the deal, Eldorado will receive $50m (£39m) in William Hill shares - subject to a lock-in period of up to five years - and a 20% stake in William Hill’s US operation.\nIt marks the most significant US move for William Hill since the sports betting sector was legalised in America earlier this year. A Supreme Court ruling in May paved the way for states to legalise sports gambling. William Hill chief executive Philip Bowcock said:\nThis partnership provides extensive cross-sell and profit growth opportunities to both parties.\nTogether, we are positioned to capture the evolving US opportunity - starting with land-based sports betting and extending to digital sports betting and, in some states, online gaming. William Hill shop branding Jonathon Manning Utilitywise warns that suspension of shares has hit its order book\nUtilitywise has warned shareholders that its order book has been hit harder than expected by its recent spate of troubles, which included suspending trading of its shares.\nThe Tyneside energy consultancy firm was forced to suspend its shares for two months at the start of the year while auditors looked into how the company forecasted its turnover.\nBut more than six months after the issues were resolved, Utilitywise has told investors that its accounting issues had led to a “greater and more far-reaching” commercial impact than it had expected.\nAs a result of difficult trading in the second half of the 2018 financial year, the company said its order book had fallen by 16% on a like-for-like basis from £66.1m in 2017, to £55.6m.\nLikewise, its closing gross order book at July 31 was £54.7m, compared to £66m at the same point in 2017.\nCEO Brendan Flattery said:\nThe second half of the financial year was challenging, for reasons that were well-publicised, as the group continued to deal with a number of legacy issues.\nHowever, we have also remained focused on delivering our Strategy for Growth 2021 and have already taken some significant steps to capture the considerable growth opportunities we see in both the Enterprise and Corporate divisions.\nWe expect the new financial year to be key as we see increased progress in the execution of our strategy. In the Enterprise division, this will mean continued improvements to efficiency and profitability as well as the optimisation of our channel mix, including growth from our new inbound channel. Brendan Flattery, CEO of Utilitywise 9:05 KEY EVENT Barratt posts hefty rise in pre-tax profits\nHousebuilder Barratt Developments has posted a hefty rise in annual profits as it hailed an “outstanding” year.The group posted 9.2% rise in annual pre-tax profit to a record £835.5m, while revenue increased 4.8% to £4.87bn.Completions were up 1.1% to 17,579 - the highest number in a decade - and the average selling price on completion increased 5% to £288,900.Barratt said market conditions remain good and the availability of attractive mortgage finance and the Government’s Help to Buy scheme continue to support “robust consumer demand”.Chief executive David Thomas said:\nThe group has had another outstanding year delivering a strong operational and financial performance, and our highest volumes in a decade.\nAs the UK’s largest housebuilder, we are helping to address the country’s housing shortage - creating jobs and supporting economic growth whilst continuing to lead the industry in quality and customer service.\nThe positive comments come despite reports surfacing over the weekend that Help to Buy will be scrapped in 2021, as well as warnings from rival firms over Brexit.Barratt also announced new medium-term operational targets, including volume growth of 3% to 5% per year and a minimum 25% return on capital employed.Forward sales are up 11.1% at £3bn.Mr Thomas added:\nThe group starts the new financial year in a good position with a strong balance sheet, healthy forward sales and robust consumer demand supported by a positive mortgage environment. The South Fields development in Morpeth, by Barratt Developments (Image: Barratt) 8:56 Students' urban wind turbine wins James Dyson award\nTwo university students have designed a wind turbine to generate electricity in large cities.Nicolas Orellana, 36, and Yaseen Noorani, 24, have created the O-Wind Turbine to harness renewable energy from urban areas.Mr Orellana and Mr Noorani, who are students at Lancaster University, have now been announced as the UK winner of this year’s James Dyson Award.Traditional wind turbines only capture wind travelling in one direction, but are very inefficient in cities where the wind is unpredictable and multi-directional.\nThe new O-Wind Turbine, uses its simple geometric shape to utilise this wind, and generate energy even when urban wind is at its most chaotic.\nMr Orellana said:\nWe hope that O-Wind Turbine will improve the usability and affordability of turbines for people across the world.\nCities are windy places, but we are currently not harnessing this resource. Our belief is that making it easier to generate green energy, people will be encouraged to play a bigger role in conserving our planet.\nWinning the James Dyson Award has validated our concept and given us the confidence to approach investors to secure the capital we need to continue turn our idea into a reality.\nProfessor Harry Hoster, director of Energy Lancaster at Lancaster University, said:\nWhen the two students first approached us about test facilities for a new wind turbine design, we first thought it would just be the 23rd variation of some plain vanilla system.\nWhen they humbly showed their video and their prototype, however, we were, excuse the pun, blown away.\nOnly holding it in your hands and playing with it gives you a chance to understand what their new device actually does and how, if things go right, its ability to capture any random breezes will take urban energy harvesting to another level.\nMr Orellana and Mr Noorani will now go forward to compete against other international entrants with the winner chosen by billionaire inventor Sir James Dyson, who founded the Wiltshire-based company in 1991.To help finalists to develop their idea, the overall winner is awarded £30,000 and the winners in each region receive £2,000. Nicolas Orellana, 36, and Yaseen Noorani, 24, have designed a wind turbine to generate electricity in large cities (Image: Dyson/PA Wire) 8:52 Jonathon Manning Forum Books gains national attention as part of Small Biz 100 list\nA much-loved book shop in Northumberland has been named as the only North East firm to make this year’s Small Biz 100 list .\nForum Books, in Corbridge, is an award-winning bookshop that stocks almost 10,000 hand-picked books for its customers to peruse.\nIt has now gained national recognition after being included in the Small Biz 100 list, which helps promote 100 local businesses across the UK in the run up to Small Business Saturday.\nCommenting on the accolade, owner Helen Stanton said:\nI am absolutely thrilled to be on the list. There are only two independent books shops on the list and it’s great to get recognition for that.\nPreviously, the business was spread across two separate shops, with one catering for adults and one for children, but the shop has now moved into a historic building at The Chapel opposite Pele Tower.\nMs Stanton said:\nWe moved at the end of February. We had the two separate shops and now we have everything under one roof.\nIt is a listed building so we had to keep the pulpit, which we now use for reading events. We also had to incorporate the pews into the book shop.\nThe Small Biz 100 list helps promote local firms across the UK by dedicating a day to each one in the run up to Small Business Saturday, which takes place on December 1.\nThe campaign is now in its sixth year, and last year helped encourage £748m to be spent with local firms on Small Business Saturday. Forum Books' new home at The Chapel (Image: Unknown) 8:47", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15112537;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-09-05T10:30:00.000+03:00", "crawled": "2018-09-06T23:12:39.022+03:00", "highlightTitle": ""}