{"organizations": [], "uuid": "589a77511f78a797983907a54e1ca84b513213ed", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15147190.ece/ALTERNATES/s1200/0_MFA-Bowling-Newcastle-has-closed.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-bowling-alley-closes-leaving-15147118", "country": "GB", "domain_rank": 21960, "title": "Newcastle bowling alley closes - leaving bowlers with just hours to collect their balls", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-13T15:11:00.000+03:00", "replies_count": 0, "uuid": "589a77511f78a797983907a54e1ca84b513213ed"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/newcastle-bowling-alley-closes-leaving-15147118", "ord_in_thread": 0, "title": "Newcastle bowling alley closes - leaving bowlers with just hours to collect their balls", "locations": [], "entities": {"persons": [{"name": "graeme whitfield", "sentiment": "negative"}], "locations": [{"name": "westgate road", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "mfa bowling newcastle", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "mfa bowl newcastle", "sentiment": "none"}, {"name": "newcastle bowl", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "MFA Bowling Newcastle has closed (Image: Graeme Whitfield) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nA popular bowling alley in Newcastle has closed its doors to the shock of customers, many who were given just hours to collect their belongings.\nMFA Bowl Newcastle , on Westgate Road, closed for business yesterday, marking the end of the bowling alley’s 55-year history.\nRegular bowlers were informed of the site’s closure via a Facebook message sent by the site’s manager, who said: “To all league bowlers at Newcastle Bowl, unfortunately with immediate effect the centre is now closed. We are trying to arrange to get people’s equipment out but as of 2pm today I will not be able to get back into the centre at anytime.\n“My apologies for the short notice... Currently, as I message you all, we are organizing a transit van to empty all the lockers into so your equipment is not locked on site. We have until 2pm today to do this.” A sign has been placed outside MFA Bowl Newcastle informing customers that the bowling alley has closed (Image: NCJ Media)\nA video has also been posted online at the centre turning off the lights at the bowling alley as the business closed. A voice on the video says: “The end of a chapter, the current closure of Newcastle Bowl. Hopefully we will see you very soon.”\nIt is unknown whether the bowling alley has closed for good or whether it will reopen under new ownership.\nMFA Bowl Newcastle can trace its history back to 1911 when the premises originally opened as the Brighton Electric Theatre. The 767-seat theatre was converted into a cinema 1947 and then a 10-pin bowling alley in 1963. Read More Watch armed officers storm bowling alley to end Nuneaton hostage situation\nA notice has been placed outside of the bowling alley informing customers that the site has closed. It added that those with enquiries should contact Doncaster-based Absolute Recovery Limited.\nA representative from Absolute declined to comment on the closure, and refused to say whether the closure was part of wider proceedings taking place across its parent company MFA Bowl. MFA Bowling Newcastle has closed (Image: Graeme Whitfield)\nMFA Bowl operates 19 sites across the UK, including two North East centres in North Shields and Sunderland.\nIn the company’s most recent financial accounts, covering the 12 months ending April 2 2017, company director Mehdi Afshar described a challenging market in which the company had to close its Peterborough Bowling Centre and its only snooker club in Bloxwich, in the West Midlands.\nHe said: “The Brexit in June was a big challenge to overcome and in my view to date is still threatening Read More Boutique bowling firm Lane7 is striking out around the UK - here's where it is headed next\nMr Afshar said in the accounts that he expected the year ahead to be “a challenging one with further decisions to be made to enable the company to continue from strength to strength.”\nAccording to information gathered from MFA Bowl’s website, the company has closed three of its sites since August 2018. Along with its Newcastle bowling alley, the company has also closed sites in Aldershot and Newbury. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-13T15:11:00.000+03:00", "crawled": "2018-09-13T16:18:17.003+03:00", "highlightTitle": ""}