{"organizations": [], "uuid": "5c7c851055f7cca551703ba1b0b0efd63793d8f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15156002.ece/ALTERNATES/s1200/0_SWNS_TRAFFIC_CAMERA_05.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/new-vulture-speed-cameras-can-15155925", "country": "GB", "domain_rank": 21960, "title": "New 'vulture' speed cameras can tell if you're on your phone or wearing your seatbelt", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-15T15:00:00.000+03:00", "replies_count": 0, "uuid": "5c7c851055f7cca551703ba1b0b0efd63793d8f2"}, "author": "Kathryn Riddell", "url": "https://www.chroniclelive.co.uk/news/north-east-news/new-vulture-speed-cameras-can-15155925", "ord_in_thread": 0, "title": "New 'vulture' speed cameras can tell if you're on your phone or wearing your seatbelt", "locations": [], "entities": {"persons": [{"name": "devon", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "News New 'vulture' speed cameras can tell if you're on your phone or wearing your seatbelt Dubbed the ‘yellow vultures’, the new average speed cameras have been introduced in Devon and can capture drivers committing offences behind the wheel Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily\nNew speed cameras which can capture drivers using their phone at the wheel have been introduced in the UK.\nDubbed the ‘yellow vultures’, the high-tech equipment can capture distracted drivers eating, drinking and smoking and even those who fail to secure their seatbelt.\nOne of the main new features is the LED infrared technology that can tell when offences other than speeding are being committed.\nThis includes drivers who aren’t wearing a seatbelt or are busy texting, reports Devon Live.\nEven those who commit driving offences at night can be caught with the new cameras.\nCurrently, the cameras have been deployed by Devon and Cornwall Speed Camera Partnership and aim to catch motorists putting themselves and other road users at risk. Read More Urgent appeal to find David Bennett who has now been missing for four weeks How do the new average speed cameras work?\nThe multiple cameras (at least two) are set at separate locations along a stretch of road (at a minimum 200m apart) and are synchronised to record the exact time that each car passes using number plate reading technology.\nThen a computer will work out the average speed between the cameras to determine if the car was breaking the speed limit.\nSome people wrongly think that each camera records a driver’s speed as they pass each camera before the computer works out the average speed as the car passed every camera - this explains why some drivers think they can speed up between the cameras and slow down as they pass them.\nBut doing this is likely to land you with a fine - the cameras simply record the time you pass them and the computer works out how long it has taken you to pass the distance between them. The new 'yellow vulture' traffic cameras which have been installed in Plymouth along with infra red LED lights (Image: Plymouth Herald / SWNS.com) Do the cameras work at night?\nYes. They are fitted with infrared illuminators to ensure they work night and day, and in all weathers. Can the cameras run out of film?\nNo. Unlike some other speed cameras, average speed camera information is saved to a computer. Can the cameras catch motorbikes?\nYes. The cameras are equipped to capture all types of vehicles. If a vehicle changes lanes will they avoid any fines?\nNo. The cameras calculate for lane changes. But this myth can mean people dangerously switch lanes increasing the chance of crashes. The new 'yellow vulture' traffic cameras which have been installed in Plymouth (Image: Plymouth Herald / SWNS.com) If a driver passes more than two sets of average speed cameras in a sequence while over the speed limit, will they be fined more than once?\nThis is unlikely. Only certain cameras in the sequence are usually ‘paired’, so where, for example, there are four in a sequence it may be your speed between the first and third that is recorded, or the second and fourth or first and fourth, and so on.\nBut you will not know which ones are recording your number plate at any time.\nWhere there are separate sections of the same road where average speed camera zones are in force, however, a driver would be committing separate offences by speeding through each one. Read More UK driving licences could be invalid in Europe under no-deal Brexit If you are less than 10 per cent above the limit, will you get a ticket?\nIt has been commonly assumed by many drivers over the years that you will not get a ticket so long as your speed does not exceed the limit by more than 10 per cent plus 2mph. This is because of guidance to officers from the National Police Chiefs Council.\nSeveral police forces nationwide have indicated that drivers can expect far less leeway, as cameras become more accurate - and the law states that a driver can receive a ticket as soon as they have exceeded the limit, even if it is only by 1mph. How can you avoid getting a fine?\nThere is only one way to be sure that you do not get a ticket from average speed cameras - and that is to drive without speeding. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-15T15:00:00.000+03:00", "crawled": "2018-09-15T16:36:13.004+03:00", "highlightTitle": ""}