{"organizations": [], "uuid": "5b600fe736da71f515ef9a17bd0202d7551166f1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15180365.ece/ALTERNATES/s1200/0_MKR_NEC_190918dreams_03.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/whats-on/arts-culture-news/city-dreams-initiative-just-ticket-15180353", "country": "GB", "domain_rank": 21960, "title": "City of Dreams initiative is just the ticket for Tyneside youngsters", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-20T19:36:00.000+03:00", "replies_count": 0, "uuid": "5b600fe736da71f515ef9a17bd0202d7551166f1"}, "author": "Mike Kelly", "url": "https://www.chroniclelive.co.uk/whats-on/arts-culture-news/city-dreams-initiative-just-ticket-15180353", "ord_in_thread": 0, "title": "City of Dreams initiative is just the ticket for Tyneside youngsters", "locations": [], "entities": {"persons": [], "locations": [{"name": "tyneside", "sentiment": "none"}, {"name": "gateshead", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}], "organizations": [{"name": "newcastlegateshead", "sentiment": "none"}, {"name": "north news & pictures", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "What's On City of Dreams initiative is just the ticket for Tyneside youngsters The City of Dreams initiative, launched in Newcastle and Gateshead this week, aims to get more children and young people involved in art and culture Share City of Dreams is an ambitious ten year mission for every child and young person in NewcastleGateshead, aiming to earn the city a reputation as the best place to be young (Image: North News & Pictures - northnews.co.uk) Get what's on\nTiming plays an important role in art and culture, from actors hitting their cues, dancers their marks and comedians delivering punchlines.\nThere’s also being in the right place at the right time – somewhere the City of Dreams initiative launched on Tuesday happily finds itself.\nIts ‘mission’ is to engage 165,000 children and young people every year for the next decade in NewcastleGateshead and enable them to take part in cultural and creative activity.\nJust two days earlier, research into 35 of the UK’s leading attractions’ ticketing policies found that while more than three quarters of them offered cheaper entry deals to the over-60s, only one of them – the Royal Shakespeare and Swan theatres in Stratford-upon-Avon – offered a young people’s discount. Speaker Kirsty Lang, centre, with young performers, left to right, Joshua Smith, Esther Kirk, Kema Sikazwe, Leah Shazad, Andrew Adams and Eddie Chappel (Image: North News & Pictures - northnews.co.uk)\nThe launch of City of Dreams was preceded earlier this year by a Big Culture Conversation in which children and young people aged 13 to 25 were asked to outline what they would like to see involved in the initiatives and their view of arts and culture in general.\nBen Dickenson, executive producer for City of Dreams, said: “The cost of seeing and doing cultural activity was the second highest barrier to taking part which those who contributed identified.\n“So, yes, tackling the cost of cultural engagement – especially pricing – is absolutely part of the 10-year strategy.”\nHe said that as a result, some changes to address this have been made.\nThey included: Live Theatre has introduced £6 tickets for under-25s across all their shows; Tyneside Cinema has extended its Young Tyneside scheme to apply to all films and everyone under 25, offering £4.50 tickets to any film any time; The Twilight Shows (piloted successful for the first time in May 2018) will offer free content for 12 to 17-year-olds between 4pm and 7pm at up to 60 venues over the Late Shows weekend each year.\nIt’s a good start for the initiative, which intends to support a generation of local children and young people to find their voice, influence decisions in the city, and grow the skills, confidence and talents to thrive.\nThe City of Dreams is consciously youth-orientated. Its strategy has been written by almost 1,000 children and young people, and is supported, by NewcastleGateshead Cultural Venues working in partnership with more than 40 arts, heritage, science, education, voluntary sector, health, local authority and business partners. Young performers at the Launch of City of Dreams hosted by Northern Stage (Image: North News & Pictures - northnews.co.uk)\nAndrew Adams, 16, from the Gateshead Youth Assembly, said: “City of Dreams is different because it’s for all children and young people in Gateshead and Newcastle, and because young people have been involved in how it works from the start through a Big Culture Conversation which has given 1,000 under-15s the chance to plan how it will work.”\nThe launch took place at a special event at Northern Stage in Newcastle, where 14 new programmes of activity were announced to support its aims.\nIt was led by young people from Newcastle Youth Council and Gateshead Youth Assembly, where the keynote speaker was broadcaster and cultural commentator Kirsty Lang, a regular presenter on radio 4’s Front Row. She is also a board member for the Baltic.\nRepresentatives from Newcastle and Gateshead Councils pledged their commitment while Vee Pollock, dean of culture at Newcastle University, and James Ramsbotham, North East England Chamber of Commerce, also voiced both their support and excitement about the project.\nBut it was an evening for young people, encapsulated both by its confident young presenters and two performances.\nThe first was by Cooper McDonough from the Young Company of Northern Stage, who performed a small piece from its production Where Do We Stand?, which could have been written for City of Dreams. It is poem in which Cooper speaks as a young person self-conscious about his artistic bent and torn between being an artist or a builder.\nIronically, as a bricklayer he works on buildings student accommodation in Newcastle. The second by Kema Sikazwe, a rapper from the West End of Newcastle who appeared in the film I, Daniel Blake.\nHis parents split up when he was young, then his mother died, and he poured his feelings into lyrics.\n“Music gave me a purpose,” he has said, and credits the Chat Trust in Arthur’s Hill, a youth project for 13 to 21-year-olds, with helping to steer him on to another path.\nHe performed a new rap for the event called This is My City, a heartfelt paean to Newcastle , his home.\nMr Dickenson said: “We know that growing up on Tyneside isn’t always easy but we firmly believe our city can earn a reputation as the best place to be young.\n“Over the last year we’ve worked with thousands of children and young people, and organisations in the arts, education, community, health, and science sectors, to come up with plans that can make a real difference to the lives of under-25s.”\nOver the 10 years to 2028, City of Dreams will lead multiple programmes engaging all under-25s in cultural and creative activity, supporting them to have a stronger voice in decisions about the city, and growing their skills, confidence and resilience.\nA Young Champions board, with members from Newcastle Youth Council and Gateshead Youth Assembly, aims to ensure a strong voice for under-25s.\nIn her speech Ms Lang gave a call to arms for City of Dreams.\nShe said: “My generation has made a right mess of this planet, a right mess of the economy, a right mess of Brexit, a right mess of the education system.\n“City of Dreams is about giving a voice to young people so they can tell their story, tell the older generation what they want the world to look like, but we need to give them the tools to tell their story.\n“But please let this be more than a slogan or a logo.\n“Let’s make this city synonymous with creativity.”\nTo find out more, visit www.cityofdreams.org.uk . Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-20T19:36:00.000+03:00", "crawled": "2018-09-20T22:10:52.021+03:00", "highlightTitle": ""}