{"organizations": [], "uuid": "65c7d756be5b0f914a5ec9e1f5348553d9292d44", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2003043.ece/ALTERNATES/s1200/0_Steve-Hindley_002JPG.jpg", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/business/leaders-call-great-south-west-2003037", "country": "GB", "title": "Leaders call for a Great South West 'ministerial champion'", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-17T02:00:00.000+03:00", "replies_count": 0, "uuid": "65c7d756be5b0f914a5ec9e1f5348553d9292d44"}, "author": "Hannah Finch", "url": "https://www.devonlive.com/news/business/leaders-call-great-south-west-2003037", "ord_in_thread": 0, "title": "Leaders call for a Great South West 'ministerial champion'", "locations": [], "entities": {"persons": [{"name": "steve hindley", "sentiment": "none"}, {"name": "hindley", "sentiment": "none"}, {"name": "philip hammond", "sentiment": "none"}], "locations": [{"name": "brexit", "sentiment": "none"}, {"name": "great south west partnership", "sentiment": "none"}, {"name": "south west", "sentiment": "none"}], "organizations": [{"name": "lep", "sentiment": "none"}, {"name": "pennon group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Leaders call for a Great South West 'ministerial champion' Steve Hindley, chairman of the Great South West partnership explains the next steps for the campaign Share Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nSteve Hindley CBE DL has more reason than most to listen closely when the Chancellor, Philip Hammond, reveals his Autumn Statement later this year.\nAs chairman of the Great South West Partnership, Heart of the South West LEP and Midas, one of the region’s biggest construction firms, he has been at the forefront of a campaign for the South West to get the recognition it deserves with the man who hold the country’s purse strings.\nMr Hindley said: “I am hopeful of getting a mention, they do know that the South West exists,” he said.\nMr Hindley is at the forefront of the Great South West vision. Together with the #BackTheSouthWest campaign, spearheaded by Western Morning News and Pennon Group, it quickly gathered momentum after the first South West Growth Summit in October 2016 - just four months after the decision to vote leave in the Brexit referendum.\nIt gave rise to The South West Growth Charter, which outlined priorities for the region and was heard in parliament. How can I support #BackTheSouthWest?\nThere's a few easy things you can do to help spread the message Tweet your using the #backthesouthwest hashtag Work with with other groups and organisations across the region Tell others why the South West is a great place to live and work Continue to put pressure on our MPs to promote the Great South West to ensure we get our fair share of Government investment\nSince then, the Great South West committee has been formed.\nNow, six months until Brexit actually happens in March, the alliance of business leaders, local authorities and higher education chiefs have officially launched its Great South West vision that aims to put the South West on the UK economic stage.\nMr Hindley said: “Having an identity is incredibly important. The Great South West is our equivalent of the Northern Powerhouse or the Midlands Engine.\n“We have told our MPs that we want them to put the Great South West on the map at Westminster. Read More 35 Devon business people under 35 th...\n“The Great South West already has an economy twice the size of Greater Manchester’s and the West Midland’s yet we do not share the same level of investment.\n“We have got Plymouth and Exeter and in terms of nuclear, we have the largest building project in Europe under way at Hinkley Point C.\n“This is essentially us putting forward our business case and it is great news that we have got the business sector in the driving seat.”\nThe Great South West vision covers the geographic area covered by LEPs in Dorset, Heart of the South West in Devon and Somerset and Cornwall.\nMr Hindley said that the inclusion of the West of England LEP, which covers Bristol, is an ‘ongoing dialogue’.\nThe West of England LEP is already partnered with the West of England Combined Authority (WECA), covering Bath & North East Somerset, Bristol and South Gloucestershire. It is led by Tim Bowles, the West of England Mayor, who was elected in May 2017 and has been given powers over spending, previously held by central government, on the region’s transport, housing, adult education and skills.\nMr Hindley said: “We have talked to them about it but they are getting on with their mayoral approach and probably have enough on their plates.”\nIn July, the Heart of the South West was chosen as one of six areas to work with the Government to develop its own local Industrial Strategy to set out priorities for government investment to boost productivity.\nThe strategy is due to be published in the Spring.\nCrucially, it offers a way for LEP areas that don’t have an elected mayor - like WECA - to bid for a slice of billions of pounds of funding available through the strategy to support areas including, tech, skills and innovation.\nMr Hindley said that devolution, with the mayoral system, ‘has been and gone.\n“The government has seen you have to get on with life and pragmatically, has seen that there is a different way of doing things with the LEPs.”\nAnd key to the strategy is partnerships, like the Great South West, that aim to supercharge economic growth. The £8 million EPIC centre opening in Paignton spring 2019 will be a hub for electronics and photonic businesses in Torbay (Image: TDA)\nBy defining the Great South West boundaries, Mr Hindley said that vision benefits from scale - from marine in Cornwall and Plymouth, photonics in Torbay and aerospace in Somerset.\nHe said: “This gives us the chance to really show what we can do, given the right backing from Government.” Read More\nThe Great South West already contributes more to UK gross value added than both Thames Gateway and Cambridge-Milton Keynes-Oxford corridor, areas that have been identified as an area of the UK to become the next Silicon Valley. Princess Yachts sold a jaw-dropping £30million worth of boats in just one week (Image: Penny Cross)\nIn December, Iain Stewart MP, who represents Milton Keynes South, was named a champion for the project, just as George Osborne has been for the Northern Powerhouse. Read More\nNow, the Great South West is calling for its own ministerial champion.\nMr Hindley said: “That’s our next step,” he said.\nHe also called on the region’s MPs to shout loudly for the region.\nHe said: “Our own MPs in the South West are very supportive but we want them to do more.” Read More\nThe region is home to the largest aerospace sector in the UK, with pioneering automotive, nuclear and marine renewables and microelectronics industries. It also has a growing creative and digital sector. Read More The 50 biggest businesses in Devon - revealed\nThe Great South West wants to make a case, through the aims of the government’s Industrial Strategy, for how the region can help boost the UK economy if it is given the right investment. Rt Hon Patrick McLoughlin Sec State Transport with Network Rail Chief Executive Mark Carne - Dawlish Railway Station viewing storm damage in 2014\nIt faces a number of challenges, including transport and connectivity, large dispersed populations and some of the country’s most deprived areas. This results in low productivity.\nTo tackle these challenges Great South West is calling the Government to support it to improve transport connectivity and strategic routes, drive productivity in trade and build supply chains and increase economic connectivity in the rural sector. Back The South West is spearheaded by the Western Morning News and Pennon\nA letter has been sent to James Brokenshire, Secretary of State for Housing, Communities and Local Government, to seek formal Government support and investment for Great South West.\nMr Hindley said: “If you sit here and moan about the fact that we need to improve the A303 and the railway at Dawlish but we don’t have enough money, we are not going to get anywhere.\n“We have to show that we are worth investing in and that the government is going to get something back in return.” Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-09-17T02:00:00.000+03:00", "crawled": "2018-09-17T02:51:57.022+03:00", "highlightTitle": ""}