{"organizations": [], "uuid": "4bbb0c65368b20f5a95a2a95978ab0aa17e50204", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15114258.ece/ALTERNATES/s1200/0_North-Gosforth-Park-street-scene-1-2.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/barratt-reports-big-rise-profits-15114189", "country": "GB", "domain_rank": 21960, "title": "Barratt reports big rise in profits despite fears over housing market", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-05T14:42:00.000+03:00", "replies_count": 0, "uuid": "4bbb0c65368b20f5a95a2a95978ab0aa17e50204"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/barratt-reports-big-rise-profits-15114189", "ord_in_thread": 0, "title": "Barratt reports big rise in profits despite fears over housing market", "locations": [], "entities": {"persons": [{"name": "barratt", "sentiment": "neutral"}], "locations": [{"name": "north gosforth park", "sentiment": "none"}], "organizations": [{"name": "invalid email housebuilder barratt developments", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Barratt reports big rise in profits despite fears over housing market Housebuilder remains confident despite rise in interest rates and rumours that Right to Buy could end Share Barratt Homes has received unprecedented interest in its new development, North Gosforth Park, and is urging buyers to act quickly and book an appointment to avoid missing out (Image: handout from client) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nHousebuilder Barratt Developments has posted a hefty rise in annual profits as it hailed an “outstanding” year.\nThe Newcastle-founded group posted 9.2% rise in annual pre-tax profit to a record £835.5m, while revenue increased 4.8% to £4.87bn.\nCompletions were up 1.1% to 17,579 - the highest number in a decade - and the average selling price on completion increased 5% to £288,900.\nBarratt said market conditions remain good and the availability of attractive mortgage finance and the Government’s Help to Buy scheme continue to support “robust consumer demand”.\nChief executive David Thomas said: “The group has had another outstanding year delivering a strong operational and financial performance, and our highest volumes in a decade. Barratt Developments chief executive David Thomas (Image: handout)\n“As the UK’s largest housebuilder, we are helping to address the country’s housing shortage - creating jobs and supporting economic growth whilst continuing to lead the industry in quality and customer service.”\nThe positive comments come despite reports surfacing over the weekend that Help to Buy will be scrapped in 2021, as well as warnings from rival firms over Brexit.\nBarratt also announced new medium-term operational targets, including volume growth of 3% to 5% per year and a minimum 25% return on capital employed . Forward sales are up 11.1% at £3bn.\nMr Thomas added: “The group starts the new financial year in a good position with a strong balance sheet, healthy forward sales and robust consumer demand supported by a positive mortgage environment.”\nLaith Khalaf, senior analyst at Hargreaves Lansdown, said that while the results were positive, worries about the housing market persist.\n“The market is worried about three things which are out of Barratt’s control - Brexit, interest rates and Help to Buy.\n“There are concerns that withdrawal from the EU may not be an entirely smooth ride, and that puts a dampener on stocks like Barratt, which are plugged into the domestic economy.\n“The Bank of England is raising interest rates, albeit slowly, but that’s a reversal of direction from the last 10 years of monetary policy.\n“Finally, the end of the Help to Buy scheme is hoving into view, and unless the government extends this in some form beyond 2021, that spells the removal of a key lynchpin in the new build property market.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-05T14:42:00.000+03:00", "crawled": "2018-09-07T12:45:33.015+03:00", "highlightTitle": ""}