{"organizations": [], "uuid": "2bd90775e70f2e8630ac679941ba48d1b80d3faf", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2013458.ece/ALTERNATES/s1200/0_CapturePNG.png", "site_section": "http://www.westernmorningnews.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/steven-bracher-devon-bomb-maker-1720343", "country": "GB", "title": "Racist with hate messages against Lenny Henry and Dawn French turned home into bomb-making factory full of explosives", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-17T16:20:00.000+03:00", "replies_count": 0, "uuid": "2bd90775e70f2e8630ac679941ba48d1b80d3faf"}, "author": "Paul Greaves", "url": "https://www.devonlive.com/news/devon-news/steven-bracher-devon-bomb-maker-1720343", "ord_in_thread": 0, "title": "Racist with hate messages against Lenny Henry and Dawn French turned home into bomb-making factory full of explosives", "locations": [], "entities": {"persons": [{"name": "lenny henry", "sentiment": "none"}, {"name": "dawn french", "sentiment": "none"}, {"name": "steven bracher", "sentiment": "none"}, {"name": "bracher", "sentiment": "none"}, {"name": "tawton", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "barnstaple", "sentiment": "none"}], "organizations": [{"name": "invalid email", "sentiment": "none"}, {"name": "exeter crown court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now\nA Devon man has been jailed for secretly stockpiling an arsenal of bombs, weapons, and hate-filled diaries about celebrities and gay people at his house.\nThe hoard of explosives was discovered near Barnstaple at the home of Steven Bracher and also included over a hundred bottles of chemicals piled on tables. Bracher, 56, had turned his home in the quiet village of Bishop Tawton into a chemical laboratory and dangerous bomb-making factory.\nThe bomb squad made safe 17 Improvised Explosive Devices and a 9kg fertiliser bomb found under the bed. They took the fertiliser bomb onto Dartmoor and blew it up, filming the detonation to show the power of the blast. See the video above.\nBracher was jailed three years and four months at Exeter Crown Court for three counts of having explosive devices, one of possessing a knife in public and one of possessing amphetamine. Read More Three arrested after police called to reports of 'serious sexual assault' at Torquay hotel Explosives found at home of Steven Bracher\nAlong with the explosives, which police have not linked to terrorism, were disturbing diary entries penned by Bracher detailing his extreme homophobic, racist, and anti-government views. His scribblings included hate-fuelled rants against black people, and mentioned the actors Lenny Henry, Dawn French and Brexit.\nThey included regular use of the N-word and anger at Henry and French's relationship. In one passage he ranted: \"It's time to kill the rich, kill the liars, kill the c***s. 'I'll kill them all, the f g lot f them.\" Dawn French and Lenny Henry following their wedding at St Paul's Church in London's Covent Garden (Image: PA)\nJudge David Evans said: \"Amongst the somewhat rambling entries in the notebook were clear expressions of racist and homophobic attitudes and expressions of aggressive hostility to other groups in society.\"\nHe said the explosives had 'the potential for death or serious injury'. Steven Bracher was a loner with few friends. Nobody knew the extent of his addiction to explosives before police stumbled upon his dangerous hoard\nThe defendant was described by police as somebody who had ‘disassociated himself’ from society.\nHe lived alone in historic almshouses in the village, with a small circle of friends, was unemployed, enjoyed metal detecting and had a fascination with explosives - or as he called them ‘fireworks’.\nOn January 24 this year he went to Boots the chemist in Barnstaple and told them he had lost his Subutex medication - the drug used as a legal substitute for addicts.\nHe was searched by security who found a knife on him. Police were called and Bracher produced a test tube size container with black powder in it which turned out to be gunpowder. Home of Steven Bracher\nWhile he was taken to the station police searched his home and were shocked by what they found.\nThey discovered IEDs and bottles of chemicals scattered around the scruffy looking room. Royal Navy bomb disposal experts were called in. Items found at home of Steven Bracher\nDet Insp Phil Gray, who led the investigation, said: “The devices located were all viable devices and the scene was closed down.\n“At no point were the public at risk from the explosives. We did not evacuate the nearby school which backed onto the garden on the advice of the Explosive Ordnance Department.” The bomb experts were certain the stone wall at the rear of the property would have contained any blast within the property. Explosives found at home of Steven Bracher Read More\nThe bomb squad spent three days at the address combing it for devices and assessing the extent of the find. They also made the explosives safe.\nExperts from the forensic explosive laboratory in Kent also came down to help.\nSome of the IEDs were made using metal table legs with the end sealed by 10p pieces and fuses attached. Inside was a combination of potassium nitrate, sulphur and charcoal. Others were assembled using cardboard tubes with cork stoppers and firework inside. They would have been dangerous when detonated, particularly in confined spaces, and would have sent shrapnel and fragments into the air. Chemicals found at home of Steven Bracher\nPolice found a bucket under the bed. Inside the bucket was a mixture of ammonium nitrate and fuel oil known as ANFO. The substance was effectively a 9kg bomb, the largest explosive found at the property. It was later taken to a military firing range on Dartmoor and safely detonated. Weapons found at home of Steven Bracher\nProsecutor David Sapiecha described it as a high explosive capable of causing significant damage.\nA number of crossbows and other weaponry was also found at the property. On the walls were maps, small metal items, and a chemical periodic table. Police were initially concerned the maps represented the location of stockpiles but it turned out Bracher had a harmless hobby of metal detecting and the items on the walls were mostly his farm tool finds.\nMr Sapiecha said the weapons included three machetes, two knives, an axe, air pistols, catapults, and hooks.\n\"Available to him he had an arsenal which could have been devastating if used,\" he said.\nWe talk to police about Steven Bracher: Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nHe said Bracher had turned his home into a 'makeshift chemical laboratory'.\nA white substance was found in the microwave where Bracher was trying to cook up crystal meth. Police say he had an extensive self-taught knowledge of chemicals and how to make explosives but probably not the knowledge to make crystal meth. Microwave found at home of Steven Bracher\nThe chemicals, which included hydrochloric acid, could have been used as poisons but police think Bracher collected them in connection with his crystal meth and bomb making activity.\n“Bracher is an individual who, from what we can tell, has disassociated himself from general society, although he has a small circle of people he would see,” said DI Gray.\nPolice also found disturbing diaries filled with hate-fuelled rants against black, Asian, Chinese and gay people. He referred to Lenny Henry as being 'nasty' and criticised Ms French for her relationship with him, calling her 'an insult to decent white folk'.\nWatch next: DAWN FRENCH OPENS UP ABOUT RACIST ABUSE HER AND LENNIE HENRY SUFFERED DURING MARRIAGE Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nBracher also appeared to hold anti-government views and mentioned Brexit, although none of the scribblings made specific or planned threats against any individuals.\n\"I believe in freedom of speech\" he wrote before going on to list insulting names for people based on their race.\n“His views are extremely concerning,” said DI Gray. Explosives found at home of Steven Bracher\n“They were against society generally. They made hard reading.\n“Initially the question was raised about terrorism but I can tell you at no point was this treated as a terrorist-related incident,” he added. Chemicals found at home of Steven Bracher\n“All the chemicals and IED were recovered and removed. Without our partners we wouldn’t have been in the position we are today. In the first week of the investigation myself and the team were under immense pressure because of the scrutiny applied to the incident and it is a testament to the work of the team in getting sufficient evidence that we got these early charges and Bracher into custody.”\nDI Gray said Bracher was cooperative with police after his arrest. Anfo explosive found at home of Steven Bracher\n“The language he uses is very different to ours in this matter,” he said.\n“In his mind they are fireworks and he was making fireworks whereas to us they are clearly explosives. There is a danger in that he does not understand what potentially he was doing. The potential of what he could have done is quite extensive. He's more fascinated in making explosives, taking them away and seeing them go bang.”\nPolice don’t believe Bracher bought the weapons illegally and probably stockpiled them over years. He didn’t own a computer and had a hand injury from a previous explosion. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-09-17T16:20:00.000+03:00", "crawled": "2018-09-17T16:39:42.003+03:00", "highlightTitle": ""}