{"organizations": [], "uuid": "f3f2579b38cc5e8e3197b08c7cbe3e5884b545c6", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15162402.ece/ALTERNATES/s1200/0_duo.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/lookers-acquires-jennings-motor-group-15162315", "country": "GB", "domain_rank": 21960, "title": "Lookers acquires Jennings Motor Group in landmark deal for North East car retail sector", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-17T14:35:00.000+03:00", "replies_count": 0, "uuid": "f3f2579b38cc5e8e3197b08c7cbe3e5884b545c6"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/lookers-acquires-jennings-motor-group-15162315", "ord_in_thread": 0, "title": "Lookers acquires Jennings Motor Group in landmark deal for North East car retail sector", "locations": [], "entities": {"persons": [{"name": "nas khan obe", "sentiment": "none"}, {"name": "jennings", "sentiment": "none"}, {"name": "andy bruce", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "invalid email north east", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}], "organizations": [{"name": "jennings motor group", "sentiment": "negative"}, {"name": "jennings motor group get", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "benfield motors", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Lookers acquires Jennings Motor Group in landmark deal for North East car retail sector Lookers has said the deal cements its confidence in the wider UK automotive sector Share Lookers chief executive Andy Bruce (left) and Nas Khan OBE, managing director of Jennings Motor Group Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nNorth East motor retailer Jennings has been snapped up by national chain Lookers.\nThe deal to acquire Washington’s Jennings Motor Group was carried out for an undisclosed sum, and Lookers said it enforces its position as one of the largest motor retailers in the country.\nLookers’ acquisition follows on from its purchase of Newcastle based Benfield Motors three years ago, which saw it add 30 dealerships to its portfolio.\nLookers chief executive Andy Bruce said: “The acquisition of Jennings is a perfect fit for Lookers and is aligned to our business model of operating the right brands in the right locations.\n“We are delighted to expand our key partnership with Ford of Britain, the market leading brand in the UK. Geographically the Jennings acquisition joins together our existing Ford market areas in Sunderland and Yorkshire.\n“There is a strong cultural alignment between the two companies. Both place the customer at the heart of the business, offer excellence in customer service and attract and retain the best people in the industry.\n“I would like to welcome all of the great people in Jennings into the Lookers group. We’re proud to have acquired this highly respected business and we aim to help it to accelerate its growth under our ownership.” Read More Brexit will be bad for us, say more than half of North East businesses\nJennings sells vehicles from a range of manufacturers, including Ford, Kia, Seat and Mazda.\nLookers said that the acquisition highlighted its confidence in the UK automotive industry and the continued demand for new and used cars.\nDr Nas Khan, chairman of Jennings, said: “The sale to Lookers represents the next stage in the evolution of a company which, just over 100 years ago, was one of the first companies in the country appointed by Ford to sell its cars.\n“It is all our employees, past and present, and our customers who have made the business what it is, as well as our excellent relationship with our manufacturers.\n“I am proud to hand over the business in such good shape to Lookers, for them to continue with the standards of customer service and care which typifies the Jennings brand.” Read More Newcastle aims to become digital city to head next industrial revolution\nDuring the deal Jennings was advised by UHY Hacker Young Manchester LLP.\nDavid Kendrick, a partner at the firm, said: “Jennings has been a long established and very successful group for many years now. The acquisition by Lookers makes complete sense and complements their strong North East presence, also enhancing their Ford representation.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-17T14:35:00.000+03:00", "crawled": "2018-09-17T14:54:08.015+03:00", "highlightTitle": ""}