{"organizations": [], "uuid": "60c99b2cce18a367ca11f89911843ce6c88338fd", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15147309.ece/ALTERNATES/s1200/0_L-R-TusPark-Newcastles-Colin-Tan-with-Sintons-solicitor-Luke-Philpott-and-the-seven-members-of-th.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/chinese-officials-promote-international-trade-15147291", "country": "GB", "domain_rank": 21960, "title": "Chinese officials promote international trade during visit to Newcastle", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-13T15:25:00.000+03:00", "replies_count": 0, "uuid": "60c99b2cce18a367ca11f89911843ce6c88338fd"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/chinese-officials-promote-international-trade-15147291", "ord_in_thread": 0, "title": "Chinese officials promote international trade during visit to Newcastle", "locations": [], "entities": {"persons": [{"name": "colin tan", "sentiment": "none"}, {"name": "anji", "sentiment": "none"}, {"name": "luke philpott", "sentiment": "none"}, {"name": "sintons", "sentiment": "none"}], "locations": [{"name": "anji county", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "zhejiang", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "china share", "sentiment": "none"}], "organizations": [{"name": "newcastle government", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "negative"}, {"name": "tuspark newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Chinese officials promote international trade during visit to Newcastle Government officials visited TusPark Newcastle to encourage high growth firms to trade in China Share (L-R) TusPark Newcastle's Colin Tan with Sintons solicitor Luke Philpott and the seven members of the ANji trade delegation (Image: CREST PHOTOGRAPHY) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nA delegation of senior Chinese government officials has visited Newcastle to promote business links between the two countries.\nThe seven-strong group of officials arrived from Anji county, in the Zhejiang province of China, used the event to hail their home region as a place that would welcome growing businesses from the North East.\nAnji is only 50km from Shanghai, and its officials are working to attract foreign companies with high growth potential to expand into the county. The area has a growing economy and is responsible for more than half of the world’s bamboo supply.\nThe link-up was made possible through the North Britain Chinese Entrepreneurs Association (NBCEA) and the TusPark business park in Newcastle.\nShen Mingquan, secretary of the Anji County Committee of the CPC, said: “We are honoured to have been able to visit Newcastle. We wanted to come here to help build the connection between our two cities and two countries, and from there, we are sure that business opportunities between the two places will also come.\n“Anji would love to welcome businesses from Newcastle and we hope people will visit our beautiful region to see for themselves what we have to offer.”\nJohnny Qi, chairman of the NBCEA, said: “The relationship between the North East and China has been growing for many years, as more people from China move here and settle here, and there are many links.\n“Thanks to TusPark, many students and entrepreneurs have learnt a lot more information about China and why they would want to do business there. The visit from Anji has shown us why it would be of such benefit to be based there.\n“We believe that with the support of the Anji government, the help of TusPark, and the hard work of the businesses, we will see many business opportunities as a result of this event.”\nThe visit was hosted by TusPark Newcastle - a Chinese-owned business centre that supports local tech companies and provides advice and funding to firms looking to trade with China. Read More 'Disaster' warning for North East car industry if Brexit goes wrong\nAfter being spun out of Tsinghua University, TusPark Holding Limited now operates around 40 science and business parks around the world. Its Newcastle office, based on Grainger Street, is the only one outside of China to be opened solely by the company.\nSince opening in the North East, TusPark Newcastle has invested £50,000 in 10 UK companies through its Forge programme, organised meetings in China for UK businesses, and offered the former residents of Campus North a new home after the site announced it was closing.\nColin Tan, head of TusPark Newcastle, said: “The whole idea of TusPark Newcastle is to bring friendship between the UK and China, and to show off the very best of both.\n“Anji is not just a beautiful place, it is a very strong place to do business. There are many opportunities there for the kind of businesses we work with - those who are growing and are scaling up - and we can help support them with such expansion.”\nThe event was attended by senior figures from across the region including representatives from Newcastle University, Newcastle City Council and TusPark Newcastle’s partner law firm Sintons. Read More Newcastle estate agent Sanderson Young is up for sale - but boss says he'll still be in charge\nLuke Philpott, solicitor at Sintons, said: “While it has only been operational for a few months, TusPark Newcastle has already become known as one of the best places around in supporting and inspiring businesses.\n“The esteem and high regard which it has already built in its native China is evident through it being able to host a visit from senior government officials, who were thoroughly impressed by what they saw. Through the diligence of Colin and his team, I am confident this will lead to opportunities for North East businesses.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-13T15:25:00.000+03:00", "crawled": "2018-09-13T16:18:16.011+03:00", "highlightTitle": ""}