{"organizations": [], "uuid": "c4b40b0f921d09ba6ea6cff293c64603e3ce6f87", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article361724.ece/ALTERNATES/s1200/Anne-Marie-Morris.jpg", "site_section": "http://www.middevongazette.co.uk/letters.rss", "section_title": "Devon Live - News Opinion", "url": "https://www.devonlive.com/news/news-opinion/health-system-fails-meet-needs-2017448", "country": "GB", "title": "Our health system fails to meet the needs of rural communities like ours", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-18T16:24:00.000+03:00", "replies_count": 0, "uuid": "c4b40b0f921d09ba6ea6cff293c64603e3ce6f87"}, "author": "Anne Marie Morris", "url": "https://www.devonlive.com/news/news-opinion/health-system-fails-meet-needs-2017448", "ord_in_thread": 0, "title": "Our health system fails to meet the needs of rural communities like ours", "locations": [], "entities": {"persons": [{"name": "anne marie mor", "sentiment": "none"}, {"name": "anne marie morris", "sentiment": "none"}], "locations": [], "organizations": [{"name": "all-party parliamentary group on rural health and social care", "sentiment": "none"}, {"name": "newton", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News opinion Our health system fails to meet the needs of rural communities like ours Anne Marie Morris MP says that the health system does not meet the needs of rural communities Share\nANNE MARIE MORRIS IS THE CONSERVATIVE MP FOR NEWTON ABBOT AND HAS BEEN SINCE 2010\nThe health system works well for urban areas but fails to adequately meet the needs of rural communities like ours with sparse populations, inadequate infrastructure for travel and communication and a disproportionate number of individuals over 85 with complex health needs.\nMental health issues are compounded by the challenge of loneliness for many – both those working and retired. I have been lobbying for years to get this addressed and will continue to do so.\nIn 2016, I set up the All-Party Parliamentary Group on Rural Health and Social Care. The purpose of the group is to develop evidence-based policy recommendations for the Government on rural health and social care for England. The group has undertaken research around the world to understand how other countries have approached the problem. As we return to Westminster the fight continues. Anne Marie Morris MP\nThe first autumn meeting of our group will concentrate on mental health issues, considering how they are addressed in rural communities, how they differ from urban communities and what could be done better. Read More How to get help if you're struggling...\nAt the beginning of July, the pioneering new National Centre for Rural Health and Care was formally launched in Lincoln at Bishop Grosseteste University. I have been in conversation with the new National Centre for the last two years as it has developed, and I am delighted with the work that they are undertaking to shine a light on and improve health and care for rural areas. Read More Modern slavery is an abhorrent crime and a serious abuse of human rights\nWorking with the National Centre, the APPG will be launching a Parliamentary Inquiry in October to look at the key issues facing the country in providing good quality and effective health and social care to those living in rural areas. There is scope for this project to bring about real change to the way people living in regions like ours access health and care services and I am very much looking forward to chairing the enquiry. Anne Marie Morris MP\nThe Inquiry will begin by looking at the question of what do we mean by rural and what is different about rural needs. Clearly the needs of Surrey differ greatly from the requirements here in Devon, and the challenges we face include accessible care to those who live in remote rural locations. Read More Chequers proposal falls short of a clean, free-trading Brexit in which UK takes back control\nWe will look at the best practice examples of how primary, secondary and emergency care are delivered both in the UK and abroad. We will also look at the role technology can play in diagnosis, condition monitoring and health and care delivery.\nIn developing countries that do not have a national health and care system like ours, governments are looking at how technology can do the job instead, not because it is better, but because they are coming from a standing start. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-09-18T16:24:00.000+03:00", "crawled": "2018-09-18T16:57:07.039+03:00", "highlightTitle": ""}