{"organizations": [], "uuid": "95e43e797a268421195f79692dd980074c6b22f2", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.plymouthherald.co.uk/news/business/article1705737.ece/ALTERNATES/s1200/House-of-FraserJPG.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/exeters-house-fraser-set-close-2057861", "country": "US", "title": "Exeter's House of Fraser set to close as Plymouth's to remain open", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-29T20:16:00.000+03:00", "replies_count": 0, "uuid": "95e43e797a268421195f79692dd980074c6b22f2"}, "author": "Jamie Hawkins", "url": "https://www.devonlive.com/news/devon-news/exeters-house-fraser-set-close-2057861", "ord_in_thread": 0, "title": "Exeter's House of Fraser set to close as Plymouth's to remain open", "locations": [], "entities": {"persons": [{"name": "house of fraser", "sentiment": "none"}, {"name": "andrew gordon", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "cornwall", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "plymouth", "sentiment": "none"}, {"name": "house of fraser", "sentiment": "none"}, {"name": "kpmg plymouth", "sentiment": "none"}, {"name": "plymouth’s house of fraser", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Exeter's House of Fraser set to close as Plymouth's to remain open Earlier this years it was confirmed Exeter's branch would stay open and Plymouth's would close Share Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nPlymouth’s House of Fraser store is to remain open and Exeter’s will close in a huge U-turn.\nReports suggest that the troubled department store will shut its Exeter branch in January , with Plymouth’s branch set to be the only House of Fraser store in Devon and Cornwall.\nIf Exeter’s store does indeed close, it would reverse the announcement earlier this year that the High Street shop would be spared from closure and Plymouth’s would face the axe.\nIn June, it was reported that the Exeter branch would remain open due to shoppers having the deepest pockets in Devon.\nAt the time, retail expert, Andrew Gordon, Director at KPMG Plymouth, said it was down to the prosperity of Exeter which means it can sustain a high-end department store. Exeter's House of Fraser store\nHe said: “Exeter in recent years has enjoyed strong economic performance with Gross Value Added (“GVA”) per head significantly higher than in comparison to other areas of Devon. Read More Fears for Moss Bros as it blames World Cup for huge losses\n“This has driven a significant increase in housing activity as the city continues to grow. This growth together with recent high profile events such as the IKEA opening has helped support the retail sector in Exeter.”\nONS figures show that Exeter workers are the highest paid in all of Devon and Cornwall, with full-time jobs paying an average £537 a week. In Plymouth, workers earn on average £16 less at £521 a week. Read More Online orders cancelled\nWorkers in Teignbridge get the least in the region, averaging £403 a week.\nExeter tops the charts for the best paid jobs – 56 per cent of workers are in higher level occupations in knowledge-intensive sectors like science. Plymouth City Centre's House of Fraser store\nHowever, it was confirmed in August that Plymouth's store would be saved following Sports Direct owner Mike Ashley's takeover.\nThe new owners of House of Fraser have agreed commercial terms to remain in occupation at Royal Parade store, which extends to 184,000 sq ft. Read More B&Q is in trouble as profits and shares fall - and it's blaming Brexit\nThe Plymouth store had previously been earmarked for closure under the terms of the Company Voluntary Arrangement (CVA).\nA spokesperson said the the quick conclusion to this transaction reflects the close working relationship and shared ambition from both House of Fraser and British Land who own the building. What is a CVA (Company Voluntary Arrangement) and how do they work?\nSo, what is a CVA and why does it work for chains?\nIn a nutshell a CVA is an offer to creditors by a company, overseen by a Licensed Insolvency Practitioner like myself. The company must disclose what assets it has, everything it owes to suppliers and lenders, before offering a reduced payment back. That’s on the basis that a reduced payment back is better than the alternative of complete closure and liquidation.\nHow to look after employees when your company gets into financial difficulty\nCreditors usually agree to it. It’s not nice but getting some of your money back over a period of time is better than none of it.\nBy value, a company needs 75% of its creditors to say yes to the CVA for it to be approved. In a number of the high-profile cases the largest creditor on the list is the owner of the chain, so they can almost push the acceptance of the CVA through.\nThe CVA is then used to get out of individual unprofitable shop or restaurant leases. The company achieve this by offering landlords two choices:\n• To accept the CVA and a much-reduced rent, in return for the company staying on the premises.\nWhy is the construction industry so vulnerable to financial distress?\n• Or, if the landlord will not accept the CVA, the company will move out, take the fixtures and fittings and leave the landlord with a large shop or restaurant empty.\nEven though there is a written lease, often with a 25-year commitment to pay rent, the landlord can only claim for one year’s loss of rent against the company and only vote for that in the CVA.\nOne of the key features of a CVA is that the directors stay in control of the company. They never hand over control to someone else like an Administrator or Liquidator. It also keeps the existing company intact so there is no need to set up a new one, meaning there is no need to notify employees, change banks or assign property leases on the retained sites. David Kirk, Kirks Insolvency\nNot only does the deal save a key store in Plymouth it also gives House of Fraser the platform to invest properly in creating a sustainable long term department store offer. House of Fraser, Plymouth (Image: Paul Slater)\nJames Keany Head of National Agency at CBRE who acted on the negotiations said: “This is another example of what can be achieved when landlords work with us to ensure we deliver on the House of Fraser rescue plan.\n\"This deal also shows the commitment from House Of House Fraser not only to key flagship locations such as Oxford Street but also across the rest of the UK in regional markets ”. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nDarren Richards of British Land said; \"This swift and positive collaboration between British Land, Plymouth City Council and Sports Direct will see House of Fraser retained as a key feature of Plymouth city centre. Read More\n\"Building on our significant investment in Plymouth over recent years, we greatly look forward to continuing our productive working relationship with our customers, the local community and the Council in order to deliver our combined vision for the City.”\nIt is believed signs will go up confirming Exeter's House of Fraser store closure on Monday. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-09-29T20:16:00.000+03:00", "crawled": "2018-09-29T20:55:45.000+03:00", "highlightTitle": ""}