{"organizations": [], "uuid": "5cba6a1ffa238ae10cd9820635a7f78d5faea031", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14957207.ece/ALTERNATES/s1200/0_Sunderland-Unveil-New-Signing-Rees-James.jpg", "site_section": "http://www.chroniclelive.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/sport/football/transfer-news/sunderland-youngster-luca-stephenson-set-15102333", "country": "GB", "domain_rank": 21960, "title": "Sunderland youngster Luca Stephenson set to join Liverpool - but for far less than quoted", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-02T20:00:00.000+03:00", "replies_count": 0, "uuid": "5cba6a1ffa238ae10cd9820635a7f78d5faea031"}, "author": "Stuart Rayner", "url": "https://www.chroniclelive.co.uk/sport/football/transfer-news/sunderland-youngster-luca-stephenson-set-15102333", "ord_in_thread": 0, "title": "Sunderland youngster Luca Stephenson set to join Liverpool - but for far less than quoted", "locations": [], "entities": {"persons": [{"name": "luca stephenson", "sentiment": "negative"}, {"name": "stephenson", "sentiment": "none"}, {"name": "wearsider jordan henderson", "sentiment": "none"}, {"name": "paul reid", "sentiment": "none"}, {"name": "jordan henderson", "sentiment": "none"}], "locations": [{"name": "merseyside", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "sunderland", "sentiment": "negative"}, {"name": "liverpool", "sentiment": "negative"}, {"name": "sunderland afc", "sentiment": "negative"}, {"name": "the black cats", "sentiment": "none"}, {"name": "reds", "sentiment": "none"}, {"name": "academy of light", "sentiment": "none"}, {"name": "invalid email liverpool", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get Sunderland AFC updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nLiverpool are hoping to sign Sunderland’s 15-year-old midfielder Luca Stephenson – but for considerably less than the £500,000 fee reported.\nSources on Merseyside have confirmed that the Reds are optimistic of striking a deal, but for around a third of the price quoted in a report in the Sun on Sunday.\nStephenson has drawn comparisons with fellow Wearsider Jordan Henderson, who made the move as a first-teamer for £16m in 2011.\nThe news that another talented youngster is set to leave shows that the battle for young talent at the Academy of Light continues unabated, and that it is a two-way one. Luca Stephenson has drawn comparisons with former Sunderland man Jordan Henderson (Image: Getty Images Europe)\nThe Black Cats have signed 12 senior players this summer, but their recruitment has not stopped there.\nSunderland appointed a new academy manager in Paul Reid this summer, and have tried to hoover up some of the best talent not making headway in the Premier League academies, taking advantage of their League One status to offer a more realistic pathway into the first team.\nJack Bainbridge has joined from Everton, Jordan Hunter from Liverpool and Max Johnstone from Manchester United. They have looked further afield too, signing Lilyan Compper from COS Villers, while investor Juan Satori has talked about bringing over Uruguayan youngsters as a first step into European football, though Brexit could have implications for that. Read More Sunderland must tread carefully as stepping-stone club but growing talent no longer a local affair\nIn his first day in the job executive director Charlie Methven spoke about using Borussia Dortmund as a model, and one thing the Bundesliga do well is buying in talented academy-age footballers from across the world.\nPicking up players good enough to be at Premier League academies but not so outstanding as to have forced their way into the first team could be a lucrative business. Get one right, and you have an asset who could fund the running of the academy for years to come. The most expensive player to have come through Sunderland’s academy to date is £30m goalkeeper Jordan Pickford, and he was locally sourced. Lynden Gooch of Sunderland (Image: Sunderland AFC)\nBut equally, rival clubs are aware of the strength of Sunderland’s academy, and those higher up the chain are looking to use their greater financial muscle – and glamour – to extract the best players from the Academy of Light.\nEngland Under-16 striker Sam Greenwood turned down a contract to join Arsenal this summer. According to the Sun on Sunday Stephenson is happy on Wearside, but has been made an offer too good to refuse. Read More Sunderland's new academy manager Paul Reid not planning any wholesale changes to set-up\nPicking up exciting young talent from elsewhere is not a new policy at Sunderland. Californian Lynden Gooch , an ever-present in League One this season, joined as a ten-year-old, and four-goal Josh Maja trained with Crystal Palace, Fulham and Manchester City before moving to Wearside. He is born in London. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-02T20:00:00.000+03:00", "crawled": "2018-09-03T00:06:59.000+03:00", "highlightTitle": ""}