{"organizations": [], "uuid": "464d59771eaa60d592416a946d4fe94613cd8a80", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article1963482.ece/ALTERNATES/s1200/1_MSP_MERC_01AUG18_10470JPG.jpg", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/norton-motorcycles-boss-stuart-garner-1963413", "country": "GB", "domain_rank": 48128, "title": "Norton Motorcycles boss Stuart Garner on Brexit - “UK better prepared than media has us believe” - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.963, "site_type": "news", "published": "2018-09-04T03:00:00.000+03:00", "replies_count": 0, "uuid": "464d59771eaa60d592416a946d4fe94613cd8a80"}, "author": "Ian Strachan", "url": "https://www.leicestermercury.co.uk/news/business/norton-motorcycles-boss-stuart-garner-1963413", "ord_in_thread": 0, "title": "Norton Motorcycles boss Stuart Garner on Brexit - “UK better prepared than media has us believe” - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "stuart garner", "sentiment": "negative"}, {"name": "norton", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "castle donington", "sentiment": "none"}, {"name": "norton", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "japan", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "donington hall", "sentiment": "none"}, {"name": "australia", "sentiment": "none"}, {"name": "leicestershire", "sentiment": "none"}], "organizations": [{"name": "norton motorcycles", "sentiment": "negative"}, {"name": "leicestershire live stuart garner", "sentiment": "negative"}, {"name": "norton", "sentiment": "none"}, {"name": "bmi airlines", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Stuart Garner at Norton headquarters in Castle Donington (Image: Matt Short Photography) Get Business updates directly to your inbox Subscribe Thank you for subscribing! Could not subscribe, try again later Invalid Email\nFrom a modest country estate in the heart of rural north Leicestershire, hand-built Norton motorcycles are taking on the world.\nMachines bearing this iconic British marque are designed, engineered and built by a small, but skilled and dedicated team in an unlikely-looking self-contained 45,000 sq ft factory close to Donington Hall – in premises once occupied by BMI Airlines.\nWith 83 per cent of their components made in the UK, the machines go from here to markets around the globe – in fact only 20 per cent of production is sold in the UK.\nThe rest goes to the United States, Australia, Japan and markets across Europe and Asia.\nAnd it’s a business that’s growing.\nNorton motorcycles are in demand across the world. The factory is expanding with a new production facility and the company expects to recruit a 100 or so extra staff over the coming months.\nIn addition, a joint venture plan to build Nortons in Pune, India, for the Association of South Eastern Asian Nations (ASEAN) territories is well-advanced. Stuart Garner with his children, Sophie (19), Samantha (17) and Zac (10), and wife Susie Lodge (Image: Matt Short Photography)\nThe success of Norton is largely down to one man.\nDerbyshire-born former gamekeeper, share trader, firework seller and motorbike enthusiast Stuart Garner rescued Norton from near-collapse in 2008.\nHe bought the Norton brand from a US investment banker and set about designing a new prototype which went on sale the following year.\nIt was well-received, and with funding from Santander, a Government grant and money out of his own pocket, recruitment started and production began in earnest. Read More\nIn 2013, he bought the 26-acre Donington estate from BMI Airlines. Its proximity to Donington Park – the home of motorcycle racing – made it an attractive location.\nStuart moved into the Gothic, 1790-built hall while the factory was established next door.\nMajor component assemblies including engines and wheels are built in an upstairs factory, while the bikes are assembled in a downstairs assembly hall. The Duke of Cambridge sits aside a Norton TT racer with the motorbike brand's owner Stuart Garner (Image: PA)\nThe Commando 961 range is the backbone of the business, supported by the Dominator and Norton’s latest product, the new V4 launched in 2016.\nThe 200mph V4 marks a new phase for Norton. While previous Norton’s have had a traditional look to them, the 1,200cc V4 has a more 21st century appearance and is bristling with British technology.\nThe success of Norton means a new manufacturing facility adjoining the existing building is in the pipeline. Stuart said: “When we bought Donington we knew that we had room to grow.\n“Now we are building a new facility which will give us an extra 12,000 sq ft of manufacturing space, allowing for a new production line for new models, and increased volume.\n“I have to commend North West Leicestershire District Council who have been very supportive throughout, sharing our vision. Norton chief executive Stuart Garner said the Chinese engines will be different to the UK ones\n“Leicester and Leicestershire Enterprise Partnership has also been a good friend to us, providing seriously good help and making us very welcome.” The designers, engineers and production staff which Norton plans to recruit over coming months will be augmented by apprentices.\nThe company takes on anything between 12 and 40 apprentices a year. Skills are short in the manufacturing industry so Stuart likes to bring on his own staff, trained the Norton way.\nHe said: “An apprenticeship with Norton is very different to the one youngsters will get in other manufacturing environments, or even other motorcycle manufacturers.\n“Here the focus is on the traditional skills required to hand-build and spanner a motorbike.”\nAs well as expanding at Donington, Norton has entered into the joint venture to build Norton motorbikes in Pune, India.\nBikes built here will service the growing ASEAN markets, and building them in-territory allows Norton to avoid punitive tariffs.\n“There were scare stories about us shifting production abroad, but it’s not about that,” said Stuart. “It’s simply a commercial decision to allow us to grow our sales in ASEAN markets. Norton owner Stuart Garner on the set of the Bond film Spectre, which featured one of his bikes\n“There’s a benefit to our UK factory because we’ll be using assemblies built here, and of course, the profit stream will come back to the UK.”\nStuart’s view of the whole world being Norton’s marketplace means he has no fears for Brexit.\nIn fact, he sees it as a huge opportunity to negotiate trade deals around the globe.\nAnd following his participation in a trade mission to China with the Prime Minister and International Development Secretary Liam Fox, he believes the UK Government is better prepared for Brexit than the media would have us believe.\n“It’s what the country voted for so let’s get on with it.\n“I believe we will thrive outside the EU. There may be some short-term speed bumps but we’ll come out of it stronger.\n“We’re a strong-willed nation and will make it succeed. Read More Norton Motorcycles creating 100 new jobs\n“Most of our trade is outside of Europe in any case so I don’t see problems in negotiating trade deals, and I think there will be a few quick wins.\n“The major manufacturers are complaining about the potential difficulties and delays of parts criss-crossing European borders, but they already do that with countries outside of the EU.\n“It may mean a bit more cost on the end-product, but since most cars are leased or bought on finance, the difference will be very small.\n“And I don’t buy the media line that we are unprepared for Brexit. Read More These are all the people from Leicestershire who are richer than the Queen\n“I have seen at first hand the massive increase in staff in the International Trade department and our embassies around the world.\n“They are staffed and primed to build new markets for Britain. There is a huge amount of work going on to ensure that markets for our products will be there.\n“That, combined with the very significant investment in British technology and manufacturing from the Government through Innovate UK means we will have the products that the world wants.”\nSo the future looks rosy to Stuart Garner, and on a personal note, 2018 is a big year too.\nHe will be 50 in November, and is marrying fiancée Susie this summer. Norton chief executive Stuart Garner said the Chinese engines will be different to the UK ones and won’t bear the Norton name\nHe has three children – two girls and a boy – from his previous marriage and they have inherited his entrepreneurial spirit. They are often to be found on the shop floor at Norton, involved in everything from marketing to welding.\nOutside of Norton, he has a thriving hospitality business and, typically, has big plans for that too.\nIn 2016 he bought the Priest House Hotel, below, on the estate, situated in a beautiful spot on the edge of the River Trent. He has built it into a thriving wedding and corporate venue but has plans to expand the offering further, providing countryside breaks. Read More\nThe hotel is surrounded by 100 acres of woodland and he plans to build a log cabin complex in the woods for holidaymakers.\nFuture plans include a petting farm for children and a horse-riding facility.\nAnd with Stuart Garner’s dogged determination when it comes to business ventures, don’t be in any doubt that it will happen. Like us on Facebook ", "external_links": [], "published": "2018-09-04T03:00:00.000+03:00", "crawled": "2018-09-04T11:52:53.012+03:00", "highlightTitle": ""}