{"organizations": [], "uuid": "65d84d2aec873e3ec9fcaf55b21aea71ff5768c7", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14511738.ece/ALTERNATES/s1200/HKR_NEC_100418photos_13.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15135556", "country": "GB", "domain_rank": 21960, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-11T07:00:00.000+03:00", "replies_count": 0, "uuid": "65d84d2aec873e3ec9fcaf55b21aea71ff5768c7"}, "author": "Katie Collings", "url": "https://www.chroniclelive.co.uk/news/north-east-news/north-east-news-live-updates-15135556", "ord_in_thread": 0, "title": "North East news LIVE: Latest breaking news, sport, weather, traffic and travel", "locations": [], "entities": {"persons": [], "locations": [{"name": "harehills avenue", "sentiment": "none"}, {"name": "scafell drive", "sentiment": "none"}, {"name": "harehills", "sentiment": "none"}], "organizations": [{"name": "northumbria police", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Traffic is heavy on the A167 Newcastle Road southbound around A690 Neville’s Cross Bank. 07:25 Katie Collings Slow on the A1\nThere’s also slow traffic as usual on the A1 Western Bypass northbound around the A167 Angel Of The North coming from Chester-le-Street. 07:04 Delays on the Felling Bypass\nThere’s delays on the A184 westbound around Shields Road and Heworth Roundabout. 06:55\nWe’ll keep you updated: 06:40 Today's weather forecast\nThe Met Office says:\n“Rain in the morning will mainly affect the Pennines, where it may be heavy at times. This will move away south in the morning, leaving a dry day with sunny spells. It will remain breezy through the day. Maximum temperature 17 °C.” One man arrested after Cowgate stand off\nA man has been arrested on suspicion of aggravated burglary after an eight-hour stand off with police.\nMen were allegedly chased from inside a house on Cowgate’s Scafell Drive at approximately 2pm and into a property on nearby Harehills Avenue where at least one suspect barricaded themselves inside, police say.\nNorthumbria Police spokeswoman said:\n“At around 2pm today police received a report of a burglary.\n“The suspects fled the area.\n“Police were directed to a property in Harehills and a 24-year-old man has been arrested on suspicion of aggravated burglary.\n“He remains in police custody at this time.\n“Police would like apologise for any inconvenience caused while roads were closed while this incident was ongoing.”\nHere’s how it unfolded Loaded sawn-off shotgun found in the back of a taxi\nStashed in the back of a taxi, this is the loaded sawn-off shotgun found in the possession of two men minutes after a raid on an airport garage. (Image: CPS)\nWhen burglars struck at the Shell garage and stole valuables, police were alerted and pulled over a taxi carrying the culprits.\nOfficers were shocked to see the shotgun in pieces in the rear footwell, loaded with a cartridge.\nKarl Glendenning and Simon Boyle admitted possessing the firearm while Glendenning also admitted burgling the garage and a series of unrelated charges, including stealing a man’s car after kicking him out of it.\nNewcastle Crown Court heard it was around 1.30am on February 6 when Glendenning, Boyle and Stephen Palmer went to the filling station near Newcastle Airport, intending to steal cigarettes and alcohol.\nMichael Hodson, prosecuting, said:\n“The garage was open but the door was closed while the attendant took a break and was easily pulled open.\n“They went around picking up items. Nobody was present when they went in.\n“Alcohol, sandwiches and other items worth £168 were taken.”\nThe court heard it was Glendenning and Palmer who went into the Shell shop while Boyle stayed in the taxi. Boris Johnson's 'suicide vest' comments branded 'offensive'\nNorthumberland Conservative Anne-Marie Trevelyan has joined criticism of top Tory Boris Johnson, after he compared Theresa May’s Brexit plans to a suicide vest. (Image: PA)\nMrs Trevelyan, the MP for Berwick-upon-Tweed, said his language was “inappropriate” and “fairly unpleasant”.\nMr Johnson faced a backlash after his outspoken criticism of the Government’s proposals for a post-Brexit deal with the EU, known as the Chequers plan.\nThe Brexiteer politician, seen as a potential Conservative leadership candidate in any future contest, said the proposals were a “suicide vest wrapped around the British constitution”.\nForeign Office minister Sir Alan Duncan said the comments were “one of the most disgusting moments in modern British politics”.\nAnd Home Secretary Sajid Javid, also seen as a potential leadership candidate, said: “I think there are much better ways to articulate your differences.”\nSpeaking on BBC Two’s Politics Live show, Mrs Trevelyan said that Mr Johnson had chosen to make his comments in a “shocking” way.\nShe said: “I found it fairly unpleasant I have to say.”\nAnd she added: “I don’t think Boris’ language was appropriate. It was offensive.”\nMrs Trevelyan, also a firm supporter for Brexit, made it clear she had concerns about the Chequers plan, but said she believed differences would be resolved “at the last moment”.\nShe said: “As someone who used to negotiate buying and selling companies for a living, negotiations crystallise at the end point and that will no doubt happen.”\nThe MP said she wanted Theresa May to continue as Prime Minister until Brexit was completed.\n“I’m hoping we can keep the Prime Minister we’ve got for quite a lot longer.”\nShe added: “I want us to get through Brexit. I want her to lead the Conservative party to deliver Brexit .”\nAnd she opposed calls for a “people’s vote” or a second referendum on Brexit.\n“I’m not a fan of doing a referendum all over again.\n“The British people gave us a clear mandate. We’re getting on with it.” Good morning\nIt’s Katie Collings here and I’ll be keeping you updated on what’s going on across the North East including the latest on the roads for the rush-hour.\nIf you would like to get in touch with us today about any breaking news, here are my details: Phone: 0191 201 6144", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15135556;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-09-11T07:00:00.000+03:00", "crawled": "2018-09-11T07:34:08.000+03:00", "highlightTitle": ""}