{"organizations": [], "uuid": "9761329bc9d806723dcb2a85e631480eafd1ae6a", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14013754.ece/ALTERNATES/s1200/5_Lakes-Distillery-managing-director-Paul-Currie-holding-a-bottle-of-The-One.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15121708", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: The Lakes Distillery to float on London Stock Exchange", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-07T10:25:00.000+03:00", "replies_count": 0, "uuid": "9761329bc9d806723dcb2a85e631480eafd1ae6a"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15121708", "ord_in_thread": 0, "title": "Business Breakfast LIVE: The Lakes Distillery to float on London Stock Exchange", "locations": [], "entities": {"persons": [{"name": "mick", "sentiment": "none"}, {"name": "eve bowman", "sentiment": "none"}, {"name": "andrew", "sentiment": "none"}, {"name": "tynemouth", "sentiment": "none"}], "locations": [{"name": "tynemouth metro", "sentiment": "none"}], "organizations": [{"name": "london stock exchange tynemouth metro", "sentiment": "negative"}, {"name": "porters coffee shop", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Former Shields Therapeutics FD moves to Air Partners\nPrivate jet firm Air Partner has appointed former Shield Therapeutics FD Joanne Estell following a tumultuous few months.The company, which discovered a £3.3m accounting error earlier this year, has reshuffled its board room and appointed Ms Estell as chief finance officer.Her career spans 20 years with firms such as Smiths Group and Survitec.She was most recently finance chief at AIM-listed Shield Therapeutics.Air Partner boss Mark Briffa said:\nJoanne’s strong technical and controls skills, coupled with her plc and commercial experience, will be invaluable as we continue to pursue our clear long-term strategy to become a world-class aviation services group and capture the considerable opportunities to improve and grow multiple areas of our business. London Stock Exchange (Image: PA) 9:15 Jonathon Manning Post-Brexit 'hormone' beef imports could create public health risk, warns report\nAllowing hormone-treated US beef to be sold in Britain after Brexit would create “an unnecessary and unacceptable risk to public health”, a report has warned.Food safety standards should not be used as a “bargaining chip” as Britain strikes trade deals after we leave the European Union, the paper by the Food Research Collaboration says.In “Hormone-Treated Beef: Should Britain accept it after Brexit?”, Professors Erik Millstone and Tim Lang also called on farmers, supermarkets and butchers to make “explicit commitments to consumers never to produce or sell hormone-treated beef”.The report, published on Friday, warns that unlabelled hormone-boosted meat could enter the food chain while still illegal in the EU, risking a boycott of British exports.Countries including the US and Canada allow the use of hormones to boost muscle growth in cattle, but the meat from these animals is banned in the EU.Dr Lang, professor of food policy at City, University of London, said:\nThe UK Government should ensure either that food standards remain fully aligned with EU standards, or that we adopt higher standards.\nThere is a triple risk here: to health, to British beef farmers’ livelihoods, and to the UK’s ability to determine its own food safety standards.\nHormone use is a test case for whether the UK seeks a more sustainable food supply.\nHormone use would be a stupid step towards intensive beef feeding lots. Importing US beef could cause health risks, a report has warned (Image: Getty Images) 9:10 Jonathon Manning Ashmore to open Irish office as part of Brexit plans\nFund manager Ashmore is set to open an office in Ireland as part of Brexit contingency plans as it seeks to ensure access to EU clients following Britain’s divorce.The company said on Friday that there remains “substantial uncertainty” regarding the terms of the UK’s departure and the resultant implications for the financial services industry.\nAshmore said:\nIn order to ensure continued access to EU-based institutional clients, subject to regulatory approval Ashmore is in the process of establishing an office in Ireland.\nIt is thought a small number of staff will be located in Ireland although the company refused to say if any jobs would be lost or moved from its London base.City-based firms have been ramping up Brexit contingency planning and relocation plans to the EU over the past few months as the Government argues with itself over what kind of Brexit is desirable.The movement of thousands of high earners from the Square Mile is set to dent Treasury coffers.However, Ashmore insisted:\nNotwithstanding the uncertainty, the operational impact of Brexit is expected to be manageable and the financial impact immaterial.\nThe Irish announcement came alongside full-year results, which saw the emerging markets focused firm book a 7% fall in pre-tax profits to £191.3m.This was in spite of net revenue growth of 7% to £276.3 million from £257.6 million, as well as assets under management seeing a double-digit rise of 26% to £73.9 billion.Chief executive Mark Coombs said:\nThe combination of attractive emerging markets valuations with Ashmore’s strong investment track record and underweight investor allocations means that the outlook remains positive. The EU flag and a Union Jack (Image: PA) 9:05 Jonathon Manning Newcastle's Go-Ahead Group set to pay out 'millions' over rail chaos in South\nNewcastle transport group Go-Ahead has said it expects to pay out “millions” of pounds in compensation to passengers impacted by its disastrous train timetable change earlier this year.\nThe group, which also runs the Southern and Thameslink franchises among others, said it was contacting tens of thousands of customers affected by the bungled changes in May, which led to widespread cancellations and delays across Britain’s rail network.\nChief executive David Brown said the industry was left “mortified” by the disruption, but blamed a “systemic industry failure” for the chaotic timetable overhaul.\nThe group insisted it has been proactively contacting those affected on its Govia Thameslink Railway (GTR) services to offer compensation, with 30,000 customers contacted since the beginning of last week alone.\nIt expects to pay out “millions” of pounds in compensation.\nDespite the timetable woes, annual results revealed Go-Ahead notched up a 6.5% rise in pre-tax profits to £145.7m for the year to June 30, sending shares soaring 16% higher.\nBut it warned it may face a Government penalty - or even see franchises terminated - following the severe timetable disruption, which saw it breach some of its contractual targets. David Brown (Image: Mirror Screen Grab) 8:57 KEY EVENT Crane workers end battle over pay dispute\nCrane workers at the Liebherr Sunderland Works have ended a long running dispute over pay and accepted an offer put forward by the company’s management.\nWorkers at the factory have now accepted a 3.3% pay rise and secured an extra day’s holiday on Christmas Eve.\nThe deal will run from January 2018 to March 2019.\nUnite regional officer Mark Sanderson said :\nOur members voted overwhelmingly to accept the improved offer made yesterday by the management.\nAs a result, all strike action has been suspended and our members are working normally.\nI would like to thank our members for the strong solidarity that they have shown, which helped bring about a successful resolution to this dispute. More generally, I would like to thank the Sunderland public and the union movement for their heartfelt support.\nGoing forward, we hope to have a constructive dialogue with the management on future employment issues.\nUnion workers at the site went on strike after initially rejecting a deal that included a 3% pay rise, a £150 lump sum payment and the extra days holiday. 28 workers are set to strike at Liebherr Sunderland Works (Image: Simon Hobson) 8:52 Tynemouth Metro station cafe turns into craft beer house\nAs it’s Friday here’s a bit more booze related news...\nA coffee shop at Tynemouth Metro station is serving up a different type of brew after being converted into the village’s first craft ale house .\nMick and Eve Bowman have been serving hot drinks from Porters Coffee Shop for almost 25 years but have now transformed the premises into craft beer bar Platform 2.\nBeer aficionado Mick said:\nAfter 25 very happy years running Porters, the time had come for a change; retire as most people of our age would do, or set up something completely new?\nWe opted for the latter and with the support of our kids Andrew and Jade, have created Tynemouth’s first dedicated craft beer bar.\nI’m loving the craft beer movement; it’s great to see so many small, local producers creating amazing products and doing so well. We’ve got some small artisan producers on board and will be changing our offering on an on-going basis, giving people a chance to speak directly with those behind the drinks.\nPlatform 2 was opened after the family noticed the rise in popularity for craft beer. Although it is the first bar of its kind to open in Tynemouth. Eve, Andrew and Michael Bowman at Platform 2, Tynemouth's first craft beer bar (Image: Unknown) 8:45 Jonathon Manning Green King toasts England World Cup run\nGreene King saw sales boosted by warm weather and the World Cup over the summer, with England football fans sinking more than 3 million pints while watching Gareth Southgate’s men reach the semi-finals.The pubs chain pointed to “positive momentum” as it booked a 2.8% increase in like-for-like sales in the 18 weeks to September 2.Growth over the last 10 weeks stood at 3.2%.Greene King’s branded local pubs traded particularly well, with comparable sales up 5.5%, driven by fans boozing it up during England’s impressive World Cup run.A total of 3.7 million pints of beer were sold during the team’s seven matches in the tournament, and like-for-like sales on the day of the semi-final were up 61%.The firm said:\nThis strong performance was underpinned by the ongoing benefits from our sales driving investment to further improve our value, service and quality, and boosted by the weather and a successful World Cup.\nThe results will come as welcome relief for the pubs group, which recently posted a slump in profits amid “unprecedented” cost rises.It again blamed cost pressures for like-for-like sales falling 0.4% at Greene King’s pub partners unit.The firm said its “cost mitigation programme” is helping to offset cost inflation of £45 million to £50 million, adding that it is making good progress with a refinancing programme, which will reduce the cost of debt.Total beer volumes in Brewing & Brands were up 4% and own-brewed volumes were up 0.3%.Greene King remains on course to dispose of 100-110 pubs this year and will open around nine new outlets.\nThe firm added:\nWe continue to focus on profitably driving top-line growth, developing a more streamlined and efficient organisation and further strengthening our capital structure to deliver long-term value creation for our shareholders. Customers consumed 3.7m pints at Greene King pubs during England World Cup matches (Image: Trinity Mirror) 8:40", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15121708;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-09-07T10:25:00.000+03:00", "crawled": "2018-09-07T11:07:09.016+03:00", "highlightTitle": ""}