{"organizations": [], "uuid": "34fc7ac25990bf18944df7e028c8448e877ac49f", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1997750.ece/ALTERNATES/s1200/0_480.jpg", "site_section": "http://www.middevongazette.co.uk/editorschoices.rss", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/new-night-time-air-ambulance-1997809", "country": "GB", "title": "A new night-time air ambulance emergency landing site is to be created at Paignton", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-12T17:43:00.000+03:00", "replies_count": 0, "uuid": "34fc7ac25990bf18944df7e028c8448e877ac49f"}, "author": "Edward Oldfield", "url": "https://www.devonlive.com/news/devon-news/new-night-time-air-ambulance-1997809", "ord_in_thread": 0, "title": "A new night-time air ambulance emergency landing site is to be created at Paignton", "locations": [], "entities": {"persons": [], "locations": [{"name": "paignton click", "sentiment": "none"}, {"name": "paignton", "sentiment": "none"}, {"name": "foxhole community centre", "sentiment": "none"}, {"name": "devon air ambulance", "sentiment": "none"}, {"name": "pimm road", "sentiment": "none"}, {"name": "belfield road", "sentiment": "none"}], "organizations": [{"name": "devon air ambulance trust", "sentiment": "none"}, {"name": "kings ash academy", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nA new night-time emergency landing site for Devon Air Ambulance is to be created in Paignton as part of a county-wide network.\nTorbay planners approved the scheme and were told the local community has already raised half the £6,500 needed. The charity will come up with the rest to pay for a 10m (33ft) lighting column next to the playing field at Foxhole Community Centre in Paignton.\nTwo floodlights on the column will be switched on when the field is needed for the helicopter to touch down on an emergency call-out in the area.\nThe site is behind homes in Belfield Road on its south-eastern side and Pimm Road to the south-west, near Kings Ash Academy. Read More 250 cash machines a month are being shut down\nCouncillors heard the charity was keen on the site because it was close to the A380 with good access to Torbay Hospital.\nDevon Air Ambulance Trust is setting up a unique network of ‘community landing sites’ and the lighting means it can extend operations in the dark up to midnight.\nThe charity said in a statement: “The lighting will be used in emergencies and will be operational for the minimum time required to deliver this emergency service.”\nThe lights would be switched on and off by a phone call activated by the Helicopter Emergency Medical Services team.\nThe trust says the lighting would reduce the risks and time taken to land, and help paramedics assess and load a patient into the aircraft. Read More Hurricane Florence is changing our weather from the other side of the Atlantic\nBecause of an objection to the planning application, the issue was referred to councillors on Torbay’s development management committee to decide at its meeting on Monday, September 10.\nBut councillor Dave Thomas, leader of the Conservative group on the authority, said the local community backed the scheme, and had raised the money needed for it to go ahead.\nThe objection from Peter Sharp of Belfield Road said: “This appears to be in the centre of the playing field, and would prevent the playing of team games on the pitch.\n“Playing fields are becoming fewer every year, we should not allow this one to be transformed into an airport.”\nBut a report to the committee said the site for the hinged steel column was on the north-west side of the playing field, close to an embankment and a multi-use games area.\nThere is no suggestion that it would affect the use of the playing fields for sport.\nThe report says there would be some disturbance for neighbouring properties from noise and activity associated with an emergency helicopter landing.\nIt adds: “However, the landings would only occur during emergencies and such noise and disturbance is unlikely to be on a regular basis.\n“The applicant has confirmed that the air ambulance has landed on the playing field twice in the last 12 months.” Read More Wetherspoon pubs are banning Jagerbombs to support Brexit\nThe report says light would extend about 40m (130ft) from the column, which would be about 70m (230ft) from the rear gardens of homes in Belfield Road and 60m (200ft) from homes in Pimm Road.\nIt says it is “unlikely to result in any significantly harmful impacts upon neighbouring residential properties in terms of light pollution.”\nAnd it recommended a planning condition that the lighting should only be used by Devon Air Ambulance in emergencies, and only for the time needed to deliver the emergency service. Councillors voted unanimously in favour of the application, with the condition.\nThere were more than a dozen comments in support of the application, including one from Arthur Rogers of Foxhole Road, Paignton, who said: “A fantastic development that will provide a lifeline for those in need of immediate medical care.\n“The park is a perfect place for such matters, having the emergency light would allow our services to carry out the work much safer than before.”\nLee Glendinning of Pimm Road, Paignton, said he supported the plan for the helicopter to use the field behind his house. Read More Torquay United sack manager Gary Owers\nHe added: “I for one would hope that this life saving organisation gets the full support from the local community.”\nMaria Hinkley of Smallcombe Road, Paignton, said: “This is a life saving opportunity for anyone needing this emergency service.”\nDevon Air Ambulance says on its website: \"As the network of landing sites is steadily growing we are able to offer communities an extended service until midnight.\"\nThe charity operates two helicopters in Devon and last year assisted 990 patients, an average of around 19 a week, with crews in the air for an average of around two hours every day. Do you have a story to share or for us to investigate?\nGet in touch using or call 07741 295900 or tweet me @Ed_Oldfield\nWant more news?\nFor Devon news, find Devon Live's Facebook page here and Twitter here , or visit our homepage at www.devonlive.com Like us on Facebook ", "external_links": ["https://twitter.com/DevonLiveNews", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}", "https://twitter.com/Ed_Oldfield"], "published": "2018-09-12T17:43:00.000+03:00", "crawled": "2018-09-12T17:59:57.014+03:00", "highlightTitle": ""}