{"organizations": [], "uuid": "88552e984c041ff1bcf04945f74cf10bc19c9db1", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14368703.ece/ALTERNATES/s1200/1_Energy-suppliers-market-shares.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15117279", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Energy price cap to save 11 million households £1bn a year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-06T10:30:00.000+03:00", "replies_count": 0, "uuid": "88552e984c041ff1bcf04945f74cf10bc19c9db1"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15117279", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Energy price cap to save 11 million households £1bn a year", "locations": [], "entities": {"persons": [{"name": "jonathon manning bovis", "sentiment": "negative"}, {"name": "greg fitzgerald", "sentiment": "none"}], "locations": [], "organizations": [{"name": "bovis homes", "sentiment": "negative"}, {"name": "bovis", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Bovis on track for record profits\nBovis Homes has become the latest housebuilder to shrug off uncertainty in the property market by posting a hefty rise in half-year profit.The company booked a 41% rise in pre-tax profit to £60.2m in the six months to June 30, ahead of expectations.Revenue came in 1% higher at £432.2m and the firm now expects full year profit to come in at the top of expectations.The company said strong customer demand, attractive mortgage rates and Government initiatives, in particular Help to Buy, are helping drive sales.Boss Greg Fitzgerald said:\nWe delivered a strong performance in the half, with a more than 40% increase in profits.\nThis reflects the excellent progress made across all business areas over the past 18 months and a step change in the quality of the homes we are building and level of service we are providing our customers.\nWe are confident in the outlook for the business and are targeting a record year of profits in 2018, at the top end of the board’s expectations.\nBovis is the latest housebuilder to post a strong update, following recent figures from Barratt and Berkeley.The positive comments come despite reports surfacing over the weekend that Help to Buy will be scrapped in 2021, as well as warnings from rival firms over Brexit.Bovis, which had been dogged by complaints over unfinished homes with electrical and plumbing faults, also said it has seen a significant improvement in customer satisfaction.Nevertheless, it booked a £3.5m customer care provision in the period.Bovis completed 1,580 homes in the half-year, up just 4%, confirming a building slowdown as it focuses on quality.The average selling price on completion remained flat at £334,700. Bovis Homes development (Image: PA) 9:16 KEY EVENT Go-Ahead Group drives up profits to £145m\nNewcastle transport group Go-Ahead has seen its pre-tax profits jump 6.5% to £145.7m for the year ending June 30.\nTurnover at the group fell by 0.6% from £3.48m to £3.46m.\nThe group has suffered from major disruption to its services under its GTR brand, which runs Thameslink and Great Northern services. Chief Executive David Brown used its results to apologies for the issues.\nMr Brown said:\nIn Thameslink and Great Northern, collective industry failures over the timetable change resulted in a period of service performance which was severely below our expectations and those of our customers.\nWe are sorry for the significant disruption that the change caused to our passengers and are working very hard with the rest of the industry to improve the service.\nThe interim timetable that has been in place since mid-July is providing a much-improved train service in terms of both reliability and punctuality.\nMore services will be introduced over the coming months. David Brown (Image: Mirror Screen Grab) 9:11 Jonathon Manning Dixons Carphone annual profits to be in line with expectations\nDixons Carphone, which is still reeling from a massive customer data breach, has said full year profits are set to be in line with expectations at £300m as it posted first quarter results.The retailer saw group and UK revenues slide 2% but the World Cup supported TV sales, which made up for a weaker performance in white goods and computing.Comparable UK sales in the 13 weeks to July 28 came in flat and mobile like-for-like sales were down 1%.However, the Currys & PC World owner gave no update on its security breach, which saw 5.9 million bank card details and 10 million personal data records hacked last year.Shareholders are expected to grill the firm over the hack at Dixons Carphone’s AGM later on Thursday.Chief executive Alex Baldock said:\nFirst quarter performance was in line with expectations. We’ve maintained or grown our leading market positions, and our full year profit before tax guidance of around £300 million remains unchanged.\nWe’ve made good progress in setting a clear long-term direction for the business, one that sharpens our focus on the core, and that better joins up both our offer to customers and our business behind the scenes.\nI look forward to giving a fuller update on our plans and progress in December. Dixons Carphone Jonathon Manning Freeze business rates and protect bank branches to save high street, says FSB\nA freeze on business rates, more free parking in town centres, and safeguards around accessing bank services must be put in place to protect the high street , according to a leading business group.\nThe Federation of Small Businesses (FSB) has called on the Government to make radical changes to the way town centres are run and taxed to help combat the increased costs faced by high street shops.\nRising business rates, high rents, and competition from online and out-of-town shopping centres are all adding to the difficult market conditions faced by high street businesses.\nTo combat this the FSB is calling for five new policies to be adopted to help struggling firms, including a £1,000 business rates discount for local shops, cafes, restaurants, and pubs.\nThe FSB also argues that a new system needs to be introduced allowing firms to appeal rates and bank branches need to be safeguarded to help consumers access money.\nMike Cherry, national chairman at the Federation of Small Businesses (FSB), said:\nIt’s clear the pressure is mounting.\nSpiralling business rates and ever-increasing rents are piling on to small retailers, hospitality businesses and others on the high street. The high cost of town centre parking, poor infrastructure, the blight of potholes and the loss of vital banking services are also ramping up the pressure. Northumberland Street, Newcastle (Image: Newcastle Chronicle ) 8:55 Jonathon Manning 14 RBS branches set for closure are 'last bank in town'\nRBS has confirmed that around one in four of the 54 branches it is closing are the last bank in that town.\nThe lender said that the closure of 14 of its branches will leave locals with no access to another bank or building society in their area.\nMeanwhile, banks across the industry are closing branches at a rate of more than 60 per month, according to analysis by Which?.\nGareth Shaw, Which? money expert, said of RBS’s plans to close 54 branches in January 2019:\nThis is another blow to RBS customers who have already endured a spate of branch closures and will bring the total number of closures or planned closures across all banks to more than 700 this year.\nOur analysis has revealed that more than 60 branches a month are shutting their doors, potentially leaving customers struggling to access vital financial services.\nIt’s crucial that banks consult with their customers to ensure their needs are met before simply shutting their doors and their customers out. RBS (Image: Getty Images Europe) 8:50 KEY EVENT RBS to close Darlington branch - and 53 others across UK\nRoyal Bank of Scotland is to close its branch in Darlington as it swings the axe on another 54 branches, resulting in 258 job losses.\nThe lender, which is still 62% owned by the taxpayer, said the move was linked to it not having to sell its Williams & Glyn business.\nRBS said it has branches in close proximity to each other and is seeking to reduce overlap.\nIt comes on top of 162 branch closures announced earlier this year, which resulted in 792 job losses, though it said it would not now be closing more branches until at least 2020.\nAn RBS spokesman said:\nAs we are no longer launching Williams & Glyn as a challenger bank we now have two branch networks operating in close proximity to each other in England and Wales - NatWest and Royal Bank of Scotland.\nAs a result we have reviewed our overall branch footprint in England and Wales and have made the difficult decision to close 54 Royal Bank of Scotland branches. Customers of Royal Bank of Scotland in England and Wales will be able to use NatWest branches and local post offices for their everyday banking needs. Royal Bank of Scotland (Image: PA) 8:45", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15117279;"], "published": "2018-09-06T10:30:00.000+03:00", "crawled": "2018-09-06T11:36:18.009+03:00", "highlightTitle": ""}