{"organizations": [], "uuid": "79a38d8cbf545b1c8a7cc37af645f11349d68625", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14091218.ece/ALTERNATES/s1200/1_JS139720681.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15140655", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Wetherspoon to offer more UK and non-EU drinks to pubgoers", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-12T10:30:00.000+03:00", "replies_count": 0, "uuid": "79a38d8cbf545b1c8a7cc37af645f11349d68625"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15140655", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Wetherspoon to offer more UK and non-EU drinks to pubgoers", "locations": [], "entities": {"persons": [{"name": "wetherspoon", "sentiment": "negative"}, {"name": "peter truscott", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "linden homes", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Galliford Try sees profits soar\nGalliford Try has seen its pre-tax profits soar by a staggering 145% to £143.7m.\nThe huge profit increae came about despite the company being forced to accept an additional £45m cost after Carillion, one of its joint venture partners, went bust.\nRevenue also increase by 11% to £3.1bn.\nGalliford Try chief executive Peter Truscott said:\nWe have delivered a very strong underlying performance during the year, driven by excellent progress towards our strategic objectives across all three businesses.\nLinden Homes continued to prioritise margin growth, benefiting from further standardisation and the robust control of overheads.\nThis resulted in increased profitability in a year with modest house price inflation.\nVolumes also grew reflecting the strength of our product offering, and with the sector supported by Help to Buy, good mortgage availability and the cut in stamp duty for first-time buyers.\nThe land market continues to be favourable, allowing us to buy land at robust margins, in the right locations for our new standardised product. Galliford Try KEY EVENT Judge upholds criticism of Mike Ashley's Sports Direct\nNewcastle United owner and Sports Direct boss Mike Ashley has been dealt a blow by a High Court judge .\nMr Justice Arnold says Sports Direct managers were justifiably criticised by lawyers representing a financial watchdog which wanted documents staff thought would help in an investigation.\nLawyers representing the Financial Reporting Council had “characterised” Sports Direct’s approach as “one of obfuscation and delay verging on obstruction”, and Mr Justice Arnold says that criticism is “entirely justified”.\nThe judge has now ordered Sports Direct to produce a number of documents wanted by the Financial Reporting Council.\nHe said the Financial Reporting Council was investigating “the conduct” of auditing firm Grant Thornton in relation to the audit of 2016 Sports Direct financial statements.\nLawyers representing the Financial Reporting Council had complained that Sport Direct had wrongly “failed to comply” when required to provide documents.\nThey had asked Mr Justice Arnold to make an order “compelling compliance”.\nLawyers representing Sports Direct disputed that bosses had wrongly “failed to comply”.\nMr Justice Arnold had analysed arguments at a High Court hearing in London in July.\nHe published a ruling on the case, in which he said the criticism of Sports Direct was justified, on Tuesday. Mike Ashley inside Sports Direct warehouse, Shirebrook, Mansfield (Image: Daily Mirror) 9:00 Jonathon Manning SSE blames weather and gas prices for halving six-month profits\nEnergy giant SSE has warned half-year profits will tumble 50% after suffering the effects of higher gas prices and dry, still and warm weather.The company said adjusted operating profit for the first five months of the financial year was knocked by about £190m, most of which was due to higher than expected gas and commodity prices.It was also impacted by dry, still and warm weather over the period.\nIn a trading statement the company said:\nThe net result is that SSE currently expects its adjusted operating profit for the six months to September 30 2018 will be around half of that delivered in the same period in 2017.\nSSE said its wholesale division is expected to show a “significant” drop in adjusted operating profit from energy generation and an adjusted operating loss of around £100m in its energy portfolio management unit.While gas production is set to deliver a rise in profit, it will not be enough to offset a loss across the entirety of its wholesale business.Its retail division is expected to break even for the half year while the networks unit is on course to deliver a mid-single digit rise in adjusted operating profit - in line with SSE’s plan.Chief executive Alistair Phillips-Davies said:\nLower than expected output of renewable energy and higher than expected gas prices mean that SSE’s financial performance in the first five months has been disappointing and regrettable.\nThe news sent SSE to the bottom of the FTSE 100 in morning trading, with shares down more than 8.2%.It also dragged on National Grid and Centrica shares, which fell 3.2% and 2%, respectively.The SSE boss said that the company was still on a sure footing.\nHe added:\nThe underlying quality of SSE’s businesses remains strong, with regulated networks and renewables providing the core of what will be an infrastructure-focused SSE group in the years ahead.\nThis year’s £1.7bn programme of capital investment, mainly in regulated networks and renewables, has continued to go well in recent months. SSE (Image: Andrew Milligan/PA Wire) 8:55 KEY EVENT 'Disaster' warning for North East car industry if Brexit goes wrong\nA North East MP has warned of “disaster” for the region’s automotive industry after the boss of Jaguar Land Rover warned Theresa May that a hard Brexit would wipe out his company’s profits and cost tens of thousands of jobs.\nAddressing a vehicle summit in Birmingham directly ahead of the Prime Minister, Prof Dr Ralf Speth described the prospect of a cliff-edge break with the EU as “horrifying”.\nHe said that if the “wrong decisions” were taken in the negotiations with Brussels, it could result in the “worst of times” for the UK while the cost to Jaguar Land Rover would be more than £1.2bn a year.\nHis stark intervention follows similar warnings from other industry bosses - including Sunderland’s Nissan - about the potentially damaging consequences of Britain’s decision to leave the EU.\nDr Speth told delegates:\nIf we make the right decisions this could be the best of times. If we make the wrong ones, they could be the worst of times.\nWe are absolutely firmly committed to the UK, it’s our home. But a hard Brexit will cost Jaguar Land Rover more than £1.2bn a year - it’s horrifying, wiping our profit, destroying investment in the autonomous, zero-emissions, we want to share.\nHe added that the loss of jobs would be “counted into tens of thousands if we do not get the right Brexit deal”.\nHis warning came as Mrs May pledged a £106m funding boost for research and development in zero-emissions vehicles.\nThe Prime Minister said it was her ambition to make Britain a leader in the green technology field, while making traffic pollution “a thing of the past”.\nBut her speech was overshadowed by Prof Speth’s intervention, which was seized upon by opponents of Brexit. Dr Ralf Speth Chief Executive Officer of Jaguar Land Rover (Image: Birmingham Mail) 8:50 Jonathon Manning Barclays allows customers to view other bank accounts through its app\nBarclays is to allow its customers to view their bank accounts held with other providers on its mobile banking app for the first time.\nThe move will allow customers to view personal or business current accounts held with Lloyds, Halifax, Bank of Scotland, RBS, NatWest, Nationwide or Santander “quickly and securely”.\nThe new feature will be free and rolled out to customers over the coming weeks. More banks will be added at a later date.\nThe move follows the launch of an initiative across the industry called “open banking” - which uses developments in technology to make it easier for people to see all their finances in one place and make the most of the best deals. Barclays said the feature uses industry-approved open banking technology to ensure that customers’ accounts are linked into the app securely - without them needing to supply their other banks’ usernames or passwords.\nCatherine McGrath, managing director of retail banking at Barclays, said:\nToday, lots of people have current accounts with more than one bank, so keeping track of your finances can be tricky as well as time-consuming.\nOur new feature is designed to solve this problem, offering a simple and secure way to get a clearer picture of your finances, all in the place six million of our customers already go to do their banking. Barclays sign (Image: PA)", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15140655;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-09-12T10:30:00.000+03:00", "crawled": "2018-09-12T11:32:10.003+03:00", "highlightTitle": ""}