{"organizations": [], "uuid": "28c1e008d027377af2c1b45d42b11ca989e5f797", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14919747.ece/ALTERNATES/s1200/3_JS143562321.jpg", "site_section": "http://www.thejournal.co.uk/business/?service=rss", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15191808", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast RECAP: Barclays expands EU operations ahead of Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-24T10:00:00.000+03:00", "replies_count": 0, "uuid": "28c1e008d027377af2c1b45d42b11ca989e5f797"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15191808", "ord_in_thread": 0, "title": "Business Breakfast RECAP: Barclays expands EU operations ahead of Brexit", "locations": [], "entities": {"persons": [{"name": "mark bristow", "sentiment": "none"}], "locations": [{"name": "canada", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "barclays", "sentiment": "negative"}, {"name": "barrick", "sentiment": "negative"}, {"name": "randgold resources", "sentiment": "negative"}, {"name": "brexit jonathon manning randgold", "sentiment": "negative"}, {"name": "new barrick group", "sentiment": "none"}, {"name": "randgold", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Randgold resources and Barrick in £14bn mining merger\nRandgold Resources and Canada’s Barrick have agreed to merge in a deal that will create an $18.3bn (£14bn) gold mining giant.According to the terms of the all-share deal, Barrick shareholders will own around 66.6% of the new combined firm, while Randgold shareholders will hold the remaining 33.4%.The tie-up will create a mining titan that owns five of the world’s top-ten tier one gold assets.Randgold boss Mark Bristow, who will lead the New Barrick Group, said:\nOur industry has been criticised for its short-term focus, undisciplined growth and poor returns on invested capital.\nThe merged company will be very different.\nIts goal will be to deliver sector-leading returns, and in order to achieve this, we will need to take a very critical view of our asset base and how we run our business, and be prepared to make tough decisions.\nBy employing a strategy similar to the one that proved very successful at Randgold, but on a larger scale, the New Barrick Group will leverage some of the world’s best mines and talent to create real value for all stakeholders. Gold Bullion (Image: Royal Mint/PA Wire) 9:00 Jonathon Manning Ebay partners with Wolverhampton to help local retailers\nOnline retail giant eBay is partnering with the city of Wolverhampton to support local businesses and help boost the economy.\nThe aim is the scheme to show that online and high street retailers can co-exist.\nThe partnership follows research for eBay which found that one in four small retailers do not have an online presence.\nRob Hattrell, vice president of eBay in the UK said:\nWe know that customer shopping behaviour is changing, but online should play an important part in helping businesses in our local communities to thrive.\nI’ve seen that Wolverhampton businesses have the creativity matched with the entrepreneurial skill to create products needed and wanted all over the world - and eBay will help them to sell in the way they want to online.\nCity of Wolverhampton Council leader Roger Lawrence said:\nI’m delighted a global brand like eBay has chosen to work with us on an initiative which is the first of its kind in the UK.\nWe value our small retailers and look forward to providing support to them in the wake of a challenging national retail climate affected by changes in consumer behaviour and the economy.\nIt is an exciting programme that will help businesses with their digital marketing and sales skills, giving them a solid platform for sustainable growth. eBay (Image: PA) Jonathon Manning Thomas Cook issues profit warning as it feels the heat\nHoliday giant Thomas Cook has warned over profits after sales were hit by the European heatwave and a fall in demand for last-minute trips abroad.The firm said that the “unprecedented” prolonged period of hot weather across the continent meant more people spent June and July enjoying the sunshine at home and put off booking holidays abroad.A slowdown in customer bookings during June and July extended into August, leading to higher-than-normal levels of promotional activity, which exacerbated pressure on profit margins.As a result, Thomas Cook now expects to deliver full-year underlying operating profit of about £280m, down from previous estimates of £323m.Shares plunged by nearly 25% at the market open to 57.9p as investors digested the news.Thomas Cook makes all of its annual profits in the summer months and also warned that the impact of the heatwave “is continuing to be felt into winter trading”.Boss Peter Fankhauser said:\nSummer 2018 has seen a return to popularity of destinations such as Turkey and Tunisia.\nHowever, it has also been marked by a prolonged period of hot weather across Europe.\nThis meant many customers spent June and July enjoying the sunshine at home and put off booking their holidays abroad, leading to even tougher competition and higher than usual levels of discounting in the ‘lates’ market of August and September.\nOur recent trading performance is clearly disappointing.\nSoaring temperatures seen across the UK, Ireland and Europe over the summer have caused a headache for travel firms and airlines, with low-cost airline easyJet also warning in July that late bookings might be impacted.Bookings for summer 2018 are 12% higher, driven by the return in popularity of holidays to Turkey, Egypt, Tunisia and Greece.However, average selling prices are 5% lower.Northern Europe bookings are up 4% in the summer, but Thomas Cook said this has come at the expense of price, with average selling prices now up 2%, a fall of two percentage points since the last update.A similar pattern has been seen in Continental Europe, with bookings up in recent weeks driven by lower pricing.Average selling prices are up 2%, a fall of 1% since the firm’s last update.However, Thomas Cook said that despite recent challenges, “we continue to make good strategic progress which positions us well to return to profitable growth”. Thomas Cook Airlines plane (Image: Publicity Picture) 8:45 KEY EVENT Big screen plans for new Flannels store on Newcastle's Northumberland Street\nBillionaire entrepreneur Mike Ashley wants to make sure everyone knows about his new retail enterprise on Newcastle’s busiest shopping street - with a 21-foot high digital display screen dominating the building.\nSports Direct, the company led by Newcastle United owner Mr Ashley, snapped up the Northumberland Street building earlier this year for £31.6m, the region’s biggest retail property deal this year.\nHaving acquired it from Aberdeen Standard Investments – owners of the Monument Mall and the adjoining building where Sports Direct’s Newcastle store is based – the firm is now setting about creating a new Flannels shop in the building.\nThe luxury fashion store is set to open next year, but ahead of its opening the firm has put in a bid to install a 21ft high and 25ft wide LED digital screen at the first floor level.\nThe firm wants permission to fix the screen in place from this November until November 2023, with documents supporting the application suggesting the screen will display images inside the subterranean store, which was home to Clas Ohlson until over a year ago.\nThe 90,000sqft building at 36-40 Northumberland Street is already home to H&M and WHSmith, which also houses a Royal Mail Post Office – but the whole of the basement has lain empty since the departure of the Swedish retailer.\nWhite Box Interiors is currently on site carrying out a fit out of the shop which started in July and the work, which includes replacing the escalators, is due to take around 10 weeks. How the digital screen above Flannels in Newcastle would look (Image: newcastle city council planning site - Sports Direct) 8:37 Jonathon Manning Leading Polish bank opens first overseas office in London\nOne of Poland’s largest banks has launched its first overseas office in London, with executives calling it a vote of confidence in the UK capital despite Brexit.\nBank Pekao has opened will serve corporate and investment banking customers from its new branch in Mayfair, which has opened today.\nThe company will not launch a retail banking arm in the UK, and has halted its plans for a digital offering,\nBank Pekao said it hoped to be a “partner of choice” for Polish companies with international ambitions, as well as London-based private equity firms wishing to move into Poland.\nThe London office launch is a feather in the cap of chief executive Michal Krupinski - the former head of investment banking for Central and Eastern Europe at Bank of America Merrill Lynch - who took the reins at Bank Pekao in June 2017.Mr Krupinski said the London expansion signalled confidence in UK-Polish relations and the strength of London as a financial centre despite Britain’s exit from the EU.\nHe said:\nIt is imperative for a bank with a strong international DNA like ours to remain close to our clients and investors.\nRegardless of the outcome of the ongoing Brexit negotiations, Britain will remain an important partner for Poland and Polish companies.\nThe economic exchange between the two countries is supported by the international ambitions of Polish corporates, the entrepreneurial spirit of Poles living in the UK, and British investors’ growing interest in Poland.\nOur new representative office in London will help foster cooperation between the two markets. The Union Jack behind the EU flag hanging outside Europe House in Smith Square, London (Image: Yui Mok/PA Wire) 8:30 Jonathon Manning North East women launch network to bring together business and charities\nTwo North East businesswomen have launched a networking group that aims to bring together charities and the private sector.\nInspire Good is designed to provide a support network that will connect businesses and charities, so that they can work together and learn from each other.\nThe initiative is led by Jennifer Clair Robson and Clare Aitken, who are both committed to supporting charities in their professional careers.\nClare successfully builds corporate partnerships that benefit local charities through her business Chiara Consultancy and Jennifer, who is a PR consultant, has more than 10 years specialising in environmental and climate change communications.\nJennifer said:\nThere is a long tradition of companies donating money and time to charities because they want to give something back and ‘do good’. Now there is a growing recognition that companies have a much more powerful role to play and have more to offer than just financial support.\nThrough Inspire Good we will connect businesses and charities for supportive purposes and explore ways to learn and share knowledge for the greater good.\nEach bi-monthly meeting will highlight a local charity and will include a training session, delivered by a local business, along with networking opportunities.\nThe first official event will take place on September 27 at the Nat West Entrepreneur Accelerator Hub in Newcastle. Jennifer Clair Robson and Clare Aitken of Inspire Good (Image: Copyright unknown) 8:25 Jonathon Manning Lloyds cuts nearly 4,000 jobs since being privatised\nLloyds Banking Groups has announced nearly 4,000 job cuts in the 18 months since the Government sold off its stake in the lender.\nSince the lender was taken fully private the bank’s efficiency and modernisation drive has continued, with the bank saying a business overhaul and reduction of its branch network is essential to stay relevant during the digital shift.\nPart of the plans involved around 3,899 job losses, according to numbers compiled by the Press Association.\nThe bank is also set to create new roles, but not all staff affected by the cuts have the skills to fill these roles.\nThe privatisation came nine years after the Government spent £20.3 billion of taxpayers’ cash to bail it out at the height of the financial crisis.\nAt its peak, Lloyds was 43% owned by the state. People walk past a branch of Lloyds Bank (Image: Getty Images Europe) 8:20 KEY EVENT Mike Ashley blames 'greedy' landlords for House of Fraser closures but North East branches are saved\nMike Ashley has blamed ‘greedy landlords’ for the closing of House of Fraser stores - although branches in the North East look set to be saved.\nThe Newcastle United owner announced 15 previously under threat House of Fraser branches will remain open, including those in Darlington, Middlesbrough and Carlisle. The MetroCentre department store is also earmarked to remain in business.\nHowever, branches in Edinburgh, Hull and Swindon are due to shut.\nSports Direct chief and Newcastle United owner Mr Ashley blames ‘greedy landlords’ for the store closures, BBC reports.\nMr Ashley - who took over House of Fraser in August - said:\nI am disappointed that in my opinion a small number of greedy landlords still refuse to be reasonable.\nWe’ve showed what we can achieve on the British high street when we work together with landlords.\nI would like to thank those landlords who have helped us to rescue approximately 3,500 jobs at the stores we have saved to date.\nI am calling on everybody to pull together, including landlords and local authorities in order to help to save as many House of Fraser stores and jobs as possible on the great British high street. Mike Ashley (Image: DAILY RECORD) 8:15", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/", "https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15191808;"], "published": "2018-09-24T10:00:00.000+03:00", "crawled": "2018-09-24T17:30:43.000+03:00", "highlightTitle": ""}