{"organizations": [], "uuid": "0bf817d1e65e4750f1e8010b9bc6c80277abd988", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14940626.ece/ALTERNATES/s1200/0_BESTPIX-British-Prime-Minister-Theresa-May-Visits-Northern-Ireland.jpg", "site_section": "https://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-brexit-plans-suffer-15179515", "country": "GB", "domain_rank": 21960, "title": "Theresa May's Brexit plans suffer setbacks after EU leaders say they 'will not work'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-20T18:00:00.000+03:00", "replies_count": 0, "uuid": "0bf817d1e65e4750f1e8010b9bc6c80277abd988"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/theresa-mays-brexit-plans-suffer-15179515", "ord_in_thread": 0, "title": "Theresa May's Brexit plans suffer setbacks after EU leaders say they 'will not work'", "locations": [], "entities": {"persons": [{"name": "theresa may", "sentiment": "negative"}, {"name": "donald tusk", "sentiment": "none"}], "locations": [{"name": "austria", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "salzburg", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "negative"}, {"name": "european union", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "european council", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Theresa May's Brexit plans suffer setbacks after EU leaders say they 'will not work' The Prime Minister's Brexit proposals are in tatters after her 'Chequers' deal was rejected by the EU Share Prime Minister Theresa May (Image: Getty Images Europe) Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nTheresa May’s Brexit plans suffered a massive setback after they were rejected by European Union leaders.\nEuropean Council President Donald Tusk said bluntly that the Prime Minister’s so-called Chequers Plan “will not work”.\nBut Mrs May stuck to her guns and insisted her proposal was the only offer on the table.\nProgress on Brexit talks ground to a halt at an informal summit at Salzburg, Austria.\nAnd EU leaders even attempted to put pressure on the Prime Minister to hold a second referendum on Brexit - an option she firmly ruled out, in comments to journalists. Prime Minister Theresa May speaks to the media at the conclusion of the summit of leaders of the European Union on September 20, 2018 in Salzburg, Austria (Image: Getty Images Europe)\nThe UK’s proposals involve leaving the EU’s single market and creating a free trade zone for goods, but not for services. However, EU leaders argue this would undermine the single market.\nMrs May is also resisting demands for a guarantee that Northern Ireland will continue to have close economic ties with the EU. The aim is to avoid border controls between Ireland and Northern Ireland, but the proposals could potentially lead to a border between Northern Ireland and the rest of the UK.\nMr Tusk said leaders of the remaining 27 EU states agreed Theresa May’s Chequers blueprint for Brexit will not work in its present form.\n“Everybody shared the view that while there are positive elements in the Chequers proposal, the suggested framework for economic co-operation will not work, not least because it is undermining the single market,” he said. European Council President Donald Tusk (Image: Getty Images Europe) Read More Vince Cable tells Lib Dems to welcome defectors from Labour or the Tories\nMr Tusk said they would decide in October whether there had been sufficient progress in the Brexit talks to call a special summit in November to finalise a deal.\nThe comments may weaken Mrs May’s position at home, as Conservative MPs will find it harder to defend the Chequers plan if it appears unlikely to be accepted by the EU.\nBut she told journalists that it remained the “only proposal on the table”.\nShe said: “I’m negotiating and I’m negotiating hard in the interest of the British people, and negotiating to deliver on what the British people voted for in the referendum. The EU and Union flags (Image: PA)\n“I am also clear that if we’re going to deal with the commitments we’ve made in relation to Northern Ireland, we do need to ensure that there is no hard border between Northern Ireland and Ireland.\n“We need to do that in a way that maintains the integrity of the United Kingdom, to do that we need to have the frictionless movement of goods across the border, the only proposal on the table at the moment that will deliver on that frictionless movement of goods across the table is the proposal that we have put forward in the white paper.”\nGerman Chancellor Angela Merkel suggested there was no room for compromise over Chequers, saying the EU27 were “united that, in the matter of the single market, there can be no compromises.” German Chancellor Angela Merkel (Image: Getty Images Europe)\nSpeaking to the BBC , Maltese Prime Minister Joseph Musact revealed there was “almost unanimous” support among EU leaders for Britain to hold a second referendum on membership of the union. Similar comments were made by the Czech Prime Minister Andrej Babis.\nNewcastle North MP Catherine McKinnell said: “From British trade unionists to European leaders via ministers in the Treasury, everyone can see that the alternative to what is now certain to be a bad Brexit deal is a People’s Vote. Read More Vince Cable tells Lib Dems to welcome defectors from Labour or the Tories\n“Theresa May might hope that a blindfold Brexit where all the big questions are ignored might get her over the line, but across Europe more and more leaders can see it is no more in their interest than it is for the British people, who will be asked to shoulder all the risk of leaving the EU with no deal in place.\n“Salzburg has not taken us any nearer to a good deal, because it is clear no Brexit deal can ever match the promises made to the British people back in 2016. That is why the momentum behind the demand for a People’s Vote on any Brexit deal is growing every day.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-20T18:00:00.000+03:00", "crawled": "2018-09-20T18:29:10.005+03:00", "highlightTitle": ""}