{"organizations": [], "uuid": "b4ec73a39fd64a2078604e8255df0a30a1bc6db8", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15109840.ece/ALTERNATES/s1200/2_John-Lewis-Partnership.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15145297", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: John Lewis' profits crash 99% as retailer blames 'challenging times'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-13T10:30:00.000+03:00", "replies_count": 0, "uuid": "b4ec73a39fd64a2078604e8255df0a30a1bc6db8"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15145297", "ord_in_thread": 0, "title": "Business Breakfast LIVE: John Lewis' profits crash 99% as retailer blames 'challenging times'", "locations": [], "entities": {"persons": [{"name": "john lewis", "sentiment": "negative"}, {"name": "laura mason", "sentiment": "none"}, {"name": "simon bentley", "sentiment": "none"}, {"name": "house of fraser", "sentiment": "none"}], "locations": [{"name": "uk", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "jonathon manning legal & general", "sentiment": "negative"}, {"name": "british airways legal &", "sentiment": "negative"}, {"name": "legal & general", "sentiment": "none"}, {"name": "debenhams", "sentiment": "none"}, {"name": "british airways", "sentiment": "none"}, {"name": "house of fraser", "sentiment": "none"}, {"name": "debenhams sports direct", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Legal & General takes on £4.4bn of pension liabilities from British Airways\nLegal & General has secured the largest ever bulk annuity deal, taking on £4.4bn of pension liabilities from airline British Airways.\nThe deal covers nearly 22,000 pensioners.\nLaura Mason, chief executive of Legal & General’s retirement institutional division, said:\nWe are proud to have delivered this ground-breaking transaction, the largest bulk annuity transaction completed in the UK market.\nThis is a great example of Legal & General delivering for UK companies and their pension members, enabling pension schemes to provide security to their pensioners in retirement. British Airways planes (Image: Getty Images Europe) 9:15 KEY EVENT Sports Direct denies claims it is considering merging House of Fraser with Debenhams\nSports Direct has denied claims that it is looking to acquire Debenhams after one of the firm’s senior directors said the company had discussed merging the retailer with House of Fraser.\nOutgoing senior non-executive director Simon Bentley said at the Sports Direct general meeting that a combination had “ been discussed”.\nSports Direct recently acquired House of Fraser out of administration for £90m and already owns just under 30% of rival department store chain Debenhams.\nIf its stake in Debenhams was increased Sports Direct would be required to launch an official takeover bid.\nHowever, in a statement to the London Stock Exchange, Sports Direct said:\nFurther to recent press speculation in relation to Debenhams plc, Sports Direct confirms that it does not intend to make an offer to acquire the entire issued and to be issued ordinary share capital of Debenhams plc.\nHowever, the statement continued that Sports Direct “reserves the right to acquire Debenhams shares”, but had no intention to do so at the present time. Debenhams in Newcastle (Image: Newcastle Chronicle) 9:07 KEY EVENT Newcastle estate agent Sanderson Young is up for sale - but boss says he'll still be in charge\nHigh end estate agent Sanderson Young has been put up for sale as it continues negotiations over an unpaid tax bill.\nThe Newcastle firm , which has offices in Ponteland, Alnwick and London’s Mayfair, is being advertised for sale online, though founder and owner Duncan Young is hoping to still run the firm.\nThe Journal reported in August that Sanderson Young had been issued with a winding-up notice by HMRC after an “admin error” meant it didn’t pay a £175,000 tax bill.\nMr Young is due in court next week over what he described as an “ongoing matter with HMRC” and his business is being marketed as part of that process.\nHe said that he had been approached with offers to buy the company but was not intending to sell.\nHe said:\nIt is my full intention to keep trading and negotiations are ongoing.\nThere are a lot of rumours going around and none of it is factually correct. I am 99% certain that the company will be back on track with me leading it.\nAn advert on business-sale.com is marketing Sanderson Young to potential buyers, listing its fixed assets at at £555,449.\nThe Journal has also seen an online advert from a North East restructuring firm for what it describes as a “local brand name estate agency” with “multiple offices across the North East of England”.\nRival estate agency Bradley Hall has been linked as one of the companies interested in acquiring Sanderson Young. A Sanderson Young Estate Agent sign 9:02 Young women facing gender pay gap and harassment issues at work, report claims\nOne in five women are illegally paid less than heir male colleagues for the same work, according to a new study.\nResearch by the Young Women’s trust found that a third of women do not know how to report sexually harassment in the workplace.\nA survey of 4,000 young people aged 18 to 30 for the charity showed that one in four women would be reluctant to report sexual harassment for fear of losing their job.\nYoung women remain more likely to be on low pay, job insecurity has increased, and debt levels have risen, said the report. More than a quarter said their financial situation has got worse in the past year.\nYoung Women’s Trust chief executive Dr Carole Easton said:\nSadly, even 100 years after the first women gaining the power to vote, it’s still a rich man’s world.\nYoung women continue to lack workplace power and spending power.\nOur annual survey shows that young women’s treatment at work, pay and wellbeing are trailing far behind those of young men.\nIf 2018 is to be a turning point for women’s equality and not just a footnote in history, then it’s clear that we need deeds, not just words.\nA concerted effort is needed from government and employers to provide young people with security and hope for the future, redress gender inequality at work and help manage the growing mental health crisis among young people. One in five women are illegally paid less than men at their work, a report claims (Image: Mirrorpix) 8:57 Pumphrey's Bar to get upgrade under plans to transform Newcastle's Bigg Market\nA historic bar in the heart of Newcastle’s Bigg Market will be restored to its former glory after tapping into cash from the Heritage Lottery Fund (HLF).\nPumphrey’s Bar and Cellar will be given a major facelift after becoming the first business to access money through HLF’s regeneration grant.\nThe grant comes as part of an ongoing £3.2m regeneration programme that aims to breathe new life into the Bigg Market after years of neglect.\nAs part of the scheme, Business Improvement District NE1 received £1.6m from the HFL to work with businesses in the area.\nPumphrey’s, which occupies a Grade II listed building, is owned by local property company The Malhotra Group. The firm has been a supporter of the regeneration plans since they were released three years ago.\nAtul Malhotra, operations director at The Malhotra Group, said: “We have just very recently signed the relevant contracts and the work will begin in the next month.\n“The total anticipated cost of the project will be £100,000 and will involve new signage, cleaning up of the exterior of the building, the installation of new window frames and just generally restoring the building to its former glory.\n“Pumphrey’s started life as a coffee shop and was one of the first premises in the area to be granted a licence to sell alcohol. It is part of a very historic street which I believe is really set to benefit from this investment.”\nNewcastle ’s Bigg Market is well known as a popular drinking area within the city but its history dates back to the Middle Ages when it was a thriving market place.\nUnder the current regeneration plans, NE1 hopes to transform the space into a high quality public area suitable for pavement cafes, al fresco dining and market stalls. NE1 Bigg Market Project Manager Alex Slack with Atul Malhotra whose Malhotra Group company has been given a grant to restore the Cloth Market buildings, which is home to the famous Pumphrey's Bar (Image: Tel: +44 191 265 7624) 8:52 Morrisons shareholders pocket £91m after sales growth hits nine-year high\nMorrisons is shelling out extra cash to shareholders after sales growth hit a nine-year high in the second quarter.The grocery group announced plans to pay out £91m to investors after raising its total interim dividend 2p, or 132%, to 3.85p.That is despite having logged a 29% fall in pre-tax profits to £142m for the six months to August 5, down from £200m during the same period last year.But that drop was due primarily to a £51m net adjustment, including a previously announced bond tender offer, the company said.It also accounts for the way it now estimates stock provisions.Underlying pre-tax profits for the period were up 9% at £193m.Morrisons cheered progress in like-for-like sales - excluding fuel and VAT - which grew 4.9% compared to a year earlier.Those figures were up 6.3% in the second quarter alone, marking a nine-year high, while total revenues for the half year were up 4.5% at £8.8bn.Chief executive David Potts said:\nStrong growth, including our best quarterly like-for-like sales in nearly a decade, together with another special dividend for our shareholders shows how new Morrisons can keep improving for all stakeholders.\nMorrisons continues to become broader, stronger and a more popular and accessible brand, and I am confident that our exceptional team of food makers and shopkeepers can keep driving the turnaround at pace.\nThe company made moves to expand its online grocery services to a larger area in the South and into Scotland for the first time during the first half of the year, making its service available to over 75% of British households.The grocer also highlighted international positioning, having agreed new wholesale supply deals with the likes of MPK Garages forecourt stores and Big C in Thailand.Back home, the company’s wholesale deal to supply 1,300 McColl’s stores progressed “more quickly than initially expected”.Morrisons said:\nAs a result, we now expect to achieve our target of £700m of total annualised wholesale supply sales ahead of our initial end-2018 guidance.\nOur plan for £1bn of annualised wholesale supply sales in due course remains unchanged.\nLooking ahead, it also expects lower costs of both its Morrisons.com expansion and the ramping up of its wholesale supply operations. Morrisons has introduced a quieter hour to cut stress for anxious shoppers (Image: PA) 8:46\nThe FTSE-100 index opened at 7313.36.\nThe pound at 8am was 1.3036 dollars compared to 1.3028 dollars at the previous close.\nThe euro at 8am was 0.8920 pounds compared to 0.8924 pounds at the previous close. 8:40 KEY EVENT John Lewis blames 'challenging times' as profits crash 99%\nThe John Lewis Partnership has revealed its half-year profits have crashed 98.8% amidst “challenging times” as it battled against the most promotional market for nearly a decade.\nThe company - which includes department store chain John Lewis Waitrose - saw its underlying pre-tax profits drop tp £1.2m for the six months ending July 28.\nIts profits were hit as John Lewis continued to keep its prices low despite inflation, with the company saying it has offered “unprecedented” levels of price matching through its Never Knowingly Undersold promise.\nProfits for the full financial year are expected to be substantially lower than previous results.\nSir Charlie Mayfield, chairman of the John Lewis Partnership, said:\nThese are challenging times in retail.\nWith the level of uncertainty facing consumers and the economy, in part due to ongoing Brexit negotiations, forecasting is particularly difficult but we continue to expect full-year profits to be substantially lower than last year for the Partnership as a whole.\nThe half-year results showed on a statutory basis, pre-tax profits slumped 80.5% to £6m.\nJohn Lewis department stores slumped to an underling operating loss of £19.2m from earnings of £54.4m a year earlier. Like-for-like sales at the chain fell 1.2%.\nThis offset a better performance at Waitrose, which remained in profit albeit down 12.2% at £96.4m on an underlying basis. Like-for-like sales rose 2.6% at the supermarket, thanks to a marked improvement in the second quarter, with the grocery chain on track for a full-year trading profit.\nThe results come just days after the company rebranded as John Lewis & Partners.\nThe name change was made to emphasise the importance of the company’s staff - who are known as partners internally - and show it had a high standard of customer service.\nHowever, despite this focus on staff it also came to light that the restructure also involved making 200 of its workers redundant . If approved the proposal would see staff working in back office roles affected. A woman carrying a Waitrose bag outside a John Lewis store (Image: PA) More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15145297;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-09-13T10:30:00.000+03:00", "crawled": "2018-09-13T11:58:58.004+03:00", "highlightTitle": ""}