{"organizations": [], "uuid": "86f79fa4836d0e2452981a0cfad89e0b42bab3da", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article2040303.ece/ALTERNATES/s1200/1_First-gay-wedding-in-the-royal-family.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/queens-cousin-marries-boyfriend-first-2040296", "country": "US", "title": "Queen's cousin marries boyfriend in first same-sex royal wedding at Devon estate", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-25T10:00:00.000+03:00", "replies_count": 0, "uuid": "86f79fa4836d0e2452981a0cfad89e0b42bab3da"}, "author": "Jamie Hawkins", "url": "https://www.devonlive.com/news/devon-news/queens-cousin-marries-boyfriend-first-2040296", "ord_in_thread": 0, "title": "Queen's cousin marries boyfriend in first same-sex royal wedding at Devon estate", "locations": [], "entities": {"persons": [{"name": "penny", "sentiment": "none"}, {"name": "louise mountbatten", "sentiment": "none"}, {"name": "ivar mountbatten", "sentiment": "none"}, {"name": "ivar", "sentiment": "none"}, {"name": "alexandra", "sentiment": "none"}, {"name": "ella", "sentiment": "none"}, {"name": "james coyle", "sentiment": "none"}], "locations": [{"name": "devon", "sentiment": "none"}, {"name": "verbier", "sentiment": "none"}, {"name": "milford haven", "sentiment": "none"}, {"name": "uffculme", "sentiment": "none"}], "organizations": [{"name": "cancel play now royal family", "sentiment": "none"}, {"name": "instagram", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Click to play Tap to play The video will start in 8 Cancel Play now Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nRoyal Family history has been made after the Queen’s cousin married his boyfriend in Devon.\nLord Ivar Mountbatten tied the knot with his partner James Coyle, making it the first same-sex wedding in the family.\nThe pair were wedded in Lord Ivar’s chapel at his Grade I listed home near Uffculme, which was described as a “perfect day,” The Mirror reports.\nHe was given away by his ex-wife Penny, in front of their three daughters Ella, Alexandra and Louise Mountbatten and other family and friends. The Royal Family's first same-sex marriage happened at the weekend (Image: ivar_mountbatten/Instagram)\nLord Ivar and Penny divorced in 2010 after a 16-year marriage and he came out two years ago.\nHe later revealed he struggled with his sexuality throughout their relationship but they remained close. Read More Next says there will be delays and higher prices after Brexit\nLord Ivar, son of the 3rd Marquess of Milford Haven, met partner James Coyle in the upmarket Swiss ski resort of Verbier.\nHe shared photos of their celebration on social media, thanking everyone who make it such a special day. Instagram\nHe wrote: \"Well we did it finally! It was an amazing day despite the miserable British weather.\n\"Fabulous service conducted by Trish Harrogate, chief Registrar for Devon, who set the perfect but lighthearted tone for what is a serious occasion. The accompanying gospel choir were amazing. Lord Ivar Mountbatten (Image: Richard Austin)\n\"Thank you so much to Bristol’s Teachers Rock Choir for your superb singing. Most importantly a massive thanks to my 3 gorgeous girls for being so understanding and supportive, without their support this could never have happened!\n\"And finally the biggest thank you to James for being just perfect.\" Read More\nEarlier this year, Lord Ivar, Penny and James spoke openly about their relationships in an interview with the Daily Mail . The wedding took place at Bridwell House, Lord Ivar's home\nLord Ivar knew he was gay from a young age, and told Penny he was bisexual before he proposed.\nHe spoke about how supportive his friends and family have been, and how welcoming they've been to James.\nSpeaking to the Daily Mail , he said: \"I had a really happy childhood but I could never tell my parents I was gay. Where I grew up, gay men were called poofs, queers, everything derogatory under the sun.\n\"In 15, 20 years' time people will struggle to understand how we came to be having such conversations. People will look back and say, 'What's the big deal?' But for our generation it was.\" Read More\nPenny added: \"What I don't think Ivar realises is how much he has changed as a man since he 'came out'. James is hugely responsible for that because he's so much fun.\" Like us on Facebook ", "external_links": ["https://www.instagram.com/p/BoGz-sGAAFx/?utm_source=ig_embed&utm_medium=loading/embed", "http://www.dailymail.co.uk/news/article-5849971/Royal-familys-gay-wedding-story-Queens-cousin-Lord-Ivar-Mountbatten.html", "https://www.mirror.co.uk/news/uk-news/queens-cousin-makes-history-marrying-13299738", "https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-09-25T10:00:00.000+03:00", "crawled": "2018-09-25T10:31:16.000+03:00", "highlightTitle": ""}