{"organizations": [], "uuid": "17befb5eabfc56db3d49cdd5f9b3fae173a28931", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15203885.ece/ALTERNATES/s1200/0_Labour-Party-annual-conference-2018.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-labour-conference-speech-15203722", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn Labour conference speech: Leader says he could be Prime Minister within a year", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-26T17:15:00.000+03:00", "replies_count": 0, "uuid": "17befb5eabfc56db3d49cdd5f9b3fae173a28931"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-labour-conference-speech-15203722", "ord_in_thread": 0, "title": "Jeremy Corbyn Labour conference speech: Leader says he could be Prime Minister within a year", "locations": [], "entities": {"persons": [{"name": "corbyn", "sentiment": "negative"}, {"name": "jeremy corbyn labour", "sentiment": "negative"}], "locations": [{"name": "uk", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Farming industry\nBut Mr Corbyn promised that Labour would also support employers, by building the infrastructure such as transport systems that they need to succeed.\nHe said: “We will rebalance power in the workplace, but I say to businesses large and small: Labour will also deliver what you need to succeed and to expand and modernise our economy.\n“More investment in our transport, housing and digital infrastructure. More investment in education and skills, so workers are more productive. Action to save the High Street ... and action to deal with rip-off bills that hit us all.”\nThe Labour leader said the “failed economic free-for-all” of recent decades had led to lower wages and living standards.\nAnd he claimed that if the economy was not transformed then the UK could witness the rise of racist far-right parties.\n“People in this country know that the old way of running things isn’t working any more. And unless we offer radical solutions, others will fill the gap with the politics of blame and division.”\nAs expected, Mr Corbyn set out plans to create 400,000 new “green” jobs through renovating homes and expanding renewable energy, including building more on-shore wind farms. Read More Theresa May's Brexit plans 'threaten North East employers'\nAttention at the party conference in Liverpool focused on debate about whether Labour should back a “People’s Vote” or second referendum on EU membership.\nBut the party avoided a major row when delegates overwhelmingly backed a motion stating that Labour should keep the option of a referendum on the table if Theresa May’s Government fails to agree a suitable Brexit deal with the EU - and if there is no early general election.\nMr Corbyn insisted that Labour “respects the decision of the British people” in the 2016 Brexit referendum.\nAnd he appeared to make it clear that Labour ultimately has no intention of blocking Brexit, saying: “Our priority is clear – we aim to get the best Brexit deal for jobs and living standards to underpin our plans to upgrade the economy and invest in every community and region.”\nHe made no direct reference to the possibility of calling for a second referendum, but told the conference: “That is why if Parliament votes down a Tory deal or the Government fails to reach any deal at all we would press for a General Election. Failing that, all options are on the table.” Read More Jeremy Corbyn plans to help create 400,000 green jobs with expansion of on-shore windfarms\nHe called for unity, as he warned delegates that Labour could only win power if it was united.\nAnd the Labour leader called for an end to online abuse. It follows claims that some of his supporters have indulged in attacks on so-called moderate MPs on social media services such as Twitter.\n“We need to foster a much greater culture of tolerance. An end to abuse, online and in person.\n“We must learn to listen a bit more, and shout a lot less.”\nMr Corbyn said Labour must “listen” to the Jewish community when it voiced concern about anti-Semitism,\nHe did not directly state that Labour had made any mistakes in dealing with the anti-Semitism row over the summer. But his comments could be seen as a tacit admission that the party had not listened enough. Read More\nHe said: “Being anti-racist means we must listen to those communities suffering discrimination and abuse.\n“I believe we are all stronger from listening and learning from each other.\n“The Jewish people have suffered a long and terrible history of persecution and genocide. I was humbled to see a memorial to that suffering two years ago, when I visited the former Nazi concentration camp at Terezin.\n“The row over anti-Semitism has caused immense hurt and anxiety in the Jewish community and great dismay in the Labour Party. But I hope we can work together to draw a line under it.”\nMr Corbyn also attacked Conservatives over the “hostile environment” policy that led to the Windrush scandal.\nAnd he attacked Tory Boris Johnson’s comments about women who wear the burqa, describing them as “disgraceful dog-whistle jibes at Muslim women”. Like us on Facebook", "external_links": [], "published": "2018-09-26T17:15:00.000+03:00", "crawled": "2018-09-26T18:34:40.000+03:00", "highlightTitle": ""}