{"organizations": [], "uuid": "8bd5ba13c82d87ac0d76a3f5c5cd12f3bda23bc4", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14756890.ece/ALTERNATES/s1200/GMB-annual-conference.jpg", "site_section": "http://www.chroniclelive.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-referendum-brexit-may-15188993", "country": "GB", "domain_rank": 21960, "title": "Jeremy Corbyn says Labour could back a second Brexit referendum", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-23T13:00:00.000+03:00", "replies_count": 0, "uuid": "8bd5ba13c82d87ac0d76a3f5c5cd12f3bda23bc4"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/jeremy-corbyn-referendum-brexit-may-15188993", "ord_in_thread": 0, "title": "Jeremy Corbyn says Labour could back a second Brexit referendum", "locations": [], "entities": {"persons": [{"name": "jeremy corbyn", "sentiment": "negative"}, {"name": "corbyn", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "tom watson", "sentiment": "none"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "liverpool", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}], "organizations": [{"name": "labour", "sentiment": "negative"}, {"name": "invalid email labour", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jeremy Corbyn says Labour could back a second Brexit referendum Labour leader says he'll back a second referendum if party members want one Share Click to play Tap to play The video will start in 8 Cancel Play now Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nLabour leader Jeremy Corbyn has said he’s willing to back a second referendum on Brexit , if that’s what party members want.\nIt comes after Deputy Leader Tom Watson said Labour should be ready to back a so-called People’s Vote, if the party membership called for one.\nLabour’s official policy is still not to support a second referendum on whether or not to leave the EU . But the comments from the party’s top figures suggest that could change.\nActivists are set to discuss Brexit and calls for a second referendum at the party’s annual conference, taking place in Liverpool, and the results of that debate could determine the party’s future policy.\nMr Corbyn told the Sunday Mirror: “What comes out of conference I will adhere to.\n“But I’m not calling for a second referendum. I hope we will agree that the best way of resolving this is a General Election.\n“But I was elected to empower the members of the party.\n“So if conference makes a decision I will not walk away from it and I will act accordingly.” Read More Defiant Theresa May tells EU leaders: 'I won't let you break up the United Kingdom'\nThere was a similar message from deputy Labour leader Tom Watson, who told The Observer: “Jeremy and I were elected in 2015 to give the Labour Party back to its members.\n“So if the people’s party decide they want the people to have a final say on the deal, we have to respect the view of our members and we will go out and argue for it.”\nHowever, speaking to BBC Breakfast, shadow housing and communities minister Andrew Gwynne stopped short of repeating his bosses’ support for a people’s vote if it is the wish of party members.\n“Of course we’re a democratic party, but before we get that we want a general election, because this government has made a complete fist of Brexit, they haven’t been able to negotiate a deal,” he said. Labour Party leader Jeremy Corbyn (Image: PA)\nA poll found 86% of Labour members think voters should have the final say on the outcome of Brexit negotiations, and 90% would now vote to remain in the EU.\nAs Labour’s conference officially begins in Liverpool, a march of MPs, MEPs, union leaders and activists will attempt to put pressure on the party to throw its weight behind a so-called People’s Vote. Those expected to take part include Newcastle North MP Catherine McKinnell.\nMore than 100 constituency parties have submitted motions calling for the issue to be put to a vote.\nMany activists believe that with Theresa May’s plans in disarray following the rejection of her Chequers proposals by EU leaders in Salzburg, the time is now right for Labour to call for a fresh ballot.\nConservatives claimed Labour was failing to accept the results of the 2016 referendum. Read More MP Catherine McKinnell joins Labour conference march calling for second Brexit vote\nBrandon Lewis, Conservative Party Chairman, said: “The last pretence that Labour ever respected the democratic decision of the British people is rapidly disappearing.\n“If Labour back a second referendum they will have broken their manifesto pledge and betrayed millions of people who voted in good faith to leave the EU.\n“Labour would take us back to square one. Only the Conservatives will respect the referendum result and take back control of our laws, borders and money.” More politics news\nSupporters of a second referendum, which they call a People’s Vote, say that the public should have a chance to say whether or not they support the final Brexit deal - or the possibility of leaving without a deal - one it has become clear what Theresa May’s government has negotiated with the EU.\nA small number Conservative MPs also back a People’s Vote, but the idea has been firmly ruled out by the Government. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-23T13:00:00.000+03:00", "crawled": "2018-09-23T15:30:57.004+03:00", "highlightTitle": ""}