{"organizations": [], "uuid": "beacbcde8db3b083bbb000f8a8799793a59e1840", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15194875.ece/ALTERNATES/s1200/0_2018-Labour-Party-Conference-Day-Two.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/fed-up-empty-homes-your-15194736", "country": "GB", "domain_rank": 21960, "title": "Fed up of empty homes on your street? Labour reveals plan to stop properties falling into disrepair", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-24T18:00:00.000+03:00", "replies_count": 0, "uuid": "beacbcde8db3b083bbb000f8a8799793a59e1840"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/fed-up-empty-homes-your-15194736", "ord_in_thread": 0, "title": "Fed up of empty homes on your street? Labour reveals plan to stop properties falling into disrepair", "locations": [], "entities": {"persons": [{"name": "john healey", "sentiment": "none"}, {"name": "healey", "sentiment": "none"}, {"name": "chroniclelive", "sentiment": "none"}, {"name": "ferryhill", "sentiment": "none"}], "locations": [{"name": "liverpool", "sentiment": "none"}, {"name": "sedgefield", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}], "organizations": [{"name": "news fed", "sentiment": "negative"}, {"name": "labour’s shadow housing", "sentiment": "none"}, {"name": "labour government", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Fed up of empty homes on your street? Labour reveals plan to stop properties falling into disrepair Shadow Housing Secretary John Healey reveals the Labour Party's plan to tackle neglected homes in the North East Share Shadow Housing Secretary John Healey (Image: Getty Images Europe) Get daily\nLabour has promised a crackdown on derelict empty homes which “drag the neighbourhood down”.\nJohn Healey, Labour’s Shadow Housing Secretary, told ChronicleLive that he’d seen the problem first-hand during a recent visit to Ferryhill, Sedgefield.\nNorth East MPs have also raised concerns about privately-rented homes in the region, which go unoccupied for years and fall into a state of disrepair, sometimes becoming magnets for anti-social behaviour.\nSpeaking at Labour’s annual conference in Liverpool, Mr Healey said that a Labour Government would act to penalise landlords who allowed this to happen, by tripling council tax bills on the properties concerned.\nLabour would also make it much easier for councils to use empty management orders, which allow them to clean up properties at the landlord’s expense.\nHe said: “This allows a council, on behalf of the local community, to go in where you have a privately-rented property that may be badly maintained, a source of vermin, anti-social behaviour, that drags the neighbourhood down. Read More Shadow Foreign Secretary Emily Thornberry says Labour would delay Brexit\n“The council can go in, take charge of it, bring it up to scratch, and re-charge the owner for that.\n“Also there is a fallback power we propose to toughen, that allows the council to purchase the property if required as well.”\nMPs who have highlighted the problem of run-down empty homes include Grahame Morris, MP for Easington, who told the House of Commons that large numbers of homes in Horden and Blackhall, in his constituency, had been allowed to fall into disrepair.\nIn his speech to the party conference, Mr Healey announced plans to provide £20m to set up and support the expansion of renters’ unions, in a bid to help ensure people renting from private landlords get a fair deal.\nThe unions will provide practical support and information, support tenants in disputes with landlords and give renters a stronger national voice, he said. Read More Wansbeck MP Ian Lavery urges Labour activists to back new rules\nMr Healey said: “Tenants who rent from private landlords have been hit hard by the housing crisis.\n“Labour’s commitment is clear: we’ll give renters new rights to control rental costs, improve conditions and increase security.\n“Renters’ unions help put power in the hands of tenants.\n“And the next Labour Government will fund set up costs for these unions across the country to support renters to defend their rights, and make the housing market fairer.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-24T18:00:00.000+03:00", "crawled": "2018-09-24T20:37:46.078+03:00", "highlightTitle": ""}