{"organizations": [], "uuid": "a6208dc34f307cace3baaf9dae61910f6bc0bf51", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13933183.ece/ALTERNATES/s1200/CFR_NJL_211117centralsquare_02JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/record-year-pwcs-newcastle-office-15163984", "country": "GB", "domain_rank": 21960, "title": "Record year for PwC's Newcastle office as investment in staff tops priority list", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-17T18:04:00.000+03:00", "replies_count": 0, "uuid": "a6208dc34f307cace3baaf9dae61910f6bc0bf51"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/record-year-pwcs-newcastle-office-15163984", "ord_in_thread": 0, "title": "Record year for PwC's Newcastle office as investment in staff tops priority list", "locations": [], "entities": {"persons": [{"name": "jona", "sentiment": "negative"}, {"name": "jonathan greenaway", "sentiment": "none"}, {"name": "greenaway", "sentiment": "none"}], "locations": [{"name": "orchard street", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "pwc", "sentiment": "negative"}, {"name": "newcastle office", "sentiment": "none"}, {"name": "share central square south", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Record year for PwC's Newcastle office as investment in staff tops priority list Senior partner Jonathan Greenaway has hailed a strong year at the professional services firm Share Central Square South in Orchard Street, Newcastle (Image: tark archive) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThe senior partner for PwC’s Newcastle office has hailed a record year for the accountancy giant’s regional team.\nThe professional services firm has unveiled its financial performance for the year ended June 2018 in which it saw growth across all four of its business divisions – a national picture which Newcastle senior partner Jonathan Greenaway said was mirrored at a local level.\nThe firm posted revenue of £3.76bn for the year ended 30 June 2018, up 5% from £3.60bn last year, as it continued to invest in people and technology across the UK to support its clients.\nJonathan Greenaway, PwC’s Newcastle Office senior partner said: “It’s been a very strong year – a record year for us in Newcastle. The assurance and audit division has done very well with a number of big wins including Utilitywise and from a corporate finance point of view we’ve seen strong performance, advising, for example, on the sale of Wear Inns. Jonathan Greenaway, PwC's Newcastle Office senior partner (Image: Mike Smith Photography)\n“And we continue to recruit heavily. Our numbers are pretty consistent and when you think of the investment in technology its pleasing for me that we investment as heavily as we do in local talent. That is the biggest challenge for us really, to keep them at PwC and in the North East.\n“The headcount is just as big as it’s ever been and at the same time we are developing some great initiatives. We’ve got a very big cyber team who are running a proposition that’s been taken nationally.\n“Investing in our regional footprint is a priority for the firm. At the beginning of September we had 13 graduates join our Newcastle office taking the total number of graduates joining the firm across the North this summer to 145.\n“Ensuring that we have the right skills, increased levels of specialisms and technologies to assist with the challenges facing our clients in the future is essential. Whilst creating new and more flexible ways of working bringing together our people and technology to deliver a wider range of integrated services in a way that best suits our clients.\n“Looking ahead, we’re keeping one eye on where we’re going to be in six months - who knows? Yet when we speak to businesses they are just carrying on as usual, and I like that that’s the North East’s way of doing things.”\nDespite uncertainty over Brexit, Kevin Ellis, PwC UK chairman and senior partner, said all four business divisions grew over the year, with high demand for technology-related services, including cyber, data analytics and GDPR.\nAssurance revenues increased by a solid 3%, Consulting revenues were up by 1%, Deals grew strongly by 10%, and the tax practice, which includes specialists in areas such as immigration, legal services and pensions, experienced good growth of 7%.\nA total of 29% of the firm’s revenues came from organisations headquartered outside the UK, which he said highlights the importance of the UK as a global business hub.\nMr Ellis added: “Momentum in our business is good, driven by a strong deals market and demand for technology-driven business expertise, as we see organisations turn to us to help them transform their business models, many in response to digital disruption.\n“We are adopting new technologies to ensure our business is efficient and connected for the future.\n“We’ve made a step change in our own digital transformation this year with significant investment in cloud-based technologies such as Google for Work , Salesforce, and Workday, as well as continuing to invest in emerging technologies expertise in AI, virtual reality and a drones’ team to build and innovate client services.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-17T18:04:00.000+03:00", "crawled": "2018-09-18T01:57:39.022+03:00", "highlightTitle": ""}