{"organizations": [], "uuid": "855c607508db53a04e298f5eac15a6418841f82d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article13643477.ece/ALTERNATES/s1200/1_SGP_NEC_071116NEXT01JPG.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15196323", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Retailer Next warns over no-deal Brexit threats", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-25T10:00:00.000+03:00", "replies_count": 0, "uuid": "855c607508db53a04e298f5eac15a6418841f82d"}, "author": "Jonathon Manning", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15196323", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Retailer Next warns over no-deal Brexit threats", "locations": [], "entities": {"persons": [{"name": "patrick thomson", "sentiment": "none"}], "locations": [], "organizations": [{"name": "centre for ageing better", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Jonathon Manning Banks told to 'step up' as fraudster steal £500m from UK customers\nFraudsters stole more than £500m from UK bank customers in the first six months of 2018, figures have shown.\nA total of £145m of the cash was lost through authorised push payment (APP) scams, which trick people into authorising payments to another account.\nThe remaining £358 million was lost due to unauthorised fraud, where the transaction is carried out by a third party and is not authorised by the account holder.\nAccording to UK Finance, £30.9m of the £145m had been returned to customers.\nKaty Worobec, managing director of economic crime at UK Finance, said the figures showed scams posed a “major threat” to the UK.\nShe said:\nThe criminals behind it target their victims indiscriminately and the proceeds go on to fund terrorism, people smuggling and drug trafficking, whether or not the individual is refunded.\nShe added that the industry was taking action to address the problem and was investing in security systems and cyber defences.\nHowever Gareth Shaw, money expert at consumer group Which?, said that banks’ efforts had been “woefully insufficient”.\nHe said:\nIt’s now two years since our super-complaint highlighted the lack of protection for victims of bank transfer scams, but these shocking figures show just how widespread the problem still is.\nBanks... have not done enough to protect their customers, who continue to lose life-changing sums of money to ever-more sophisticated crooks.\nThe Payment Systems Regulator has rightly committed to introducing a reimbursement scheme for victims. It’s about time that banks step up and properly compensate customers who have lost money through no fault of their own. Families are being tricked by this scam into handing over bank details (Image: PA) 9:12 KEY EVENT Companies urged to help staff with 'mid-life MOTs'\nFirms are being urged to give staff ‘mid-life MOTs’ to help them plan their career, health and finances.\nThe Centre for Ageing Better said a work-based MOT should be the start of an engagement process with staff.\nPatrick Thomson, senior programme manager with the charity, said:\nAs more of us live longer, we need to act earlier in life to enable us to stay healthier, work for longer, and save more if we are to enjoy our later lives.\nPeople in mid-life could benefit from better access to information and advice to plan and prepare for their later lives. A job interview KEY EVENT StudyAtlas vows to become $1bn firm with comparison platform for international students\nA North East company has ambitious aims to become a $1bn company through the launch of a pioneering platform for international students next month.\nStudyAtlas is creating a one-stop shop for students which allows them to compare universities, research scholarships, and apply for degree courses from around the world.\nUnder the current system international students apply for university courses through agents, who often charge both the education provider and the students for their services.\nThis can also lead to students being recommended university programmes based on the amount of commission the agent is paid, rather than the course on offer.\nStudyAtlas has been founded by Asanka Jayaweera and Buddikha Herath who are aiming to fix this problem by cutting out the agents and providing students with all the information they need to make a decision about their degree.\nMr Jayaweera said:\nThe problem in this market is that students are mostly blind. This means the market can be corrupted.\nStudents believe what the agents are saying but don’t know what is happening between the agent and the university. We realised this is not the right thing for the student.\nThere is currently no comparison platform comparing universities from different countries, which is a disadvantage for students. Our system means the students can see what is happening in between.\nWe are reducing about 80% to 90% of the corruption out there through the platform.\nMr Jayaweera and Ms Herath are originally from Sri Lanka but moved to the UK to launch StudyAtlas. The platform, which launches in the first week of October, will initially allow students to apply for courses at all 160 UK universities, 40 Australian universities and the eight in New Zealand. Buddikha Herath and Asanka Jayaweera, co-founders of StudyAtlas, at TusPark (Image: Jonathon Manning) 8:57 Jonathon Manning High street challenges persist for Card Factory\nCard Factory has warned that challenging conditions on the high street are continuing to drag on profits.The retailer, which issued a profit warning earlier this year, saw underlying pre-tax profit drop 14% to £22.7m in the in the six months to July 31.Like-for-like sales dipped 0.2% amid a “difficult consumer backdrop”.But total sales in the period were up 3.2% to £185.3m as the firm was boosted by record numbers for Valentine’s Day, Mother’s Day and Father’s Day.Boss Karen Hubbard said:\nWe have delivered solid interim results with overall sales growth, despite the weak consumer environment and particularly challenging footfall across the high street, driven by various factors.\nProfitability was impacted by lower like-for-like sales, but we continue to largely mitigate the headwinds we face through various business efficiencies.\nCard Factory shares plunged as much as 7% at the market open before settling at 3% lower. The Card Factory store at Gosforth Shopping Centre (Image: Dalla House Photography) 8:50 Jonathon Manning Travelodge delivers \"strong revenue growth\"\nTravelodge has said it has delivered “strong revenue growth” after seeing its turnover jump 8% to £317.2m.\nThe company opened six hotels during the year ending June 27 2018, which helped boost its room count to 42,620.\nPeter Gowers, Travelodge chief executive said:\nIn the first half of the year, Travelodge delivered strong revenue growth and has continued to outperform the midscale and economy market segment. Our focus on location, price and quality is paying off with another period of increased occupancy.\nWe now offer UK travellers more choice than ever, with a modernised core estate, our premium economy ‘SuperRooms’ and our new ‘Travelodge PLUS’ format.\nThe recent opening of our new flagship hotel with 395 rooms in the heart of the City of London is a major milestone, highlighting just how far Travelodge has come since we opened our first small hotel by the roadside in 1985.\nWhile the financial figures for the firm were strong, Mr Gowers did hint that Brexit was still a cause for concern for the company.\nHe said:\nWhile the UK continues to face economic uncertainty, demand for budget hotels remains strong and more and more businesses are choosing the budget sector. Although the general economic picture, the impact of new supply growth and clear short-term cost headwinds lead us to remain cautious about the immediate outlook, our strategic focus and growing pipeline will position us well as these pressures abate. The Travelodge on Fortster Street in Newcastle (Image: Google maps) 8:45 Jonathon Manning Comcast takes bite out of sky following takeover victory\nComcast has snapped up 29% of Sky shares on the open market after winning a bidding war with Fox for the British broadcaster.\nThe US firm has acquired 499.6 million shares at £17.28 each, which is the same price as its winning final bid om an auction run by the Takeover Panel.\nComcast said it was looking to make more purchases at the same price.\n21st Century Fox still holds a 39% stake in Sky and said it was considering its options. Sky HD TV remote control (Image: PA) 8:38 KEY EVENT Windfall for all JT Dove workers who get bonus worth 11% of salary after company builds up profits\nEmployees at builders merchant JT Dove will receive a windfall bonus worth more than 11% of their salary thanks to a strong year.\nThe Newcastle headquartered firm, which has 18 sites across Tyne and Wear, Northumberland, Cumbria, County Durham and Teesside, has posted its financial performance for 2017 which saw a 14% lift in sales from £46m to £52.4m, while operating profit also rose from £2.04m to £2.45m.\nThe directors said they were pleased with the results, which came amid a year of economic and political uncertainty, aided by further development at its Seahouses and Darlington branches which had opened in 2016.\nStaff will also being rewarded for the group’s solid performance, through the firm’s employee profit share scheme, which has been in place for more than 60 years.\nThe staff payments have been made since a move introduced in 1954 by founder Herbert Dove and his wife, to place the business into an Employee Benefit Trust, which is similar to the John Lewis Partnership and allows staff to share in the company’s success.\nA stategic report attached to the firm’s accounts said:\nWith the increased turnover and a steady gross margin percentage we saw further growth in both our gross profit and operating profit.\nConsequently the Herbert Dove Trustees were able to declare an employee profit share for the year equivalent to over 11.4% of salary.\nIn addition, we continued to make an additional contribution to our defined benefit pension scheme. This year it was £195,000, giving a total contribition of £624,000 for the year. JT Dove managing director Steve Robinson (left) at their newly opened Hetton branch with branch manager Paul Frost (Image: handout supplied for free bySimon Williams 07889532545) 8:33 New chief executive for British American Tobacco\nBritish American Tobacco has appointed Jack Bowles as its new chief executive.Mr Bowles will replace Nicandro Durante, who is retiring after nearly 37 years with the company and eight years at the helm.He will become chief executive designate on November 1 and will join the board on January 1.Mr Bowles joined BAT in 2004 as head of its France division before becoming managing director of the group’s listed subsidiary in Malaysia.He was appointed to the BAT management board in 2009 as regional director for Western Europe and has also held roles in the America and Asia-Pacific Region before assuming his current role as chief operating officer in 2017.Chairman Richard Burrows said:\nJack’s track record of innovating, and his experience across so many different geographies and areas of our business, position him extremely well to build on Nicandro’s achievements and write the next chapter in BAT’s history. The London offices of British American Tobacco 8:27 Jonathon Manning Newcastle entrepreneur launches fashion business hiring luxury handbags\nA former beauty therapist has bagged her own specialist business after spotting a gap in the North East fashion market.\nChantel Williams has turned her passion for high end handbags into a new rental business, investing £30,000 to launch Rose Rova which allows fashionistas to rent her expensive accessories for up to four weeks.\nMrs Williams has sought out vintage and new pieces from the likes of Chanel, Fendi, Louis Vuitton, Prada, Dior and Saint Laurent, many of which cost thousands of pounds to buy.\nBut through Rose Riva, based in Newcastle city centre, they can be hired from £85 a week and up to £500 for four weeks.\nThe firm has also pledged to add bags by request from customers, offering bag-sourcing services.\nMrs Williams said:\nAfter seeing similar business models in America, we noticed that the North East was lacking a service which we know would be incredibly popular.\nLuxury handbags are a desirable, but often unaffordable accessory - these bags often cost thousands of pounds.\nOur service ensures everyone who has an interest or passion for high end fashion brands can enjoy these high-quality accessories for any occasion.\nWe devoted a lot of time and consideration into sourcing each bag.\nSome are high-quality vintage pieces, while some are from the newest lines. We’ve made sure that we have something to meet all tastes. Chantel Williams who has launched handbag company Rose Riva (Image: Rose Riva) 8:23", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15196323;", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-09-25T10:00:00.000+03:00", "crawled": "2018-09-25T11:22:26.003+03:00", "highlightTitle": ""}