{"organizations": [], "uuid": "c8c94211e32e0e1645f5d2bc62672f0e7db9320d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15195410.ece/ALTERNATES/s1200/0_Labour-Party-annual-conference-2018.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/disagreements-labour-conference-over-referendum-15195309", "country": "GB", "domain_rank": 21960, "title": "Disagreements at Labour conference over referendum to stop Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-24T20:00:00.000+03:00", "replies_count": 0, "uuid": "c8c94211e32e0e1645f5d2bc62672f0e7db9320d"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/disagreements-labour-conference-over-referendum-15195309", "ord_in_thread": 0, "title": "Disagreements at Labour conference over referendum to stop Brexit", "locations": [], "entities": {"persons": [{"name": "keir starmer", "sentiment": "none"}, {"name": "catherine mckinnell", "sentiment": "none"}, {"name": "john mcdonnell", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "mcdonnell", "sentiment": "none"}, {"name": "mckinnell", "sentiment": "none"}], "locations": [{"name": "liverpool", "sentiment": "none"}], "organizations": [{"name": "brexit newcastle", "sentiment": "negative"}, {"name": "brexit disagreements at labour", "sentiment": "negative"}, {"name": "labour", "sentiment": "negative"}, {"name": "eu", "sentiment": "none"}, {"name": "newcastle north", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "people's vote", "sentiment": "none"}, {"name": "labour party", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Disagreements at Labour conference over referendum to stop Brexit Newcastle MP and activists want a referendum to cancel Brexit but Shadow Chancellor John McDonnell disagrees Share Members of the public march in support of the People's Vote campaign in Liverpool, during the Labour Party's annual conference at the Arena and Convention Centre (ACC) (Image: PA) Get daily\nNewcastle MP Catherine McKinnell has insisted Labour must offer voters a real choice in a “People’s Vote” on Brexit - including the option of staying in the EU.\nShe spoke out after Shadow Chancellor John McDonnell rejected activists’ pleas for the party to support a referendum that included stopping Brexit as an option.\nLabour’s policy was thrown into confusion when Shadow Brexit Secretary Keir Starmer contradicted Mr McDonnell, and insisted Labour had not in fact ruled out a second referendum which could halt Brexit.\nMs McKinnell, Labour MP for Newcastle North, said: “The public are now understandably demanding the right to have a meaningful say on whether we should leave the EU at all.“ MP Catherine McKinnell (Image: Newcastle Chronicle)\nLabour delegates at the party conference in Liverpool are to vote on the party’s Brexit policy, after members in 86 constituencies, including some in the North East, submitted motions which specifically call for a referendum on whether to continue with Brexit - or to stay in the EU.\nMost of the motions say that Labour should hold a referendum if it forms a government, as well as calling on the Conservative government to back a second poll.\nBut Mr McDonnell, Labour leader Jeremy Corbyn’s second-in-command, said that Labour would only support a second referendum on Brexit to decide whether the country accepted the Government’s proposed deal with EU countries, or rejected it.\nThe option of simply cancelling Brexit and staying in the EU would not be included. Jeremy Corbyn (Image: PA)\nMr McDonnell said: “We will be arguing that it should be a vote on the deal itself.”\nHe was later overruled by Shadow Brexit Secretary Sir Keir, who insisted the option of holding a referendum about remaining in the EU was still on the table.\nHe said: “We weren’t ruling out options and nobody was ruling out remain.” Read More Shadow Foreign Secretary Emily Thornberry says Labour would delay Brexit\nMs McKinnell said it wasn’t good enough to offer a choice between rejecting or accepting the Government’s Brexit deal if it didn’t include the option of cancelling Brexit.\nShe said: “Over a hundred motions were submitted to Labour Conference, thousands have marched on the streets, and millions more have called for a Peoples Vote.\n“Labour members support a People’s Vote by almost nine to one. 90% of Labour members want to stay in the EU. The leadership of the Labour Party must continue to listen to them.\n“But what we cannot have is a Hobson’s choice referendum, with only Jacob Rees-Mogg’s no deal or Theresa May’s botched up bad deal on the ballot paper.”\nA motion calling on Labour to make “a manifesto commitment to call a public vote on the deal with an option to remain in the EU” was backed by Bishop Auckland Constituency Labour Party (CLP) and North West Durham CLP.\nNewcastle Central CLP called on the party to “campaign for a public vote on an unsatisfactory, or ‘no deal’ Brexit, including the option of remaining in the EU”. Read More\nThe Newcastle Central motion continued: “Failing this, call for a general election with a manifesto commitment to call for a public vote on the deal with an option to remain in the EU.”\nLabour Deputy Leader Tom Watson had urged the party to accept the views of members. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-24T20:00:00.000+03:00", "crawled": "2018-09-24T20:37:21.002+03:00", "highlightTitle": ""}