{"organizations": [], "uuid": "3fcea30a189573a80a7a9c1041a95be067c990fa", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15178353.ece/ALTERNATES/s1200/0_GWR_NJL_250118traid_01jpeg.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-opinion/traidcraft-north-east-business-best-15211855", "country": "GB", "domain_rank": 21960, "title": "Traidcraft is North East business at its best: someone save it!", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-28T13:53:00.000+03:00", "replies_count": 0, "uuid": "3fcea30a189573a80a7a9c1041a95be067c990fa"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-opinion/traidcraft-north-east-business-best-15211855", "ord_in_thread": 0, "title": "Traidcraft is North East business at its best: someone save it!", "locations": [], "entities": {"persons": [{"name": "richard adams", "sentiment": "none"}, {"name": "traidcraft", "sentiment": "none"}], "locations": [{"name": "north east", "sentiment": "none"}, {"name": "team valley", "sentiment": "none"}], "organizations": [{"name": "newcastle university", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Traidcraft in the developing world (Image: Copyright unknown) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nNow that we all buy fair trade bananas from the big supermarkets, it’s easy to forget that the fair trade movement has not always been in the mainstream.\nIt’s easy to forget too that the movement only became a movement thanks in large part to a company on Tyneside.\nTraidcraft was launched by Newcastle University graduate Richard Adams in 1979 and has been a presence on Team Valley since the 1980s.\nBut now it faces possible closure, after the fall in the pound that followed Brexit referendum (and the fact that it buys all of its products in dollars) put it in financial difficulties.\nThe demise of any business is sad but if Traidcraft fails – and there are around three months to save it – it would be a particular source of regret.\nFor one thing, the company has found itself in its current predicament precisely because it does the right thing. Dealing with small producers in developing countries, it could not pass on the cost of currency fluctuation on to them and had to absorb it itself.\nTraidcraft is also exactly the sort of the company the North East needs, with a distinct national (and international) presence and a deeply ethical mission. But more than anything, what does it say about modern commerce if trading fairly with the developing world can’t translate into a sustainable business plan? When fair trade went mainstream it was something of a double-edged sword. Getting goods sold more widely meant a greater benefit to the producers that fair trade was set up to benefit. But it also meant that mission has become watered down to fit the wishes of some of those big retail players. Read More Gateshead fair trade pioneer Traidcraft at risk of closure\nThe danger of Traidcraft failing is that fair trade-lite becomes the only game in town and we return to a more unfair and exploitative relationship with small producers.\nApart from buying lots of chocolate from its website – and anyone who knows me will know that that is by no means a selfless gesture – I have no answers to Traidcraft’s troubles.\nBut there are plenty of people in the world of North East business with bigger brains than me (hundreds, literally), and if some of them can bring their expertise to find a future for Traidcraft, it is well worth saving.\nGraeme Whitfield is business editor of The Journal Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-28T13:53:00.000+03:00", "crawled": "2018-09-28T14:09:50.001+03:00", "highlightTitle": ""}