{"organizations": [], "uuid": "7479679a3ab0807e96ee67ac9036a6e2f3ba8e41", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article14798623.ece/ALTERNATES/s1200/1_GWR_-NJL_090317johnlewis_01.jpg", "site_section": "http://www.chroniclelive.co.uk/business/rss.xml", "section_title": "ChronicleLive - Business", "url": "https://www.chroniclelive.co.uk/business/business-news/john-lewis-sees-profits-fall-15147436", "country": "GB", "domain_rank": 21960, "title": "John Lewis sees profits fall 99% - and gets into row over Brexit", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-13T15:56:00.000+03:00", "replies_count": 0, "uuid": "7479679a3ab0807e96ee67ac9036a6e2f3ba8e41"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/business-news/john-lewis-sees-profits-fall-15147436", "ord_in_thread": 0, "title": "John Lewis sees profits fall 99% - and gets into row over Brexit", "locations": [], "entities": {"persons": [{"name": "subscri", "sentiment": "negative"}, {"name": "john lewis", "sentiment": "negative"}], "locations": [{"name": "brexit intu eldon square", "sentiment": "none"}, {"name": "eu", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": [{"name": "tony hall photography", "sentiment": "negative"}, {"name": "newcastle", "sentiment": "none"}, {"name": "john lewis & partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Intu Eldon Square (Image: Tony Hall Photography) Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nThe John Lewis Partnership has revealed half-year profits crashed 98.8% as it battled against “challenging times” and the most promotional market for nearly a decade.\nThe owner of the department store chain and supermarket Waitrose posted underlying pre-tax profits of £1.2m for the six months to July 28.\nIt said profits at John Lewis & Partners have continued to be squeezed by strong competition as it moves to keep prices low despite inflation and has offered “unprecedented” levels of price matching through its Never Knowingly Undersold pledge.\nAnd the group reiterated warnings that it continues to expect profits in the full 2018-19 financial year to be “substantially lower”.\nBut the firm also became embroiled in a row with Brexit Secretary after saying that the process of the UK leaving the EU was part of the reason for the firm’s profit fall. Read More Newcastle bowling alley closes - leaving bowlers with just hours to collect their balls\nJohn Lewis Partnership chairman Sir Charlie Mayfield had said that “with the level of uncertainty facing consumers and the economy, in part due to ongoing Brexit negotiations, forecasting is particularly difficult but we continue to expect full-year profits to be substantially lower than last year for the Partnership as a whole.”\nThat led Mr Raab to say: “I think it’s probably rather easy at this moment in time for any business that isn’t doing rather well to point to Brexit.”\nHe added: “I don’t doubt that some of the uncertainty around these negotiations will have an impact on business, that’s why we are putting all our energy into getting the good deal we want with our EU friends and partners.\n“All I am just gently saying is that it’s rather easy for a business to blame Brexit and the politicians rather than take responsibility for their own situation.” John Lewis Partnership MD Charlie Mayfield (Image: PA)\nJohn Lewis - which recently rolled out the & Partners rebrand across the group - had alerted over profits at a strategy update in June, when it also said it would shut another four Waitrose convenience shops and a small supermarket, affecting around 200 staff.\nThe half-year results showed on a statutory basis, pre-tax profits slumped 80.5% to £6m.\nJohn Lewis department stores slumped to an underling operating loss of £19.2m from earnings of £54.4m a year earlier.\nLike-for-like sales at the chain fell 1.2%.\nThis offset a better performance at Waitrose, which remained in profit albeit down 12.2% at £96.4m on an underlying basis. Read More Chinese officials promote international trade during visit to Newcastle\nLike-for-like sales rose 2.6% at the supermarket, thanks to a marked improvement in the second quarter, with the grocery chain on track for a full-year trading profit.\nSir Charlie said the group expects profit growth in Waitrose to continue to be offset by the squeeze at John Lewis.\nBut he pledged to continue with plans to invest in the group - at a rate of £400m to £500m a year - despite the pressures on its profits to drive long-term growth.\n“This will take a lot of hard work from all of our partners, but we are confident in our commitment, drive and ability to deliver the partnership’s strategy,” he said.\nThe chairman also said that the harsh retail climate has been a “test” for the Partnership’s price matching scheme, Never Knowingly Undersold. Read More New office block near Tyne Bridge set to get go-ahead\n“If you think about the value it has in terms of trust with the customer, it’s extremely valuable, has proven to be so over many years. Times like these test the real integrity of that promise.\n“It’s the most transparent market that we’ve ever known, the ability to price compare has never been greater. If you’re a long-term business like ours which has a relationship with the customer, having a commitment to good value and pricing is a foundational point in that.”\nResponding to Mr Raab’s comments later in the day, Sir Charlie said: “This whole thing is so frothy. I didn’t say Brexit was the reason for our result. The fact is sterling is weaker, it’s more expensive to import goods... so we have to absorb that within our margin.\n“I’m not going to get into some sort of ding-dong with the secretary of state for all things EU.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-13T15:56:00.000+03:00", "crawled": "2018-09-13T16:18:15.003+03:00", "highlightTitle": ""}