{"organizations": [], "uuid": "2669770d5821e605884fa52aaa13f73adea063eb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article2047633.ece/ALTERNATES/s1200/0_CapturePNG.png", "site_section": "", "section_title": "", "url": "https://www.leicestermercury.co.uk/news/business/toiletries-maker-reabrook-sold-staff-2047594", "country": "GB", "domain_rank": 48128, "title": "Toiletries maker Reabrook is sold to its staff - Leicestershire Live", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.004, "site_type": "news", "published": "2018-09-26T03:00:00.000+03:00", "replies_count": 0, "uuid": "2669770d5821e605884fa52aaa13f73adea063eb"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/toiletries-maker-reabrook-sold-staff-2047594", "ord_in_thread": 0, "title": "Toiletries maker Reabrook is sold to its staff - Leicestershire Live", "locations": [], "entities": {"persons": [{"name": "north w", "sentiment": "negative"}, {"name": "malcolm watkins", "sentiment": "negative"}, {"name": "andrew bridgen", "sentiment": "none"}, {"name": "tony", "sentiment": "none"}, {"name": "malcolm", "sentiment": "none"}, {"name": "john clarke", "sentiment": "none"}, {"name": "sue watkins", "sentiment": "none"}, {"name": "mary brealey", "sentiment": "none"}, {"name": "david muller", "sentiment": "none"}, {"name": "tony brealey", "sentiment": "none"}, {"name": "heather wheeler", "sentiment": "none"}], "locations": [{"name": "south derbyshire", "sentiment": "none"}], "organizations": [{"name": "reabrook", "sentiment": "negative"}, {"name": "leicestershire live toiletries", "sentiment": "negative"}, {"name": "south derbyshire district council", "sentiment": "none"}, {"name": "invalid email", "sentiment": "none"}, {"name": "leicestershire council", "sentiment": "none"}, {"name": "reabrook contract manufacturing", "sentiment": "none"}, {"name": "reabrook ltd", "sentiment": "none"}, {"name": "north west leicestershire", "sentiment": "none"}, {"name": "reabrook health & beauty", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Toiletries maker Reabrook is sold to its staff Share L-R: Reabrook joint MD Malcolm Watkins, North West Leicestershire Council chairman John Clarke, North West Leicestershire MP Andrew Bridgen, South Derbyshire MP Heather Wheeler, South Derbyshire District Council vice-chairman David Muller, and Tony Brealey, the other joint MD of Reabrook Get Business\nA company that makes toiletries and beauty products has been taken over by its staff.\nTony and Mary Brealey and Malcolm and Sue Watkins, the owners of Moira-based Reabrook Ltd, made the decision to move it to employee ownership to give staff a greater voice in its expansion.\nBoth families continue to help run the 50-year-old business.\nThe move coincides with the opening of a new extension and a new £1.3 million aerosol line.\nReabrook makes private label chemical products under the Reabrook Health & Beauty and Reabrook Contract Manufacturing brands.\nThe contract manufacturing side of the business provides private label products for the automotive, industrial and household markets.\nOn top of that it has in-house brands Arrow Solutions – which supplies the UK and International markets with cleaning and maintenance products – and Nielsen Chemicals which makes valet and automotive care products for a network of distributors in the UK and 40 countries around the world. Reabrook in Moira\nReabrook employs 200 people and had a turnover of more than £23 million in 2016.\nJoint managing director Tony Brealey said: “We firmly believe that empowered and engaged employees, who care deeply about the products they make, are vital to a company’s ongoing success.\n“Employee ownership is the perfect way to reward our loyal staff and to secure the long-term future of the Moira site.\"\nReabrook marked the changes with a VIP visit to its Rawdon Road site which saw the new aerosol building opened by South Derbyshire MP Heather Wheeler and here North West Leicestershire colleague Andrew Bridgen .\nThey also visited Boothorpe Wood, part of The National Forest , where Reabrook had sponsored the planting of 42,000 trees. Read More Highcross Leicester 'surprised' at sudden closure of Mem-Saab restaurant\nThe celebrations culminated with the owners Tony and Mary Brealey and Malcolm and Sue Watkins completing the transfer of the ownership of the company to its employees.\nMalcolm Watkins, the other joint managing director, said employee ownership fitted Reabrook’s philosophy of building a workforce that takes pride in what it does and is responsive to its customers’ needs. Read More Enderby based Next reveals biggest risk to business in case of no-deal Brexit\nAccording to the Employee Ownership Association, the number of employee-owned businesses in the UK is currently growing at an annual rate of 10 per cent and is a key part of the government’s recommendations for improved corporate governance.\nThe company started in 1968 as Arrow Chemicals, based in Swadlincote, supplying a range of liquid products for the industrial market.\nThe business has grown over the years to fill products into aerosols and tubes as well as conventional liquid packaging - supplying a wide range of markets from oil, gas and automotive through to haircare and toiletries.\nInvestment in a larger aerosol manufacturing facility and new filling line is essential to achieve this growth.\nHSBC provided the finance for the aerosol production line and a £1 million loan for the transition to employee ownership to take place.\nRoger Pratt, HSBC’s area director in East Midlands, said: “HSBC UK is innovating to meet evolving customer expectations and needs.\n“Reabrook is on an exciting journey at the moment and we wanted to support the business as it looks to fulfil its growth ambitions and the successful integration of its new employee owned trust.\n“We wish everyone at the business the best of luck as they celebrate Reabrook’s 50th birthday.” Like us on Facebook", "external_links": [], "published": "2018-09-26T03:00:00.000+03:00", "crawled": "2018-09-27T05:43:18.001+03:00", "highlightTitle": ""}