{"organizations": [], "uuid": "1ec1a8121a53c3aafd6b91d881f689aabf4fbbdb", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/incoming/article1769439.ece/ALTERNATES/s1200/north-side-3.png", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/plans-new-retail-park-police-2038531", "country": "US", "title": "Plans for new retail park at police HQ in Exeter set to be refused", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-24T17:22:00.000+03:00", "replies_count": 0, "uuid": "1ec1a8121a53c3aafd6b91d881f689aabf4fbbdb"}, "author": "Daniel Clark", "url": "https://www.devonlive.com/news/devon-news/plans-new-retail-park-police-2038531", "ord_in_thread": 0, "title": "Plans for new retail park at police HQ in Exeter set to be refused", "locations": [], "entities": {"persons": [{"name": "daniel clark", "sentiment": "none"}], "locations": [{"name": "exeter", "sentiment": "none"}, {"name": "middlemoor", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "devon", "sentiment": "none"}], "organizations": [{"name": "mcdonald", "sentiment": "none"}, {"name": "hammerson", "sentiment": "none"}, {"name": "cornwall police", "sentiment": "none"}, {"name": "office of the police", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Plans for new retail park at police HQ in Exeter set to be refused Planners are not happy that the current lay out would be able to handle extra traffic Share Daniel Clark Local Democracy Reporter 15:22, 24 SEP 2018 Click to play Tap to play The video will start in 8 Cancel Play now\nFears that Exeter’s fragile transport network will be unable to cope with a new retail park on land at Devon and Cornwall Police's Middlemoor HQ has led to planners recommended it be refused.\nAn eight-acre plot of land is set to be turned into eight new retail units along with three food and drink restaurants with drive-through facilities, and a gym is also proposed along with 417 car park spaces and toilet facilities.\nThe application has been submitted by Hammerson, one of Europe’s largest retail property developers and the Office of the Police and Crime Commissioner, and if approved the development would help fund a new criminal justice centre and police hub that is currently being built at Middlemoor. Read More New retail park plans for Exeter include McDonald's, Next, a supermarket and a gym\nBut Exeter City Council planners, when they meet next Monday night, are being recommended to refuse the application as the proposed access to the site, off a new fifth arm to the Honiton Road/A3015/Wilton Way roundabout, will result in a severe impact on the local highway network in terms of its capacity and safety. Read More Council news\nPlans for the new criminal justice centre and police hub have previously been approved, which also included a Morrisons superstore, although in 2015 they chose not to progress with the development.\nThere is an existing planning consent for a five-spur roundabout in Wilton Way as a result of the previous Morrisons application that could be proceeded with if the discussions, which are being held this week between Devon County Council’s highways officers, Exeter City Council and the office of the police and crime commissioner to resolve the issues, fail. Wilton Way roundabout (Image: Google)\nBut council officers in their report to the planning committee also say that there is no evidence that the previously permitted reconfiguration of the roundabout can actually be delivered under current traffic levels, there is inadequate pedestrian/cycling facilities and no Road Safety Audit, and the applicants have not provided finance to upgrade a bus service as part of mitigation for the air quality impacts the application would have.\nA whole range of statutory consultees though have objected to the proposals in their current form. Read More Exeter's Homebase store looks like a scene from the Walking Dead ahead of next week's closure\nDevon County Council’s Highways department said that the proposed access by a five-arm roundabout and the absence of any Road Safety Audit does not form a safe and suitable access to the development, the cumulative effects of the roundabout are classed as severe, and there is no information regarding walking and cycling access points.\nBut a transport statement submitted by the applicants said that ‘in transport terms there are no significant impacts, let alone “severe” impacts’. The shops that could be coming to Middlemoor if plans are approved\nIt added that the design of the roundabout has been altered from the previously approved design submitted with the Morrisons planning application, in order to provide a more compact roundabout solution.\nSport England and the Football Association have also objected due to the loss of playing field land used for cricket and youth football. Read More B&Q is in trouble as profits and shares fall - and it's blaming Brexit\nExeter City Council’s Environmental Health office has objected as the applicant has provided no mitigation for the increase in vehicle movements and pollution other than six electric vehicle charging points.\nAn objection was also received from East Devon District Council as any approval for a bulky goods retail uses and the proposed food could be accommodated within Cranbrook town centre and so it is a sequentially preferable location, adding: “The development is likely to have a significant detrimental impact on Cranbrook town centre contrary to national planning guidance.” How the retailers might line up at Middlemoor\nBut a planning statement submitted with the application said: “The proposal has been designed to primarily meet the business model requirements of national multiple bulky goods retailers in the furniture, furnishings and homewares sectors. Other bulky goods retailer interest may come from the hobbies, sports, and toys sectors.\n“The site is in an out of centre location and is not allocated for retail development albeit, as noted, it already has permission for retail development in the form of the extant foodstore consent. Read More All the shops and restaurants we have lost in Exeter so far this year\n“The retail assessment has also shown that there is no other existing, committed or planned investment in any town centres, including the city centre, that would be significantly adversely impacted by the application proposals.”\nThe development will involve the demolition of all existing buildings on the site which includes three buildings used for police operational and training purposes and the private four pump filling station. An artists' impression of what Middlemoor Retail Park would look like\nThe planning application states: \"The application proposals represent a proposed investment of over £40m by Hammerson in Exeter.\n\"The development will add to the choice of retail and leisure facilities and will help to meet the retail and leisure needs of the city’s growing population. Read More Devon's 14 worst, most pointless and downright annoying roundabouts\n\"The proposals will further support the sustainable growth of the city because the sale of the application site to Hammerson will assist the Devon and Cornwall Police and Crime Commissioner to fund the development of the much needed new criminal justice centre and police hub that is under construction in the southern part of the police headquarters complex at Middlemoor.\"\nExeter City Council’s planning committee meets on Monday, October 1, to consider the application. Read More\nThe application is one of six retail schemes currently set to go before council planners. Video Loading Click to play Tap to play The video will start in 8 Cancel Play now\nThe other schemes still on the table are: the redevelopment of Western Power Distribution's site off Honiton Road seven shopping units to be built on the site of the B&Q superstore at Avocet Road, along with cafes and restaurants plans at the Moor Exchange on Honiton Road that would include Next, M&S Simply Food, Boots, a drive-through McDonalds, a drive-through Costa, a yet-to-be-named discount food retailer, a post office, a newsagent, a bank, a gym, a restaurant, a hot food takeaway unit and a shop. a non-food retail unit on land at the Tesco overspill car park in Russell Way. the division of the closed Toys R Us store into two units Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-09-24T17:22:00.000+03:00", "crawled": "2018-09-24T17:35:29.002+03:00", "highlightTitle": ""}