{"organizations": [], "uuid": "34319d9b2ab494361f2d37fd8e9ee9abd708873d", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article11036691.ece/ALTERNATES/s1200/JS84996962.jpg", "site_section": "http://www.thejournal.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15165579", "country": "GB", "domain_rank": 21960, "title": "Business Breakfast LIVE: Property giant Grainger signs £52m construction contract", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-18T10:05:00.000+03:00", "replies_count": 0, "uuid": "34319d9b2ab494361f2d37fd8e9ee9abd708873d"}, "author": "Coreena Ford", "url": "https://www.chroniclelive.co.uk/business/business-news/north-east-business-news-live-15165579", "ord_in_thread": 0, "title": "Business Breakfast LIVE: Property giant Grainger signs £52m construction contract", "locations": [], "entities": {"persons": [{"name": "grainger", "sentiment": "negative"}, {"name": "coreena ford", "sentiment": "none"}], "locations": [{"name": "newbury good", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "ocado", "sentiment": "none"}], "organizations": [{"name": "newcastle", "sentiment": "negative"}, {"name": "business grainger plc", "sentiment": "negative"}, {"name": "grainger plc", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "northgate", "sentiment": "none"}, {"name": "jardine lloyd thompson group", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Coreena Ford Companies invited to pitch for Heathrow expansion work\nDozens of companies have been invited to put forward ideas on how to deliver the expansion of Heathrow, the airport has announced.\nMore than 150 submissions have been made covering sustainability, retail and other areas as Heathrow gears up to build a new runway.\nMore than 86% of the expressions of interest came from companies outside Heathrow’s current supply chain.\nA list of 37 companies has been compiled to progress to the next round, with eight weeks to bring forward business cases to pitch to the airport’s top executives.\nEmma Gilthorpe, executive director of Heathrow Expansion said: “Parliament has entrusted us with the job of delivering Britain’s new runway, in a way that benefits the whole of the country and our neighbours.\n“These are steadfast commitments we place on ourselves also.\n“Our Innovation Partner Process is further evidence of us wanting to work with anyone who wants to legitimately challenge our way of thinking and work with us.” A plane taking off from Heathrow Airport (Image: PA) 9.00 Coreena Ford Historic Quayside building to be turned into hotel and bistro\nA prime plot on Newcastle Quayside is poised for a new lease of life as a boutique hotel and bistro, plans reveal .\n46 Sandhill has stood on the Quayside since the 1700s but for the last two years it has lain empty following the closure of Whosit and Whatsit, a retail shop for North East independent artists and designers.\nNow, however, the four-storey listed building is set to be turned into No. 46 Boutique Hotel and Bistro, complete with 10 boutique bedrooms, a bar, three secret gardens, a pavement cafe and meeting room.\nInterior designer Simon Bartlett has been enlisted to apply for permission to carry out alterations inside and out on behalf of the Gateshead applicant Elaine Muir, with documents submitted to the council stressing no historic features will be lost.\nProposals for No 46 show how the hotel would be decorated and how outside areas would be just as import in its overall design.\nA concept menu for its Italian-style bistro is also included.\nThe plan is to create a bar area on the lower ground floor, a bistro and kitchen on the ground floor and 10 bedrooms on the first, second and third floors. The Quayside building which could be transformed into No. 46 Boutique Hotel & Bistro (Image: newcastle city council planning site - Simon Bartlett) 8.47 Coreena Ford Most part-time workers feel isolated, study finds\nMost part-time workers feel isolated, less up to date with developments at their company and have lost confidence, a study shows.\nA survey of 1,700 part-timers also found most feel they have fallen behind full-time colleagues in terms of skills and knowledge.\nTimewise, which promotes flexible working, said its research should be a “real cause for concern” for business.\nLimiting the ability of part-time staff to develop their skills and connections reduced the value they could add to their employers, said the report. Timewise founder, Karen Mattison, said: “The workforce has changed but the workplace has not caught up.\n“Much of working culture is still rooted in the 5-day 1950s model, with a lack of flexibility around when meetings, training and networking take place - leaving part-time workers isolated.\n“With as few as 6% of people thought to work a traditional 9-5, we have a strong mandate for change. Part-time and flexible aren’t the future of work. They are the now.” A survey of 1,700 part-timers found most feel isolated (Image: Getty Images/iStockphoto) 8.41 What's the FTSE latest?\nThe FTSE-100 index at 8:15am was down 14.36 at 7287.74.\nThe pound at 8am was 1.3151 dollars compared to 1.3144 dollars at the previous close. The euro at 8am was 0.8896 pounds compared to 0.8892 pounds at the previous close. London Stock Exchange (Image: PA) 8.40 Coreena Ford Record year for PwC's Newcastle office\nThe senior partner for PwC’s Newcastle office has hailed a record year for the accountancy giant’s regional team.\nThe professional services firm has unveiled its financial performance for the year ended June 2018 in which it saw growth across all four of its business divisions – a national picture which Newcastle senior partner Jonathan Greenaway said was mirrored at a local level.\nThe firm posted revenue of £3.76bn for the year ended 30 June 2018, up 5% from £3.60bn last year, as it continued to invest in people and technology across the UK to support its clients.\nMr Greenaway, PwC’s Newcastle Office senior partner, said: “It’s been a very strong year – a record year for us in Newcastle.\n“The assurance and audit division has done very well with a number of big wins including Utilitywise, and from a corporate finance point of view we’ve seen strong performance, advising, for example, on the sale of Wear Inns.\n“And we continue to recruit heavily. Our numbers are pretty consistent, and when you think of the investment in technology it’s pleasing for me that we invest as heavily as we do in local talent. That is the biggest challenge for us really, to keep them at PwC and in the North East.” Jonathan Greenaway, PwC's Newcastle office senior partner (Image: Mike Smith Photography) 8.35 Coreena Ford Northgate continuing strong growth in UK and Ireland and Spain\nDarlington’s Northgate Plc holds its AGM later today and ahead of the meeting the light commercial vehicle hire has posted a trading update for the period from 1 May 2018 to 31 August 2018.\nThe group said it has performed in line with expectations in the first quarter of its full year 2019, with vehicles on hire growth coming in 12% higher than last year in the UK and Ireland and 14% up in Spain.\nGrowth in hire vehicles and rental margins in both the UK and Ireland and Spain remain on track to meet guidance for the full year, the firm said.\nShortly after the end of the quarter the Group agreed a £50m extension of its revolving credit facility, to increase financial headroom. Northgate Plc's vans KEY EVENT Fears for North East automotive sector after Jaguar Land Rover moves to three-day week\nFears have been expressed for the outlook of the North East automotive industry after the country’s biggest car maker moved staff to a three-day week.\nUnions fear the livelihoods of automotive workers in the North could be put at risk by Jaguar Land Rover’s (JLR) decision to lower production.\nJLR is cutting production at its Castle Bromwich site, in Birmingham, and moving its workers to a three-day week until Christmas.\nThe car giant’s decision came after its chief executive Prof Ralph Speth warned that job losses could hit the UK’s automotive sector if the UK goes ahead with a no-deal Brexit.\nA slump in people buying diesel cars has also forced the move.\nWhile the move will directly affect staff working at JLR’s manufacturing plant, Unite has warned that the decision could also impact workers in North East automotive firms.\nUnite assistant general secretary Tony Burke said: “When we have a major manufacturer of cars deciding to go to a three-day week in the run up to Christmas, it will have an impact on the supply chain. The North East has a big supply chain and a lot of companies who supply parts to JLR, and it could have an impact on Unite members working in that supply chain.” Jaguar cars on the production line at Jaguar Castle Bromwich factory, Birmingham (Image: Birmingham Post and Mail) 8.20 Coreena Ford Ocado hails warehouse success but sees sales growth slow\nOnline grocer Ocado has posted a slowdown in retail sales growth, but hailed the success of its newest warehouse after it notched up 20,000 orders since opening.\nThe group said retail revenues rose 11.5% over its third quarter to September 2, which marks a slowdown on the 11.7% growth seen in its first half.\nDespite the slight pull back on growth, Ocado said it remained within its predicted growth range for the full year of between 10% to 15%. Average total orders per week rose by 11.4% to £283,000, with the average value of customer orders staying largely flat at £106.26.\nIt cheered a good performance from its newest state-of-the-art warehouse in Erith, south-east London, which it said had processed more than 20,000 customer orders in the first 14 weeks since launch.\nIt said this took its other recently opened site in Andover, Hampshire, 15 months to achieve.\nErith has the potential to become the largest automated warehouse for online grocery in the world, at full capacity, the firm added.\nHe added the group was on track to deliver a raft of new robotic warehouses for retailer partners over the coming years.\nThe group, which works with Morrisons in the UK, has recently announced long-awaited international deals, which has sent its shares soaring. Ocado provides the technology to its partners to allow them to take their services online.\nAnd North East firm Tharsus has helped the firm in its warehouse success - the Blyth firm makes robots for Ocado, amongst its many other customers.\nThe technology, known as the Ocado Smart Platform, is an automated system for packing orders in warehouses, which is operated by robots. But Ocado has recently warned that investment in the new warehouses and technology behind its automated systems will hit earnings this year, with spending set to surge to £210 million. Ocado's Customer Fulfilment Centre in Hatfield 8.10 Coreena Ford Spire blames NHS admissions drop for profits slump\nSpire Healthcare Group has blamed an “unprecedented” drop in its NHS patient count for a slump in half-year profits.\nSpire Healthcare Group has reported a 7.9% drop in pre-tax profits to £8.2m for the six months to June 30, while underlying earnings tumbled 20.6% to £66.1m.\nRevenue also suffered, falling 1.1% over the period to £475.6m.\nSpire said its performance was due to “significantly declining NHS admissions, lower than anticipated growth in private admissions and planned investment in clinical quality and consumer engagement”.\nThe healthcare group last month warned that it expected underlying earnings for the full financial year to be “materially lower” than a year earlier. It is now forecasting underlying earnings to be in the range of £120m to £125m, after charging non-recurring items of approximately £5m.\nChief executive Justin Ash said: “The unprecedented decline (both in scale and speed) in NHS admissions has led to Spire having to announce disappointing H1 2018 results and a revised outlook for the financial year as a whole.\n“Nonetheless our overall revenues are broadly flat as the growth opportunity in our private business, 2.5% in the period, continues to support our shift in strategic focus.” Justin Ash, chief executive, Spire Healthcare 8.05 KEY EVENT Newcastle property giant Grainger signs £52m construction contract\nNewcastle’s Grainger plc, the UK’s largest listed residential landlord, has appointed Engie Regeneration Ltd as the main contractor to its £52m scheme to create a a new ‘urban village’.\nThe firm first announced plans for a build-to-rent development last year on land close to Newbury railway station – a Berkshire market directly linked to London by rail.\nThe scheme will deliver 232 new homes for rent and improved pedestrian access from Newbury train station to the town centre - and forms part of the firm’s mission to become the UK leader in providing private rented homes.\nConstruction on the scheme, being developed by Grainger in partnership with West Berkshire Council and Network Rail, is expected to begin before the end of this calendar year and complete in 2021.\nThe signing of the construction contract at Newbury signifies an increase to Grainger’s secured PRS investment pipeline by £61m.\nGrainger expects this scheme to generate a gross yield on cost in excess of around 6.25% once stabilised.\nIt said Newbury is an attractive location for investment due to its strong employment and well serviced transportation links and with major improvement works underway by Network Rail.\nHelen Gordon, chief executive of Grainger, said: “ We are pleased to announce this key milestone for our Newbury PRS scheme, which increases our secured investment pipeline to over £800m.\n“This scheme will deliver 232 high quality new homes for rent to Newbury, and it will significantly improve the gateway to Newbury and connection to the railway station and station amenities.” Helen Gordon, CEO of Grainger plc More On", "external_links": ["https://livecentreps-eb-prod.tm-awx.com/v1/live-centre/regionals-live/15165579;", "https://www.facebook.com/groups/336954976787763", "https://livecentreps-eb-prod.tm-awx.com/"], "published": "2018-09-18T10:05:00.000+03:00", "crawled": "2018-09-18T10:12:44.027+03:00", "highlightTitle": ""}