{"organizations": [], "uuid": "fd7c18ccfce2fa13ac27e80f0b487ed06cbae1a0", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article10460999.ece/ALTERNATES/s1200/JS65895006.jpg", "site_section": "http://www.chroniclelive.co.uk/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/business/most-influential-2018-stot-15140994", "country": "GB", "domain_rank": 21960, "title": "Most Influential List 2018: The movers and shakers from S to T", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-14T02:01:00.000+03:00", "replies_count": 0, "uuid": "fd7c18ccfce2fa13ac27e80f0b487ed06cbae1a0"}, "author": "Graeme Whitfield", "url": "https://www.chroniclelive.co.uk/business/most-influential-2018-stot-15140994", "ord_in_thread": 0, "title": "Most Influential List 2018: The movers and shakers from S to T", "locations": [], "entities": {"persons": [{"name": "roy sandbach", "sentiment": "none"}, {"name": "hari shukla", "sentiment": "none"}, {"name": "bruce shepherd", "sentiment": "none"}], "locations": [{"name": "north east england", "sentiment": "none"}, {"name": "north east", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "gamble", "sentiment": "none"}, {"name": "procter", "sentiment": "none"}], "organizations": [{"name": "newcastle university’s national innovation centre for ageing", "sentiment": "none"}, {"name": "ageing science and innovation", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "lep innovation board", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Get business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nWelcome to the 2018 edition of The Most Influential People in the North East.\nWe have homed in on those individuals who really have the capacity to shape the future of the North East.\nIn this section we feature Bruce Shepherd, Owner of Shepherd Offshore in Newcastle and Multicultural ambassador Hari Shukla.\nThe entries are not intended to be exhaustive biographies and will not cover all of the person’s roles and responsibilities. Time Line Most Influential 2018: S-T PROFESSOR ROY SANDBACH Professor of Practice in Ageing Science and Innovation, Newcastle\nFormerly the director of Newcastle University’s National Innovation Centre for Ageing, he remains engaged with the university, and is an influential North East business figure. He developed the regional innovation strategy for North East England and was founding chair of the North East LEP Innovation Board. He spent three decades at Procter and Gamble and holds several applied patents. Prof Sandbach is President of the Royal Society of Chemistry Industry and Technology Council. He is also a trustee at the Centre for Life in Newcastle and was awarded an OBE in 2017 for services to science, innovation and skills. NEIL SCHNEIDER Chief executive, Stockton-on-Tees Borough Council\nMr Schneider has held a variety of roles in a local government career spanning 32 years. Neil was appointed as the council’s chief executive in 2008 and is chair of the Tees Valley European funding sub-committee. He also has extensive experience in the development and delivery of leadership training programmes for a wide range of private and public sector organisations. BILL SCOTT Chief executive, Wilton Engineering, Middlesbrough\nMr Scott has built Wilton Engineering Services from scratch in 1994 to an £85m turnover business providing fabrication and site support to the offshore and petrochemical sectors. He has a passion for supporting young people through apprenticeships and further education, including degree level, mentoring small to medium enterprises, and is an avid patron of the Middlesbrough and Teesside Philanthropic Foundation and a prolific fundraiser for many good causes. JOHN SEAGER Chief executive, Siglion\nPreviously with regionally based property company UK Land Estates, Mr Seager is now the chief executive of Siglion, a joint venture with Sunderland City Council to carry out Sunderland’s largest ever regeneration project at five major sites: the former Vaux Brewery, Seaburn and Chapelgarth, Farringdon Row and Numbers Garth. In addition, Siglion now owns an investment portfolio of 100 industrial, retail and office properties with around 700 tenancies. ADAM SERFONTEIN Managing director, Hanro Group, Newcastle\nHanro is one of the region’s largest privately owned property investment companies founded in 1921 and with a portfolio valued in the order of £170m. Mr Serfontein spent 12 years with Chesterton Property Consultants working in Newcastle, London and Madrid, before joining the Hanro Group as the managing director. Among his outside roles, he is chairman of Newcastle NE1 Limited, the North East judging panel for the RICS Awards North East and Developing Consensus. BRUCE SHEPHERD Owner, Shepherd Offshore, Newcastle\nThe family-owned business specialises in oil and gas, subsea, offshore renewables and land and property development, and owns the Offshore Technology Park and Neptune Energy Park on the north bank of the River Tyne. Shepherd Offshore has been instrumental in creating 3,500 jobs on the north bank of the Tyne. Mr Shepherd – who was awarded an OBE in 2016 - ran the company with his brother Freddy until his death in 2017. LORD SHIPLEY of GOSFORTH House of Lords, London and Newcastle\nJoined the House of Lords in 2010 after an influential political career which saw him serve on Newcastle City Council for 36 years. He was council leader from 2006 to 2010, and a board member of the former regional development agency One North East. He was the Liberal Democrat Lords principal spokesperson for communities, decentralisation and the Northern powerhouse until the end of 2015, and among posts he currently holds he is vice president of both the Local Government Association, and the National Energy Action Advisory Board. HARI SHUKLA Multicultural ambassador, Newcastle\nThe veteran race relations campaigner has fought for racial and religious harmony in Newcastle for over four decades. During that time he has worked tirelessly to build bridges between the city’s diverse communities. He has been director of Tyne and Wear Racial Equality, chair of the inter-faith sub-committee of the Tyne and Wear Racial Equality Council, and been involved in a number of charities and held dozens of voluntary roles. The holder of the OBE, MBE and CBE, in January 2018 he was named Tyne and Wear Archives and Museums Ambassador for Diversity and Inclusion. AMANDA SKELTON Chief executive, Redcar and Cleveland Borough Council\nAwarded a CBE in the Queen’s 2018 New Year’s Honours list for services to the Redcar and Tees Valley economy, Ms Skelton has celebrated her 10th anniversary as Redcar and Cleveland’s chief executive, where she has led a major programme of regeneration. Since 2015, she has chaired the Government’s Task Force set up to respond to the closure of SSI. She has played a leading role in negotiating the Tees Valley devolution deal, establishing the Tees Valley Combined Authority and the creation of the South Tees Development Corporation. DAVID SOLEY Chairman of Camerons Brewery, Hartlepool\nFounded in 1865 in Hartlepool by John Cameron, the brewery lost its independence in 1974 and went through a succession of owners before being bought back into family control in 2002 by David Soley of Castle Eden Brewery. Under his guidance, it now runs a growing portfolio of more than 70 pubs across the UK, including The Head of Steam, selling the bottles and keg beers and ales brewed at its historic Lion Brewery site. RAY SPENCER Executive director, Customs House, South Shields\nThe Customs House opened its doors in 1994 and delivers an eclectic programme of live performance productions, visual arts, cinema and projects. Mr Spencer was appointed chief executive in 2000 and the venue continues to put on top rated shows and attract some of the biggest names in entertainment. He was awarded an MBE in 2010 for services to North East arts and is an honorary fellow of the University of Sunderland. He acts, directs and writes and is chair of the Chloe and Liam Together Forever Trust. IAN STARK Chief Executive, Chemoxy International, Middlesbrough\nChemoxy is one of the region’s largest chemical companies, and it was acquired by Mr Stark – who has 36 years’ experience in the chemical industry - and chief operating officer Martyn Bainbridge in a management buy-out in 2011, increasing profitability. The firm was sold to French multi-national Novacap SAS in July 2017, the acquisition seen as an opportunity to further extend Chemoxy’s growing customer base and access to new markets. PHIL STEELE General Manager, intu Eldon Square, Newcastle\nIntu Eldon Square hosts 70% of Newcastle’s prime shops – including Fenwick, John Lewis and Debenhams - among its 120 stores and has an annual footfall of 38m. Mr Steele became general manager in 2010, having come from Sunderland’s Bridges Shopping Centre where he had spent a decade in charge. intu Eldon Square, which opened in 1976, is the retail heart of Newcastle and recently underwent a £230m refurbishment and redevelopment that includes the £25m Grey’s Quarter restaurant hub with its 20 dining outlets. PETER STEPHENSON Executive chairman, Able UK, Billingham\nMr Stephenson is a prominent figure in the Northern business community, running Able UK, a multi-functional business providing solutions for some of the world’s largest organisations, including decommissioning and as a provider of multi-user port facilities, as well as vehicle storage and distribution. Work is about to finish on the scrapping of the 425-ft tall, 24,000 tonne ‘topside’ of Shell’s Brent Delta oil rig, for which a special £28m quay was built, potentially offering 30 years of work for the area. GISELLE STEWART Director, UK corporate affairs, Ubisoft, Newcastle\nAway from her work at Ubisoft, Ms Stewart is passionate about the join-up between education and industry. She sits on the Games Council at Creative Skillset, an employer steering group member guiding the NextGen Skills Academy in identifying qualification gaps as new roles emerge in games, VFX and animation. She is on the boards of TIGA, the games’ developers’ trade association, the Creative Industries Federation, and Durham University’s Department of Computer Science’s External Advisory Board. She is also vice-chair of Dynamo NE and a trustee of NorthEast Futures. She was awarded an OBE in 2015 for her services to the games industry. SARAH STEWART Chief executive, NewcastleGateshead Initiative, Gateshead\nMs Stewart has led the team at NewcastleGateshead Initiative since 2010 in its award-winning work to promote the area nationally and internationally to leisure and business visitors and inward investors. Recent work has included Great Exhibition of the North and Ms Stewart has strengthened the organisation’s mandate, developed new funding streams, and maintained strong private-sector commitment from over 170 partners. She holds non-executive positions with Visit England, Arts Council North, Beamish Museum, Newcastle Cathedral, and Newcastle University. She was awarded an OBE in the 2016 for services to the North East’s economy. MARTIN SWALES Chief executive, South Tyneside Council, South Shields\nMr Swales is responsible for an annual turnover of £631m and 5,000 staff. In partnership with Sunderland City Council, he continues to drive the delivery of the International Advanced Manufacturing Park. Regionally, he is principal adviser to Newcastle International Airport Board and has lead officer responsibility for the £8.4bn Tyne and Wear Pension Fund. Nationally, Mr Swales is economic prosperity and housing spokesperson for the Society of Local Authority Chief Executives, and plays a lead role in the North East’s relationship with the Department for International Trade. HARRY SWAN Managing director, Thomas Swan and Co Ltd, Durham\nMr Swan is the fourth generation of his family to work at the chemical manufacturing firm. He graduated from Durham University with a degree in plant sciences and began his working life as the scientific affairs manager of Monsanto Plc. He joined Swans in 2002 to launch the new Carbon Nanomaterials Business. The winner of the prestigious 2017 Carbon Industry Award, he is a non-executive director of the UK Chemical Industries Association and sits on the Chemistry Growth Partnership steering committee. In 2014, he was appointed chairman of the Advisory Board of the Centre for Industry Education Collaboration. RICHARD SWART Global Operation Director, Berger Group, Peterlee\nMr Swart joined metal ring closure specialist Berger in Peterlee in 1988 and was appointed chief executive in 2009. Named in the elite Manufacturer’s Top 100 Report as one of the UK’s most inspiring company leaders, he has supported the global ambitions of hundreds of businesses, and is a committed ambassador for his adopted North East. He is chairman of international trade with the North East England Chamber of Commerce, the UK and European correspondent for Power FM Radio South Africa, and a board director of international relations for the South African Chamber of Commerce UK. CAROLINE THEOBALD Managing director, Bridge Club, Newcastle\nMs Theobald has been running the Bridge Club networking organisation since 2000 and is one of the best connected people in the North East. She sits on the board of several early-stage and growing companies, and is the chair of both the North East Initiative on Business Ethics and International Newcastle CiC. Ms Theobald has been Honorary Consul for Sweden since 2007 and the chairman of the North East Chapter of the Swedish Chamber of Commerce since 2010. She was awarded a CBE in 2016 for services to business and entrepreneurship. MARK THOMPSON Managing partner, Ryder Architecture, Newcastle\nMr Thompson has ultimate responsibility for the strategic development of Ryder, which has been responsible for some of the region’s most high-profile schemes in recent years. He joined Ryder in 1988, qualified as an architectural technician, went on to study project management and business studies at Newcastle University, and became a partner in 1995. Mr Thompson was made an Honorary Fellow of the RIBA in 2003, and is on the boards of the NewcastleGateshead Initiative and the North East LEP. He is also on the CBI’s regional council and is chair of North East-based blood cancer charity Bright Red. SANDRA THOMPSON Head Partner, Ernst and Young, Newcastle\nMs Thompson took over as head partner in July 2017, having earlier worked out of the firm’s London office as UK audit leader for entrepreneurial and fast growth businesses. Originally from Northumberland, she started work as an apprentice with a small accountancy practice in the North East after leaving school at 16, before moving to Touche Ross (now Deloitte) and being headhunted by PwC. Ms Thompson is a non-executive member of the finance and investment committee of the Elton John AIDS Foundation, an active volunteer at the Newcastle-based The People’s Kitchen, and on the North East LEP’s Business Growth Board. BRIAN THORPE Head of Business and Corporate Banking, North East, Barclays\nMr Thorpe has been responsible for running Barclays’ commercial banking teams across the North East since 2009. His career includes working in risk management, retail sales, leadership, and relationship banking, and he headed up the UK and European team within Barclays Commercial Bank for the football sector. Mr Thorpe works hard to ensure clients can develop relationships with key professional bodies and groups, such as the CBI, IoD, North East Entrepreneurs’ Forum, and the North East England Chamber of Commerce. ANNE-MARIE TREVELYAN Conservative MP, Berwick-Upon-Tweed\nThis is Ms Trevelyan’s second term in Parliament after taking the constituency Tory following the retirement of former Lib Dem incumbent Sir Alan Beith in 2015. She has been a vocal campaigner on a number of issues affecting Northumberland, including the duelling of the A1, along with getting superfast broadband into all the county’s homes, helping the UK get a fair Brexit deal, and bringing investment to north Northumberland. An accountant by training, she has previously sat on Parliament’s influential Public Accounts Committee, and is Parliamentary Private Secretary to Ministers in the Ministry of Defence. FERGUS TRIM Director, Broadoak Asset Management, Newcastle\nMr Trim set up Broadoak in 2014, working primarily with New York-based Cerberus Capital Management on various assets, including the 1m sq ft Quorum Business Park in Newcastle and Maxim, a 750,000sq ft office park near Glasgow. Quorum is now one of the most successful business parks in the UK, and supports around 6,000 jobs. It has won numerous accolades, including the Business in the Community award presented by Prince Charles. Mr Trim is on the regional CBI council and is also closely involved in Developing Consensus, the North East property sector member group. ANNA TURLEY Labour MP for Redcar\nBefore becoming an MP, Ms Turley worked for more than 10 years as a public servant seeking to tackle social exclusion, poverty and worklessness. Under the last Labour government, she was part of the team that brought in the Family Nurse Partnership scheme, as well as programmes for adults with severe challenges around substance abuse, homelessness and exclusion. Ms Turley was a vocal campaigner in the fight to keep Redcar’s SSI plant open and campaigns on local issues such as regenerating local high streets and opposing unsustainable housing development. She currently sits on the Business, Energy and Industrial Strategy Committee. PROFESSOR SIR DOUG TURNBULL Professor of Neurology, Newcastle University\nProf Turnbull has devoted his career to the treatment and research of devastating mitochondrial disease, for which he has been recognised with a knighthood. He started work in 1976 as a junior doctor, and since then has made the understanding of mitochondrial disease his life’s work. This was acknowledged in 2012 when he and his colleagues were awarded the coveted Wellcome Trust Centre status. Prof Turnbull has built an internationally renowned team of clinicians and researchers, with patients opting to travel from all over the country to be under his care. PROF JANE TURNER Pro Vice-Chancellor, Teesside University, Middlesbrough\nProf Turner is responsible for all knowledge exchange activities at the university, as well as student and graduate start-ups, strategic partnerships and the employability of graduates. Prof Turner came to Teesside in 2015 from Northumbria University, where she had been the associate dean in the Faculty of Business and Law. She was recently named one of the most powerful and influential women in the region in the Northern Power Women Power List 2018. Awarded an OBE in 2017 for her services to business engagement, she is on the board of the South Tees Development Corporation. LIZ TWIST Labour MP for Blaydon\nA first time MP, Ms Twist replaced Dave Anderson in the 2017 General Election. The former regional head of health union Unison, she was a Gateshead councillor for the Ryton Crookhill and Stella ward before entering Parliament. Jobs, the NHS, education, housing, the environment, and dignity for people needing care are all important areas for her, and she has pledged to fight for public services. She currently sits on both the Petitions and European Statutory Instruments Committees. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-14T02:01:00.000+03:00", "crawled": "2018-09-14T04:57:18.011+03:00", "highlightTitle": ""}