{"organizations": [], "uuid": "ad011ce379e6bb19e2fac9d268c7ac020c918b64", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15148808.ece/ALTERNATES/s1200/0_PMQs.jpg", "site_section": "http://www.thejournal.co.uk/?service=rss", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/mps-maternity-leave-allowed-cast-15148602", "country": "GB", "domain_rank": 21960, "title": "MPs on maternity leave will be allowed to cast 'proxy votes'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-13T18:37:00.000+03:00", "replies_count": 0, "uuid": "ad011ce379e6bb19e2fac9d268c7ac020c918b64"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/mps-maternity-leave-allowed-cast-15148602", "ord_in_thread": 0, "title": "MPs on maternity leave will be allowed to cast 'proxy votes'", "locations": [], "entities": {"persons": [{"name": "north", "sentiment": "negative"}, {"name": "pidcock", "sentiment": "none"}, {"name": "andrea leadsom", "sentiment": "none"}, {"name": "theresa may", "sentiment": "none"}, {"name": "laura pidcock", "sentiment": "none"}], "locations": [{"name": "westminster", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "house of commons", "sentiment": "none"}, {"name": "durham", "sentiment": "none"}, {"name": "parliament", "sentiment": "none"}, {"name": "north durham", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News MPs on maternity leave will be allowed to cast 'proxy votes' The rule change comes after North Durham MP Laura Pidcock was forced to go to Parliament while eight months pregnant Share Prime Minister Theresa May speaking during Prime Minster's Questions in the House of Commons, London (Image: PA) Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nMPs will be allowed to cast votes on behalf of absent colleagues for the first time ever, under proposed new rules backed by the Government.\nCommons leader Andrea Leadsom said she was backing calls to introduce proxy voting, allowing MPs on maternity leave or suffering from illness to have their say without making the trip to Westminster.\nIt comes after North Durham MP Laura Pidcock was forced to travel to London to vote despite being eight months pregnant and in pain.\nMs Pidcock was one of a number of seriously ill and heavily pregnant MPs who struggled into the House of Commons to vote on Brexit legislation earlier this year. North West Durham MP Laura Pidcock (Image: Reuters Live Stream)\nShe described being in “extreme discomfort”, saying: “I have had to struggle in to parliament, aided by a wheelchair at times, only to be checked out by Government whips to make sure that I’m not faking it.”\nLabour MP Naz Shah came straight from hospital to take part in the same vote.\nThe Government came in for criticism after it refused to honour a longstanding convention that allowed sick MPs to be “nodded through”, rather than physically walking through the lobbies.\nThere was also anger when the Government appeared to break a “pairing” arrangement, in which Tory MP Brandon Lewis was supposed to refrain from voting because he was paired with Lib Dem MP Jo Swinson, who had recently given birth. Brandon Lewis MP (Image: Aldershot News and Mail)\nMr Lewis, the Conservative Chair, voted anyway, apparently under orders from a party whip.\nPairing is meant to ensure that a political party isn’t penalised when one of their MPs cannot take part in a vote.\nIf pairing arrangements break down then parties face a choice between accepting that they lose influence when MPs are on maternity leave - or ordering them to come to the Commons anyway. Read More Transport Secretary Chris Grayling urged to resign over East Coast Main Line fiasco\nIn an article for the Times, Ms Leadsom said: “Everyone should be able to spend time with their newborn babies - even, dare I say it, MPs.\n“That’s why when the Commons debates the issue of parental leave today I will commit to introducing a system of proxy voting to allow this to happen.” Andrea Leadsom (Image: Chris Radburn/PA Wire)\nShe added: “I believe passionately that every child deserves to be given the best possible start in life. MPs’ children deserve the same as everybody else so resolving this issue is a priority for me.\n“As leader of the house I have a constitutional responsibility as well as a pastoral one.\n“Our political space should be made as inclusive as possible if we want the best people to stand for parliament.\n“Allowing an MP who wishes to spend time with their baby the chance to appoint a proxy to vote on their behalf would be an absolute game-changer in making a career in politics far more conducive to living a ‘normal’ life.”\nLabour MP Harriet Harman said she expects a vote on changing the rules to be held in October. Read More See Jacob Rees-Mogg and his family get ambushed by protesters as North East MP offers support\nLabour’s Emma Reynolds said three MPs from her party were on maternity leave, adding: “I am worried that the Government might try to delay the introduction of proxy voting because of the big Brexit votes coming through in the autumn. I hope that they don’t do that and they do the right thing.”\nShe said she was “hopeful that MPs will do the right thing”, adding: “We have been dragging our feet on this for too long and we should be setting an example.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-13T18:37:00.000+03:00", "crawled": "2018-09-13T20:00:50.029+03:00", "highlightTitle": ""}