{"organizations": [], "uuid": "7edb40226010a4e5862b55892adad81e229f80a9", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.leicestermercury.co.uk", "main_image": "https://i2-prod.leicestermercury.co.uk/incoming/article881376.ece/ALTERNATES/s1200/1_4013066.jpg", "site_section": "http://www.leicestermercury.co.uk/rss.xml", "section_title": "Leicestershire Live - frontpage", "url": "https://www.leicestermercury.co.uk/news/business/john-lewis-waitrose-profits-slump-1999547", "country": "GB", "domain_rank": 48128, "title": "John Lewis and Waitrose profits slump 99 per cent", "performance_score": 0, "site": "leicestermercury.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-13T12:53:00.000+03:00", "replies_count": 0, "uuid": "7edb40226010a4e5862b55892adad81e229f80a9"}, "author": "Tom Pegden", "url": "https://www.leicestermercury.co.uk/news/business/john-lewis-waitrose-profits-slump-1999547", "ord_in_thread": 0, "title": "John Lewis and Waitrose profits slump 99 per cent", "locations": [], "entities": {"persons": [{"name": "john lewis", "sentiment": "negative"}, {"name": "highcross leice", "sentiment": "negative"}, {"name": "elton john", "sentiment": "none"}], "locations": [{"name": "highcross", "sentiment": "none"}, {"name": "leicester", "sentiment": "none"}], "organizations": [{"name": "group", "sentiment": "negative"}, {"name": "john lewis & partners", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News John Lewis and Waitrose profits slump 99 per cent Group, with landmark store in Highcross Leicester, saw profits of just £1.2m in the first six months of year Share Get Business updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nProfits at John Lewis Partnership and Waitrose have slumped almost 99 per cent this year due to tough conditions on the high street and shoppers taking advantage of its policy to price match competitors.\nThe group - which has a landmark store in Leicester's Highcross - reported profits of just £1.2 million in the first six months of the year.\nThat compares to a profit of £83 million in the same period last year.\nThe business warned that its eventual full-year profits would also be substantially down.\nIt said profits at John Lewis & Partners have continued to be squeezed by strong competition as it moves to keep prices low despite inflation, and has offered \"unprecedented\" levels of price-matching through its Never Knowingly Undersold pledge.\nEarlier this week it was reported that the firm had paid Sir Elton John £5 million to feature in this year's Christmas advert. John Lewis in Highcross, Leicester\nAnd in March it was revealed the annual bonus - paid to all staff at the firm - was just five per cent, the lowest figure since 1954.\nThere are Waitrose stores in Oadby, Blaby, Mountsorrel and Lutterworth and at the Leicester Forest East Services on the M1.\nSir Charlie Mayfield, chairman of the John Lewis Partnership, said: \"These are challenging times in retail.\"\nHe said the group was seeing the \"most promotional market we've seen in almost a decade\", with other retailers discounting heavily.\nHe warned: \"With the level of uncertainty facing consumers and the economy, in part due to ongoing Brexit negotiations, forecasting is particularly difficult but we continue to expect full-year profits to be substantially lower than last year for the Partnership as a whole.\"\nThe business - which recently rolled out the '& Partners' rebrand across the group - had warned about expected profits at a strategy update in June, when it also said it would shut another four Waitrose convenience shops and a small supermarket, affecting around 200 staff.\nJohn Lewis department stores slumped to an underling operating loss of £19.2 million. John Lewis in Highcross, Leicester\nThis offset a better performance at Waitrose, which remained in profit, albeit down 12.2 per cent at £96.4 million on an underlying basis.\nSir Charlie said the group expects profit growth in Waitrose to continue to be offset by the squeeze at John Lewis.\nBut he pledged to continue with plans to invest in the group - at a rate of £400 million to £500 million a year - despite the pressures on its profits to drive long-term growth. Read More\nHe said: \"This will take a lot of hard work from all of our partners, but we are confident in our commitment, drive and ability to deliver the partnership's strategy.\" Read More\nThe department store sector has faced a turbulent few months.\nHouse of Fraser was sold to Sports Direct in the summer.\nWhile Debenhams , which has just revamped its Highcross store and is still in talks with the owner of Fosse Park to build a new store there, has brought in advisers from KPMG to help turn around the business. Like us on Facebook ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/leicestermercury/subscriptions/&quot;}"], "published": "2018-09-13T12:53:00.000+03:00", "crawled": "2018-09-13T13:13:25.044+03:00", "highlightTitle": ""}