{"organizations": [], "uuid": "a4ad7b4bdcbf5d91f0e094187bc7dac715799562", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.devonlive.com", "main_image": "https://i2-prod.devonlive.com/news/devon-news/article2038723.ece/ALTERNATES/s1200/0_geograph-4832517-by-Lewis-Clarke.jpg", "site_section": "https://www.devonlive.com/rss.xml", "section_title": "Devon Live - frontpage", "url": "https://www.devonlive.com/news/devon-news/council-split-exe-valley-area-2038718", "country": "US", "title": "Council split on Exe Valley Area of Outstanding Natural Beauty plan", "performance_score": 0, "site": "devonlive.com", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-24T17:51:00.000+03:00", "replies_count": 0, "uuid": "a4ad7b4bdcbf5d91f0e094187bc7dac715799562"}, "author": "Lewis Clarke", "url": "https://www.devonlive.com/news/devon-news/council-split-exe-valley-area-2038718", "ord_in_thread": 0, "title": "Council split on Exe Valley Area of Outstanding Natural Beauty plan", "locations": [], "entities": {"persons": [{"name": "john bodley-scott", "sentiment": "none"}], "locations": [{"name": "exe valley area", "sentiment": "none"}, {"name": "tiverton", "sentiment": "none"}, {"name": "mid devon", "sentiment": "none"}, {"name": "exe valley", "sentiment": "none"}, {"name": "grand western canal", "sentiment": "none"}], "organizations": [{"name": "environment pdg", "sentiment": "none"}, {"name": "mid devon district council’s environment policy development group", "sentiment": "none"}, {"name": "aonb", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Council split on Exe Valley Area of Outstanding Natural Beauty plan Environmental protection, tourism and cost weighed up by councillors Share Get Daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nA decision is set to be made on whether a large area of the Exe Valley surrounding Tiverton should be turned into an Area of Outstanding Natural Beauty (AONB)\nMid Devon District Council’s Environment Policy Development Group (PDG) met on Tuesday, September 4 and voted in favour of the scheme. On Thursday, September 6, the Economy PDG met and voted against pursuing such an idea.\nSpeaking at the Environment PDG, John Bodley-Scott, Mid Devon’s Economic Development Team Leader) outlined that there would be an immediate cost of £40k for the first six months and around £250k over three years with ongoing costs of up to £300k annually to fund the ongoing delivery of the AONB management plan. Read More Heatwave causes a summer of leaks and cracks on Grand Western Canal\nHe said: “If the council chooses to seek full AONB designation there would be a need to develop a detailed evidence base which has cost and requires a lot of detailed survey work, particularly on environmental issues.\n“There are questions of defining the extent of the area because even though it would be nice and neat to fit it into local authority boundaries the criteria on which you are judged is based purely on landscape character and the character of the area naturally flows into other authorities. If you went forward, it would probably involve other local authority areas.\n“Once you have an AONB there are ongoing management costs to keep that going. There are obviously quite significant planning implications. The national planning policy framework outlines that AONBs have the same planning designation as national parks.\n“One important thing that came out from discussing with landowners was the need to balance environmental benefits of an AONB designation with the economic growth. This came out particularly in context or post-Brexit scenario particularly for agriculture and a change of subsidies that landowners, in particular, might feel that the restrictions imposed by the AONB might not allow them to do things they will need to do to keep their economy even. That would need to be balanced very carefully and the Council.\n“Then there are resource implications, not only in terms of officer capacity but also of a specification environmental knowledge and understanding to take that forward.”\nCouncillor Jenny Roach (Silverton, Liberal) said that there was “without doubt” public support for the scheme: “I was tasked with going out and talking to the parish councils and other people. I went to Tiverton Town Council and gave a talk to them about the AONB, and the whole basis of that was that people wanted to recognise that the Exe Valley is an incredibly beautiful valley and needs to be recognised as such and protected.\n“I went to see the largest landowner in Silverton about this, and he was totally supportive because having that status would mean that more people visitors would come and more would go to the farm diversification project that across the area.\n“In terms of public support, I think without a doubt there is already evidence. I contacted every single parish council plus lots of phone calls and 90 per cent were in favour of designating the Exe Valley as an AONB.” Read More Villagers 'devastated' as popular pub closes after 350 years\nMembers acknowledged that there was a Government Review of AONB’s due in 2019, but they felt that this should not delay the pursuit of the Exe Valley AONB despite uncertainties about what the Government Review would mean.\nCouncillor Bob Deed (Cadbury, Independent) added: “I appreciate there is of cost, there's always a cost to maintain the things that we love in this world.\n“I would suggest that I support this AONB and that we go forward and we don't defer it for any longer. This has been before all this council for at least five years. Putting it off for another year or two or three I don't support.”\nCouncillor Frank Letch (Lawrence, Liberal Democrats) agreed. “We should get moving,” he said.\n“If you look around, most of us in our 70s, By the time this gets finished we'll be in our 80s or even dead. This is a policy development group, and I think we should be developing a policy not just for us but generations below us, our children and our grandchildren.\"\nHowever, at the Economy PDG, members spoke out against such a scheme.\nCouncillor Nikki Woollatt (Cullompton North, Independent) said it could be a “poison chalice”.\n“What worries me from this is the inflationary effect on house prices,” she said.\n“Many of our villages are already dying because young people can't afford to buy houses in the villages and this is going to make it even more difficult.” Read More Cyclist seriously injured on busy Exeter road 'wasn't wearing a helmet'\nCouncillor Glanmor Hughes (Upper Culm, Conservative) said that while it was an attractive area, it did not have the star quality of places like Exmoor and Dartmoor.\n“The cost, of course, frightens me,” he said. “It's nearly a quarter of a million pounds to start it off and to put it mildly we would be scratching for that sort of money in this day and age. A nice idea perhaps but I certainly wouldn't recommend it myself.”\nCouncillor Rosemary Berry (Cullompton Outer, Conservative) shared the views of Cllr Woollatt.\nShe said: “Having grown up on the Blackdown Hills, having AONB status has lifted the whole area and brought prosperity but Nikki is right, most of the local people who grew up on the Blackdown Hills can no longer afford to buy a house there.\n“It stifles all sorts of development, but the costs are what concerns me. When we're looking to cut things from the budget, can we afford it?”\nCabinet will meet on Thursday, September 27 to discuss the issue further. Read More ", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/devonlive/subscriptions/&quot;}"], "published": "2018-09-24T17:51:00.000+03:00", "crawled": "2018-09-24T18:03:46.014+03:00", "highlightTitle": ""}