{"organizations": [], "uuid": "4fc43443919d6cdc1fac550a01cbc9b4101ac1ef", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15216584.ece/ALTERNATES/s1200/0_rally.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/news/north-east-news/were-many-protests-newcastle-today-15217750", "country": "GB", "domain_rank": 21960, "title": "Why were there so many protests in Newcastle today? Crowds rally about the EU, Mike Ashley and burqas", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-29T21:51:00.000+03:00", "replies_count": 0, "uuid": "4fc43443919d6cdc1fac550a01cbc9b4101ac1ef"}, "author": "Hannah Graham", "url": "https://www.chroniclelive.co.uk/news/north-east-news/were-many-protests-newcastle-today-15217750", "ord_in_thread": 0, "title": "Why were there so many protests in Newcastle today? Crowds rally about the EU, Mike Ashley and burqas", "locations": [], "entities": {"persons": [{"name": "mike ashley", "sentiment": "negative"}], "locations": [{"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "grey", "sentiment": "none"}], "organizations": [{"name": "eu", "sentiment": "none"}, {"name": "newcastle", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Why were there so many protests in Newcastle today? Crowds rally about the EU, Mike Ashley and burqas Anyone in Newcastle on Saturday may have noticed a number of different events, campaigning about everything from Brexit to NUFC Share People's Vote rally at the Monument Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nAnyone who found themselves in Newcastle on Saturday may have noticed several very vocal crowds, as campaigners mobilised throughout the city centre.\nBut what exactly were they all protesting about?\nThe city was filled with crowds campaigning on a wide range of subjects: everything from the EU to Mike Ashley.\nAt Grey’s Monument, a large crowd of vocal anti-racism protesters joined forces to show solidarity with the city’s Muslim community. The groups said they had gathered in response to far-right attacks on women who wear the burqa.\nAccording to organisers Newcastle Unites and Stand Up To Racism North East, the demonstration aimed to show “support for these women and their freedom to choose what they wear, whilst also opposing the Far-Right and general culture of islamophobia.\n“We need to demonstrate that religious freedom and support is stronger than religious oppression in the North East.” People's Vote rally at the Monument (Image: newcastle chronicle)\nMeanwhile, campaigners gathered in Newcastle as part of the People’s Vote National Day of Action .\nActivists and supporters united across the country in order to demand their right to a vote on the final Brexit deal.\nMore than 100 groups took to the streets in towns and cities the length and breadth of the country, in areas that voted both remain and leave.\nNationally, over 2,000 activists and supporters took part with more than 1,000 door to door leafleting sessions organised and over one million leaflets handed out.\nNewcastle’s pro-EU protesters were to be found on Northumberland street, putting their case for a second vote to shoppers on the busy street. People's Vote campaign in Newcastle\nDavid Gwyther, field manager at the People’s Vote campaign, said: “Our largest ever day of action is a fantastic demonstration of the levels of support across the country for a People’s Vote on the terms of Brexit.\n“Thousands of volunteers and campaigners took part across the whole UK, in areas that voted both leave and remain in 2016.\n“The facts have changed massively since then and people want to make their voices heard on Brexit through a People’s Vote.\n“Brexit is going to affect generations for generations, so it’s only right that everyone gets a say in the path we take, not just 650 MPs in Westminster.\n“That’s why we are demanding a People’s Vote on the terms of Brexit.”\nPeople’s Vote is attempting to build public support for a referendum on the final Brexit deal and convince voters that Brexit is not inevitable. Read More People's Vote Newcastle rally: Campaigners demand right to vote on final Brexit deal\nThe Conservative conference is expected to be dominated by the party’s splits on Brexit, with Prime Minister Theresa May under pressure to ditch her Chequers plan after it was rejected by EU leaders and many of her own MPs.\nOn a less political note, Newcastle United’s home clash against Leicester was also marked by protest - this time, by fans opposed to the leadership of Magpies’ owner Mike Ashley. Newcastle United fans protest outside of the ground ahead of the Premier League match at St James' Park, Newcastle (Image: PA)\nFans lined the Strawberry Place as well as the concourse up on the Gallowgate with banners of Kevin Keegan and Rafa Benitez hanging over the barrier. Read More", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-29T21:51:00.000+03:00", "crawled": "2018-09-29T23:09:18.030+03:00", "highlightTitle": ""}