{"organizations": [], "uuid": "7652b8aa74b14c3e1e1195e2c4658b8821c752e5", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15208445.ece/ALTERNATES/s1200/0_Untitled-design-5.jpg", "site_section": "http://www.chroniclelive.co.uk/all-about/rss.xml", "section_title": "ChronicleLive - Home", "url": "https://www.chroniclelive.co.uk/special-features/mike-ashley-calls-landlords-local-15208400", "country": "GB", "domain_rank": 21960, "title": "A new role for Mike Ashley as House of Fraser rescue challenges landlords", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-27T16:33:00.000+03:00", "replies_count": 0, "uuid": "7652b8aa74b14c3e1e1195e2c4658b8821c752e5"}, "author": "Mike Hughes", "url": "https://www.chroniclelive.co.uk/special-features/mike-ashley-calls-landlords-local-15208400", "ord_in_thread": 0, "title": "A new role for Mike Ashley as House of Fraser rescue challenges landlords", "locations": [], "entities": {"persons": [{"name": "mike", "sentiment": "negative"}, {"name": "mike ashley", "sentiment": "negative"}, {"name": "ashley", "sentiment": "none"}, {"name": "fraser", "sentiment": "none"}], "locations": [], "organizations": [{"name": "hughes", "sentiment": "negative"}, {"name": "house of fraser", "sentiment": "negative"}, {"name": "newcastle united", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Advertorial A new role for Mike Ashley as House of Fraser rescue challenges landlords Mike (Hughes) looks at a new role for Mike (Ashley) and a strong phase for commercial property in the region Share 14:54, 27 SEP 2018 Advertorial Mike Ashley has called on landlords to help his House of Fraser rescue (Image: DAILY RECORD) Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nWell, well... a news story about Newcastle United owner Mike Ashley that elevates him to the Commercial Property pages.\nHis Sports Direct empire has ensured that Ashley had a powerful influence on our high streets, but his anger at landlords who were reluctant to help support his House of Fraser rescue operation moves him that one step further into this supplement.\nWhile he tries to come to terms with this new dizzying status and the fact that many people might be chanting ‘Ashley in, Ashley in...’ for a change, let’s look at what he has been saying, and how it comes at an interesting time for the sector.\nOur new friend has blamed ‘greedy landlords’ for the closing of some stores – although branches in the North East look set to be saved. Read More Thinking about purchasing a business? Not sure where to start? Expert advisers at Christie & Co are ready to help\nMr Ashley – who took over House of Fraser in August – said: “I am disappointed that in my opinion a small number of greedy landlords still refuse to be reasonable. We’ve showed what we can achieve on the British high street when we work together with landlords.\n“I would like to thank those landlords who have helped us to rescue approximately 3,500 jobs at the stores we have saved to date.\n“I am calling on everybody to pull together, including landlords and local authorities in order to help to save as many House of Fraser stores and jobs as possible on the great British high street.” Mike Ashley has blamed ‘greedy landlords’ for the closing of some stores – although branches in the North East look set to be saved (Image: PA)\nHis comments may annoy those who think if he’s bought them he should pay for them, but perhaps on this occasion he is making an interesting point.\nHe is bankrolling the operation, but is asking for short-term help to maintain a vision that saves jobs for a lot of people, and while British Property Federation chief Melanie Leech is right to say “each party will have its own interests...” this might be one where another ‘black and white knight’ riding to the rescue in this particular sector might have been greeted with a more understanding and flexible reaction.\nIn other news, Naylors director Keith Stewart admits it has been a quiet summer, but says the latter part of August was busy.\n“Brexit is still a concern for some occupiers who are putting some projects on hold until there is certainty on the outcome, while a number of occupiers are looking at medium sized buildings around 20,000-30,000 sq ft which has been a struggle in the last 12-18 months,” he said.\n“Large units are still in short supply, however there has been a slowdown in larger enquiries in Q2, but SMEs are still buoyant and are finding a limited number of small units available.” Read More Bradley Hall celebrates 'outstanding year' in commercial property market\nAnd its is thirty cheers for one of the region’s leading property firms, which has announced plans to introduce an advisory board during its 30th year. Bradley Hall Chartered Surveyors and Estate Agents has appointed established local businessman and solicitor John Marshall as chairman of that board. He will work in close partnership with the senior management team to support its ambitions.\nOver on West Road in Newcastle, a Newcastle jobcentre could be converted into apartments after being closed amid a Government shake-up.\nCondercum House was among dozens of jobcentres across the UK which were earmarked to be closed or merged as part of sweeping changes by the Department for Work and Pensions.\nLooking further afield, a North East pub and hotel group has acquired its ninth site after buying its first property in the Lake District.\nThe Inn Collection Group has bought the Waterhead Hotel – a 24-bedroom property on Coniston Water – from the Post Office Fellowship of Remembrance, an organisation that looks after former Post Office and BT workers. Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-27T16:33:00.000+03:00", "crawled": "2018-09-27T17:18:41.030+03:00", "highlightTitle": ""}