{"organizations": [], "uuid": "7f81377b02da2bfe0d5580417330923789562ca3", "thread": {"social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}, "site_full": "www.chroniclelive.co.uk", "main_image": "https://i2-prod.chroniclelive.co.uk/incoming/article15163856.ece/ALTERNATES/s1200/0_Liberal-Democrats-Autumn-Conference-2018.jpg", "site_section": "http://www.thejournal.co.uk/news/?service=rss", "section_title": "ChronicleLive - News", "url": "https://www.chroniclelive.co.uk/news/north-east-news/sir-vince-cable-reveals-plan-15163820", "country": "GB", "domain_rank": 21960, "title": "Sir Vince Cable reveals plan to save the Liberal Democrats following 'bad period in party’s history'", "performance_score": 0, "site": "chroniclelive.co.uk", "participants_count": 1, "title_full": "", "spam_score": 0.0, "site_type": "news", "published": "2018-09-17T18:00:00.000+03:00", "replies_count": 0, "uuid": "7f81377b02da2bfe0d5580417330923789562ca3"}, "author": "Jonathan Walker", "url": "https://www.chroniclelive.co.uk/news/north-east-news/sir-vince-cable-reveals-plan-15163820", "ord_in_thread": 0, "title": "Sir Vince Cable reveals plan to save the Liberal Democrats following 'bad period in party’s history'", "locations": [], "entities": {"persons": [{"name": "vince cable", "sentiment": "negative"}, {"name": "ian lavery", "sentiment": "none"}, {"name": "lavery", "sentiment": "none"}, {"name": "conservati", "sentiment": "none"}], "locations": [{"name": "brighton", "sentiment": "none"}], "organizations": [{"name": "liberal democrats", "sentiment": "negative"}, {"name": "news sir vince cable", "sentiment": "negative"}, {"name": "coalition", "sentiment": "none"}, {"name": "wansbeck labour", "sentiment": "none"}, {"name": "labour", "sentiment": "none"}, {"name": "invalid email liberal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "News Sir Vince Cable reveals plan to save the Liberal Democrats following 'bad period in party’s history' The Lib Dem leader wants to give non-members a role in the party as he admits it is recovering from a bad period Share Leader of the Liberal Democrats Sir Vince Cable (Image: PA) Get daily updates directly to your inbox Subscribe Thank you for subscribing See our privacy notice Could not subscribe, try again later Invalid Email\nLiberal Democrat leader Vince Cable has set out plans to make the party a major force in British politics again by opening it up to non-members.\nHe wants to let non-members vote in leadership elections, and to allow members who aren’t MPs to become leader.\nBut he came under fire from Wansbeck Labour MP Ian Lavery, who highlighted the Lib Dem’s coalition with the Conservatives from 2010 to 2015.\nMr Lavery, Labour’s chair, said: “Never forget their unfettered collaboration with the Tories.” Wansbeck MP Ian Lavery\nSenior Liberal Democrats at the party’s annual conference in Brighton disagreed about the wisdom of joining the Coalition, which ensured Conservative David Cameron could become Prime Minister.\nDeputy leader Jo Swinson used a conference speech to admit the party “lost too many arguments” in coalition and had agreed to compromises that “sucked”.\nAs examples of poor policies the Lib Dems failed to block, she highlighted the “hostile environment” immigration policy introduced by Theresa May, the Home Secretary at the time, and the bedroom tax, which involved cutting benefits for some social housing tenants.\nHowever, just hours later former energy secretary Sir Ed Davey was defending the party’s record - telling journalists in the conference media room he was “deeply, deeply proud” of his achievements during that period. Energy and Climate Change Secretary Ed Davey (Image: Danny Lawson/PA Wire) Read More\nSir Vince told a members-only meeting at the Brighton conference: “We are doing well. We’re recovering from a bad period in our party’s history.\n“But we’re not recovering fast enough, or going far enough.”\nHis proposals include creating a new “supporter class” in the party, similar to the Labour Party’s “Registered Supporters”, who would pay a lower membership fee in order to vote in leadership elections.\nHe confirmed the rule changes would allow party members who are not MPs to stand to be party leader. Sir Vince Cable (Image: PA)\nAnd the plan would scrap rules that prevents new members from standing for office until they have been members for at least a year.\nSir Vince told members the rule changes would be subject to a full consultation of members.\nBut by raising the prospect of a leadership election, Sir Vince has encouraged speculation that he plans to stand down in the near future.\nHe was forced to reject claims he is “running out of road”, as he again refused to set a firm resignation date. Read More Home Office urged to help Operation Sanctuary sex abuse victims put their lives back together\nAsked over the weekend if he would still be party leader by the end of next year, Sir Vince said: “I think that’s uncertain. I have a series of tasks to do. I’m going to do them. I’m not setting a time horizon. I think it would be foolish to do so with so much uncertainty flying around.”\nThere has been speculation that Sir Vince’s reforms would allow anti-Brexit campaigner Gina Miller to become party leader.\nBut she appeared to rule herself out, as she delivered a speech at the conference.\nShe said: “I am not addressing you as your leader-in-waiting.” Like us on Facebook", "external_links": ["https://comm-proxy.tm-awx.com/api/publications/nechronicle/subscriptions/&quot;}"], "published": "2018-09-17T18:00:00.000+03:00", "crawled": "2018-09-18T06:39:43.016+03:00", "highlightTitle": ""}